//-----------------------------------------------------------------------------
// File : ModelViewer.h
// Desc : Model Viewer.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fw/asdxApp.h>
#include <fw/asdxAppCamera.h>
#include <gfx/asdxCommandQueue.h>
#include <gfx/asdxModel.h>
#include <gfx/asdxPipelineState.h>
#include <gfx/asdxBuffer.h>
#include <gfx/asdxShape.h>
#include <gfx/asdxMotionPlayer.h>
#include <gfx/asdxLine.h>
#include <ModelPrefabConverter.h>
#include <EditMaterial.h>
#include <imgui.h>
#include <ImGuizmo.h>


///////////////////////////////////////////////////////////////////////////////
// ModelViewer class
///////////////////////////////////////////////////////////////////////////////
class ModelViewer : public asdx::App
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

public:
    //=========================================================================
    // public variables.
    //=========================================================================


    //=========================================================================
    // public mehtods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ModelViewer();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ModelViewer();

private:
    struct ModelInfo
    {
        size_t  MeshCount;
        size_t  MaterialCount;
        size_t  VertexCount;
        size_t  IndexCount;
        size_t  BoneCount;
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    asdx::WaitPoint                     m_FrameWaitPoint;
    std::vector<uint8_t>                m_ModelBinary;
    asdx::RefPtr<asdx::Model>           m_Model;
    std::string                         m_ModelOutputPath;
    std::string                         m_PrefabOutputPath;
    asdx::RefPtr<ID3D12RootSignature>   m_RootSignature;
    asdx::GraphicsPipelineState         m_StaticSolidState;
    asdx::GraphicsPipelineState         m_SkeletalSolidState;
    asdx::GraphicsPipelineState         m_StaticWireframeState;
    asdx::GraphicsPipelineState         m_SkeletalWireframeState;
    ModelInfo                           m_ModelInfo          = {};
    asdx::ConstantBuffer                m_SceneCB[2]         = {};
    asdx::AppCamera                     m_Camera             = {};
    uint32_t                            m_DrawMode           = 0;
    bool                                m_DrawBoundingSphere = false;
    bool                                m_DrawBones          = false;
    bool                                m_EnableWireframe    = false;
    asdx::Vector3                       m_ModelTranslation   = asdx::Vector3(0.0f, 0.0f, 0.0f);
    asdx::Vector3                       m_ModelRotation      = asdx::Vector3(0.0f, 0.0f, 0.0f);
    asdx::Vector3                       m_ModelScale         = asdx::Vector3(1.0f, 1.0f, 1.0f);
    bool                                m_EnableGuizmo       = false;
    ImGuizmo::OPERATION                 m_GuizmoOperation    = {};
    asdx::Matrix                        m_Proj;
    asdx::BoneShape                     m_BoneShape;
    asdx::SphereShape                   m_SphereShape;
    asdx::ShapeStates                   m_ShapeStates;
    asdx::ShapeParams                   m_ShapeParams;
    asdx::MotionPlayer                  m_MotionPlayer;
    asdx::MotionBinary                  m_MotionBinary;
    asdx::LineRenderer                  m_LineRenderer;
    size_t                              m_ClipIndex     = 0;
    std::vector<std::string>            m_ClipNames     = {};
    asdx::StructuredBuffer              m_MatrixPalletBuffer[2];
    ModelPrefab                         m_Prefab;
    std::vector<edit::Material>         m_EditMaterials;
    bool                                m_ShowLisence   = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //-------------------------------------------------------------------------
    bool OnInit() override;

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void OnTerm() override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム遷移処理です.
    //-------------------------------------------------------------------------
    void OnFrameMove(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム描画処理です.
    //-------------------------------------------------------------------------
    void OnFrameRender(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理です.
    //-------------------------------------------------------------------------
    void OnResize(const asdx::App::ResizeEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      キー処理です.
    //-------------------------------------------------------------------------
    void OnKey(const asdx::App::KeyEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      マウス処理です.
    //-------------------------------------------------------------------------
    void OnMouse(const asdx::App::MouseEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      タイピング処理です.
    //-------------------------------------------------------------------------
    void OnTyping(uint32_t keyCode) override;

    //-------------------------------------------------------------------------
    //! @brief      ファイルドロップ処理です.
    //-------------------------------------------------------------------------
    void OnDrop(const wchar_t** dropFiles, uint32_t fileCount) override;

    //-------------------------------------------------------------------------
    //! @brief      ファイルメニュー処理です.
    //-------------------------------------------------------------------------
    void MenuFile(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      ヘルプメニュー処理です.
    //-------------------------------------------------------------------------
    void MenuHelp();

    //-------------------------------------------------------------------------
    //! @brief      モデルを再生成します.
    //-------------------------------------------------------------------------
    void RecreateModel();

    //-------------------------------------------------------------------------
    //! @brief      プレハブを再生します.
    //-------------------------------------------------------------------------
    void RecreatePrefab();

    //-------------------------------------------------------------------------
    //! @brief      モデルバイナリを保存します.
    //-------------------------------------------------------------------------
    void SaveModelBinary(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      マテリアルバイナリを保存します.
    //-------------------------------------------------------------------------
    void SaveMaterialBinary(const char* path, edit::Material& material);

    //-------------------------------------------------------------------------
    //! @brief      プレハブバイナリを保存します.
    //-------------------------------------------------------------------------
    void SavePrefabBinary(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      モデルを読み込みます.
    //-------------------------------------------------------------------------
    void LoadModel();

    //-------------------------------------------------------------------------
    //! @brief      モーションを読み込みます.
    //-------------------------------------------------------------------------
    void LoadMotion();

    //-------------------------------------------------------------------------
    //! @brief      プレハブを読み込みます.
    //-------------------------------------------------------------------------
    void LoadPrefab();

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを読み込みます.
    //-------------------------------------------------------------------------
    void LoadMaterial(const char* path, edit::Material& material);

    //-------------------------------------------------------------------------
    //! @brief      モデル情報を描画します.
    //-------------------------------------------------------------------------
    void DrawModelInfo();

    //-------------------------------------------------------------------------
    //! @brief      コンテキストメニューを描画します.
    //-------------------------------------------------------------------------
    void DrawContextMenu(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      ギズモを描画します.
    //-------------------------------------------------------------------------
    void DrawGizmo(asdx::Matrix& modelWorld);

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを描画します.
    //-------------------------------------------------------------------------
    void DrawBoundingSphere(const asdx::Matrix& modelWorld);

    //-------------------------------------------------------------------------
    //! @brief      ボーンを描画します.
    //-------------------------------------------------------------------------
    void DrawBones(const asdx::Matrix& modelWorld);

    //-------------------------------------------------------------------------
    //! @brief      プロパティウィンドウを描画します.
    //-------------------------------------------------------------------------
    void DrawPropertyWindow();

    //-------------------------------------------------------------------------
    //! @brief      マテリアルタブを描画します.
    //-------------------------------------------------------------------------
    void DrawMaterialTab();

    //-------------------------------------------------------------------------
    //! @brief      モーションタブを描画します.
    //-------------------------------------------------------------------------
    void DrawMotionTab();

    //-------------------------------------------------------------------------
    //! @brief      デバッグタブを描画します.
    //-------------------------------------------------------------------------
    void DrawDebugTab();

    //-------------------------------------------------------------------------
    //! @brief      ライセンス情報を描画します.
    //-------------------------------------------------------------------------
    void DrawLisence();
};
