//-----------------------------------------------------------------------------
// File : MeshletTestPS.hlsl
// Desc : Test For Meshlet Draw.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "asdxMath.hlsli"


///////////////////////////////////////////////////////////////////////////////
// MSOutput structure
///////////////////////////////////////////////////////////////////////////////
struct MSOutput
{
    float4  Position     : SV_POSITION;
    uint    TexCoord     : TEXCOORD;
    uint    TangentSpace : TANGENT_SPACE;
    uint    MeshletId    : MESHLET_ID;
};

//-----------------------------------------------------------------------------
//      デバッグカラーを取得します.
//-----------------------------------------------------------------------------
float3 DebugColor(uint index)
{
    return float3(
        float(index & 1),
        float(index & 3) / 4,
        float(index & 7) / 8);
}

//-----------------------------------------------------------------------------
//      メインエントリーポイントです.
//-----------------------------------------------------------------------------
float4 main(const MSOutput input) : SV_TARGET
{
    //return float4(DebugColor(input.MeshletId), 1.0f);
    return float4(1.0f, 0.0f, 0.0f, 1.0f);
}