//-----------------------------------------------------------------------------
// File : asdxOffsetAllocator.h
// Desc : Offset Allocator.
//-----------------------------------------------------------------------------
// Original Code Written by Sebastian Aaltonen.
// See. https://github.com/sebbbi/OffsetAllocator/blob/main/LICENSE

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// OffsetHolder class
///////////////////////////////////////////////////////////////////////////////
class OffsetHolder
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    friend class OffsetAllocator;

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    static constexpr uint32_t INVALID_ID = UINT32_MAX;

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    OffsetHolder() = default;

    //-------------------------------------------------------------------------
    //! @brief      コピーコンストラクタです.
    //-------------------------------------------------------------------------
    OffsetHolder(const OffsetHolder& value)
    : m_Offset(value.m_Offset)
    , m_Size  (value.m_Size)
    , m_NodeId(value.m_NodeId)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      オフセットを取得します.
    //!
    //! @return     オフセットを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetOffset() const
    { return m_Offset; }
    
    //-------------------------------------------------------------------------
    //! @brief      サイズを取得します.
    //! 
    //! @return     サイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetSize() const
    { return m_Size; }
    
    //-------------------------------------------------------------------------
    //! @brief      有効化どうかチェックします.
    //! 
    //! @retval true    有効です.
    //! @retval false   無効です.
    //-------------------------------------------------------------------------
    bool IsValid() const
    { return m_Offset != INVALID_ID; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint32_t m_Offset = INVALID_ID;     //!< オフセットです.
    uint32_t m_Size   = 0;              //!< サイズです.
    uint32_t m_NodeId = INVALID_ID;     //!< ノードIDです.

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      offset      オフセットです.
    //! @param[in]      size        サイズです.
    //! @param[in]      nodeId      ノードIDです.
    //-------------------------------------------------------------------------
    explicit OffsetHolder(uint32_t offset, uint32_t size, uint32_t nodeId)
    : m_Offset(offset)
    , m_Size  (size)
    , m_NodeId(nodeId)
    { /* DO_NOTHING */ }
};

///////////////////////////////////////////////////////////////////////////////
// OffsetAllocator class
///////////////////////////////////////////////////////////////////////////////
class OffsetAllocator
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    static constexpr uint32_t DEFAULT_MAX_COUNT = 128 * 1024;                       //!< デフォルトの最大アロケーション可能回数です.
    static constexpr uint32_t TOP_BINS_COUNT    = 32;                               //!< トップビンの数です.
    static constexpr uint32_t BINS_PER_LEAF     = 8;                                //!< リーフあたりのビンの数です.
    static constexpr uint32_t LEAF_BINS_COUNT   = TOP_BINS_COUNT * BINS_PER_LEAF;   //!< リーブビンの数です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    OffsetAllocator() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~OffsetAllocator();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      size            アロケーションサイズ.
    //! @param[in]      maxAllocCount   最大確保可能回数.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t size, uint32_t maxAllocCount = DEFAULT_MAX_COUNT);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      オフセットを割り当て処理を行います.
    //! 
    //! @param[in]      size        割り当てサイズ.
    //! @return     オフセットホルダーを返却します.
    //-------------------------------------------------------------------------
    OffsetHolder Alloc(uint32_t size);

    //-------------------------------------------------------------------------
    //! @brief      オフセットの割り当てを解除します.
    //! 
    //! @param[in]      holder      解放するオフセットホルダー.
    //-------------------------------------------------------------------------
    void Free(OffsetHolder& holder);

    //-------------------------------------------------------------------------
    //! @brief      未使用サイズを取得します.
    //! 
    //! @return     未使用サイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetFreeSize() const { return m_FreeSize; }

    //-------------------------------------------------------------------------
    //! @brief      使用サイズを取得します.
    //! 
    //! @return     使用サイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetUsedSize() const { return m_MaxSize - m_FreeSize; }

private:
    ///////////////////////////////////////////////////////////////////////////
    // Node structure
    ///////////////////////////////////////////////////////////////////////////
    struct Node
    {
        static constexpr uint32_t UNUSED = UINT32_MAX;

        uint32_t  DataOffset      = 0;          //!< データオフセット.
        uint32_t  DataSize        = 0;          //!< データサイズ.
        uint32_t  BinListPrev     = UNUSED;     //!< 前のビン.
        uint32_t  BinListNext     = UNUSED;     //!< 次のビン.
        uint32_t  NeighborPrev    = UNUSED;     //!< 前のノード.
        uint32_t  NeighborNext    = UNUSED;     //!< 次のノード.
        bool      Used            = false;      //!< 使用中なら true.

        Node() = default;
        Node(uint32_t offset, uint32_t size, uint32_t binListNext)
        : DataOffset    (offset)
        , DataSize      (size)
        , BinListPrev   (UNUSED)
        , BinListNext   (binListNext)
        , NeighborPrev  (UNUSED)
        , NeighborNext  (UNUSED)
        , Used          (false)
        { /* DO_NOTIHNG */ }
    };
    
    //=========================================================================
    // private variables.
    //=========================================================================
    uint32_t    m_MaxSize       = 0;            //!< 最大サイズ.
    uint32_t    m_MaxCount      = 0;            //!< 最大確保可能回数.
    uint32_t    m_FreeSize      = 0;            //!< 未使用サイズ.
    uint32_t    m_UsedBinsTop   = 0;            //!< 使用されているビンのとっぷ .
    uint32_t    m_FreeOffset    = 0;            //!< 未使用オフセット.
    Node*       m_Nodes         = nullptr;      //!< ノードの配列.
    uint32_t*   m_FreeNodes     = nullptr;      //!< 未使用ノード番号.
    bool        m_Init          = false;        //!< 初期化済みフラグ.

    uint8_t     m_UsedBins  [TOP_BINS_COUNT]  = {}; //!< 使用されているビン.
    uint32_t    m_BinIndices[LEAF_BINS_COUNT] = {}; //!< ビンの番号.

    //-------------------------------------------------------------------------
    //! @brief      ビンにノードを挿入します.
    //! 
    //! @param[in]      size        サイズ.
    //! @param[in]      offset      オフセット.
    //! @return     ノード番号を返却します.
    //-------------------------------------------------------------------------
    uint32_t InsertNode(uint32_t size, uint32_t offset);

    //-------------------------------------------------------------------------
    //! @brief      ビンからノードを削除します.
    //! 
    //! @param[in]      nodeId      削除するノード.
    //-------------------------------------------------------------------------
    void RemoveNode(uint32_t nodeId);
};

} // namespace asdx
