//-------------------------------------------------------------------------
// File : asdxHid.h
// Desc : Human Interface Device Module.
// Copyright(c) Project Asura. All right rerseved.
//-------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------
#include <cstdint>


#ifdef ASDX_AUTO_LINK
//-------------------------------------------------------------------------
// Linker
//-------------------------------------------------------------------------
#pragma comment(lib, "xinput.lib")
#pragma comment(lib, "GameInput.lib")
#endif//ASDX_AUTO_LINK

namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// PAD_BUTTON enum
///////////////////////////////////////////////////////////////////////////////
enum PAD_BUTTON
{
    PAD_UP          = 0x00001L,     //!< 方向パッド上
    PAD_DOWN        = 0x00002L,     //!< 方向パッド下
    PAD_LEFT        = 0x00004L,     //!< 方向パッド左
    PAD_RIGHT       = 0x00008L,     //!< 方向パッド右
    PAD_START       = 0x00010L,     //!< スタートボタン.
    PAD_BACK        = 0x00020L,     //!< バックボタン.
    PAD_THUMB_L     = 0x00040L,     //!< 左サムスティックボタン.
    PAD_THUMB_R     = 0x00080L,     //!< 右サムスティックボタン.
    PAD_SHOULDER_L  = 0x00100L,     //!< LBボタン.
    PAD_SHOULDER_R  = 0x00200L,     //!< RBボタン.
    PAD_A           = 0x01000L,     //!< Aボタン(Xbox)
    PAD_B           = 0x02000L,     //!< Bボタン(Xbox)
    PAD_X           = 0x04000L,     //!< Xボタン(Xbox)
    PAD_Y           = 0x08000L,     //!< Yボタン(Xbox)
    PAD_TRIGGER_L   = 0x10000L,     //!< 左トリガー.
    PAD_TRIGGER_R   = 0x20000L,     //!< 右トリガー.

    // 任意のボタン.
    PAD_ANY         = PAD_UP
                    | PAD_DOWN
                    | PAD_LEFT
                    | PAD_RIGHT
                    | PAD_START
                    | PAD_BACK
                    | PAD_THUMB_L
                    | PAD_THUMB_R
                    | PAD_SHOULDER_L
                    | PAD_SHOULDER_R
                    | PAD_A
                    | PAD_B
                    | PAD_X
                    | PAD_Y
                    | PAD_TRIGGER_L
                    | PAD_TRIGGER_R,
};


///////////////////////////////////////////////////////////////////////////////
// KEY_CODE enum
///////////////////////////////////////////////////////////////////////////////
enum KEY_CODE
{
    KEY_RETURN = 0x80,      //!< リターンキーです.
    KEY_TAB,                //!< Tabキーです.
    KEY_ESC,                //!< Escapeキーです.
    KEY_BACK,               //!< BackSpaceキーです.
    KEY_SHIFT,              //!< Shiftキーです.
    KEY_CONTROL,            //!< Controlキーです.
    KEY_ALT,                //!< Altキーです.
    KEY_F1,                 //!< F1キーです.
    KEY_F2,                 //!< F2キーです.
    KEY_F3,                 //!< F3キーです.
    KEY_F4,                 //!< F4キーです.
    KEY_F5,                 //!< F5キーです.
    KEY_F6,                 //!< F6キーです.
    KEY_F7,                 //!< F7キーです.
    KEY_F8,                 //!< F8キーです.
    KEY_F9,                 //!< F9キーです.
    KEY_F10,                //!< F10キーです.
    KEY_F11,                //!< F11キーです.
    KEY_F12,                //!< F12キーです.
    KEY_UP,                 //!< ↑キーです.
    KEY_DOWN,               //!< ↓キーです.
    KEY_LEFT,               //!< ←キーです.
    KEY_RIGHT,              //!< →キーです.
    KEY_NUM0,               //!< Num0キーです.
    KEY_NUM1,               //!< Num1キーです.
    KEY_NUM2,               //!< Num2キーです.
    KEY_NUM3,               //!< Num3キーです.
    KEY_NUM4,               //!< Num4キーです.
    KEY_NUM5,               //!< Num5キーです.
    KEY_NUM6,               //!< Num6キーです.
    KEY_NUM7,               //!< Num7キーです.
    KEY_NUM8,               //!< Num8キーです.
    KEY_NUM9,               //!< Num9キーです.
    KEY_INSERT,             //!< Insertキーです.
    KEY_DELETE,             //!< Deleteキーです.
    KEY_HOME,               //!< Homeキーです.
    KEY_END,                //!< Endキーです.
    KEY_PAGE_UP,            //!< PageUpキーです.
    KEY_PAGE_DOWN,          //!< PageDownキーです.
};


///////////////////////////////////////////////////////////////////////////////
// MOUSE_BUTTON enum
///////////////////////////////////////////////////////////////////////////////
enum MOUSE_BUTTON
{
    MOUSE_BUTTON_L = 0x0,       //!< 左ボタンです.
    MOUSE_BUTTON_R,             //!< 右ボタンです.
    MOUSE_BUTTON_M,             //!< 中ボタンです.
    MOUSE_BUTTON_X1,            //!< サイドボタン1です.
    MOUSE_BUTTON_X2,            //!< サイドボタン2です.
    MAX_MOUSE_BUTTON_COUNT,
};


///////////////////////////////////////////////////////////////////////////////
// IGamePad interface.
///////////////////////////////////////////////////////////////////////////////
struct IGamePad
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IGamePad() = default;

    //-------------------------------------------------------------------------
    //! @brief      プレイヤー番号を取得します.
    //! 
    //! @return     プレイヤー番号を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetPlayerIndex() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      コントローラーが接続されているかチェックします.
    //!
    //! @retval true    接続されています.
    //! @retval false   接続されていません.
    //-------------------------------------------------------------------------
    virtual bool IsConnected() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      モーターを振動させます.
    //!
    //! @param[in]      lhs     左のモーターの振動量(有効値:0.0 ～ 1.0).
    //! @param[in]      rhs     右のモーターの振動量(有効値:0.0 ～ 1.0).
    //-------------------------------------------------------------------------
    virtual void Vibrate(float lhs, float rhs) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボタンが押されたかチェックします.
    //!             フラグ切り替え向け用途として使用してください.
    //!
    //! @param[in]      buttonMask        チェックするボタン.
    //! @retval true    ボタンが押されました.
    //! @retval false   ボタンは押されません.
    //-------------------------------------------------------------------------
    virtual bool IsDown(uint32_t buttonMask) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボタンが押されっぱなしかどうかチェックします.
    //!
    //! @param[in]      buttonMask        チェックするボタン.
    //! @return     ボタンが押されっぱなしの状態のときはtrueを返却.
    //-------------------------------------------------------------------------
    virtual bool IsHold(uint32_t buttonMask) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      正規化された左サムスティックのX成分を取得します.
    //!
    //! @return     正規化された左サムスティックのX成分を返却します.
    //-------------------------------------------------------------------------
    virtual float GetThumbLX() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      正規化された左サムスティックのY成分を取得します.
    //!
    //! @return     正規化された左サムスティックのY成分を返却します.
    //-------------------------------------------------------------------------
    virtual float GetThumbLY() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      正規化された右サムスティックのX成分を取得します.
    //!
    //! @return     正規化された右サムスティックのX成分を返却します.
    //-------------------------------------------------------------------------
    virtual float GetThumbRX() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      正規化された右サムスティックのY成分を取得します.
    //!
    //! @return     正規化された右サムスティックのy成分を返却します.
    //-------------------------------------------------------------------------
    virtual float GetThumbRY() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      左トリガーの値を取得します.
    //! 
    //! @return     左トリガーの値を返却します.
    //-------------------------------------------------------------------------
    virtual float GetTriggerL() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      右トリガーの値を取得します.
    //! 
    //! @return     右トリガーの値を返却します.
    //-------------------------------------------------------------------------
    virtual float GetTriggerR() const = 0;
};


///////////////////////////////////////////////////////////////////////////////
// IKeyboard interface
///////////////////////////////////////////////////////////////////////////////
struct IKeyboard
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IKeyboard() = default;

    //-------------------------------------------------------------------------
    //! @brief      キーが押されっぱなしかどうかチェックします.
    //!
    //! @param[in]      keyCode     チェックするキーコード.
    //! @return     キーが押された場合はtrueを返します.
    //! @memo       現在のフレームでキーが押されている場合にtrueを返します.
    //-------------------------------------------------------------------------
    virtual bool IsHold(uint32_t key) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      キーが押されたかどうかチェックします.
    //!
    //! @param[in]      keyCode     チェックするキーコード.
    //! @return     キーが押されている場合はtrueを返します.
    //! @memo       前のフレームのキー状態と現在のフレームのキー状態が異なる場合にtrueを返します.
    //!             フラグの切り替え用途などに使用します.
    //-------------------------------------------------------------------------
    virtual bool IsDown(uint32_t key) const = 0;
};


///////////////////////////////////////////////////////////////////////////////
// IMouse interface
///////////////////////////////////////////////////////////////////////////////
struct IMouse
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IMouse() = default;

    //-------------------------------------------------------------------------
    //! @brief      カーソルのX座標を取得します.
    //!
    //! @return     カーソルのX座標を返却します.
    //-------------------------------------------------------------------------
    virtual int GetCursorX() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      カーソルのY座標を取得します.
    //!
    //! @return     カーソルのY座標を返却します.
    //-------------------------------------------------------------------------
    virtual int GetCursorY() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      前のカーソルのX座標を取得します.
    //!
    //! @return     前のカーソルのX座標を返却します.
    //-------------------------------------------------------------------------
    virtual int GetPrevCursorX() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      前のカーソルのY座標を取得します.
    //!
    //! @return     前のカーソルのY座標を返却します.
    //-------------------------------------------------------------------------
    virtual int GetPrevCursorY() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      現在のカーソルと前のカーソルのX座標の差分を取得します.
    //!
    //! @return     現在のカーソルと前のカーソルのX座標の差分を返却します.
    //-------------------------------------------------------------------------
    virtual int GetCursorDiffX() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      現在のカーソルと前のカーソルのY座標の差分を取得します.
    //!
    //! @return     現在のカーソルと前のカーソルのY座標の差分を返却します.
    //-------------------------------------------------------------------------
    virtual int GetCursorDiffY() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボタンが押されっぱなしかどうかチェックします.
    //!
    //! @param[in]      button      ボタン.
    //! @return     ボタンが押された場合はtrueを返します.そうでない場合はfalseを返却します.
    //! @memo       現在のフレームでボタンが押されている場合にtrueを返します.
    //-------------------------------------------------------------------------
    virtual bool IsHold(uint32_t button) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボタンが押されたかどうかチェックします.
    //!
    //! @param[in]      button      ボタン.
    //! @return     ボタンが押されている場合はtrueを返します.
    //! @memo       前のフレームのボタン状態と現在のフレームのボタン状態が異なる場合にtrueを返します.
    //!             フラグの切り替え用途などに使用します.
    //-------------------------------------------------------------------------
    virtual bool IsDown(uint32_t button) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ドラッグされているかどうかチェックします.
    //!
    //! @param[in]      button      ボタン.
    //! @return     ドラッグ中の場合はtrueを返します.
    //-------------------------------------------------------------------------
    virtual bool IsDrag(uint32_t button) const = 0;
};

//-----------------------------------------------------------------------------
//! @brief      HIDの初期化処理を行います.
//-----------------------------------------------------------------------------
void InitHid();

//-----------------------------------------------------------------------------
//! @brief      HIDの終了処理を行います.
//-----------------------------------------------------------------------------
void TermHid();

//-----------------------------------------------------------------------------
//! @brief      HIDの更新処理を行います.
//! 
//! @param[in]      hWnd        ウィンドウハンドル.
//-----------------------------------------------------------------------------
void UpdateHid(void* hWnd);

//-----------------------------------------------------------------------------
//! @brief      HID処理をロックします.
//-----------------------------------------------------------------------------
void LockHid();

//-----------------------------------------------------------------------------
//! @brief      HID処理のロック解除を行います.
//-----------------------------------------------------------------------------
void UnlockHid();

//-----------------------------------------------------------------------------
//! @brief      HID処理がロックされているかチェックします.
//! 
//! @retval true    ロック中です.
//! @retval false   非ロックです.
//-----------------------------------------------------------------------------
bool IsLockHid();

//-----------------------------------------------------------------------------
//! @brief      ゲームパッドを取得します.
//! 
//! @param[in]      index       パッド番号を指定します(0, 1, 2, 3が有効値).
//! @return     ゲームパッドを返却します. 
//! @note       未初期化の場合は nullptr が返却されます.
//-----------------------------------------------------------------------------
IGamePad* GetPad(uint32_t index);

//-----------------------------------------------------------------------------
//! @brief      キーボードを取得します.
//! 
//! @return     キーボードを返却します.
//! @note       未初期化の場合は nullptr が返却されます.
//-----------------------------------------------------------------------------
IKeyboard* GetKeyboard();

//-----------------------------------------------------------------------------
//! @brief      マウスを取得します.
//! 
//! @return     マウスを返却します.
//! @note       未初期化の場合は nullptr が返却されます.
//-----------------------------------------------------------------------------
IMouse* GetMouse();

} // namespace asdx
