//-----------------------------------------------------------------------------
// File : asdxBlob.h
// Desc : Binary Large Object.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxRef.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// IBlob structure
///////////////////////////////////////////////////////////////////////////////
struct IBlob : public IReference
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IBlob()
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      バッファサイズを取得します.
    //!
    //! @return     バッファサイズを返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetBufferSize() = 0;

    //-------------------------------------------------------------------------
    //! @brief      バッファデータを取得します.
    //!
    //! @return     バッファデータを返却します.
    //-------------------------------------------------------------------------
    virtual void* GetBuffer() = 0;
};

//-----------------------------------------------------------------------------
//! @brief      バイナリラージオブジェクトを生成します.
//!
//! @param[in]      size        生成サイズ.
//! @param[out]     ppResult    格納先.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateBlob(size_t size, IBlob** ppResult);

//-----------------------------------------------------------------------------
//! @brief      ファイル内容をバイナリラージオブジェクトに読み込みます.
//!
//! @param[in]      filename    ファイル名です.
//! @param[out]     ppResult    格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-----------------------------------------------------------------------------
bool ReadFileToBlobA(const char* filename, IBlob** ppResult);

//-----------------------------------------------------------------------------
//! @brief      ファイル内容をバイナリラージオブジェクトに読み込みます.
//!
//! @param[in]      filename    ファイル名です.
//! @param[out]     ppResult    格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-----------------------------------------------------------------------------
bool ReadFileToBlobW(const wchar_t* filename, IBlob** ppResult);

//-----------------------------------------------------------------------------
//! @brief      バイナリラージオブジェクトの内容をファイルに書き出します.
//!
//! @param[in]      pBlob       バイナリラージオブジェクト.
//! @param[in]      filename    出力ファイル名.
//! @retval true    書き出しに成功.
//! @retval false   書き出しに失敗.
//-----------------------------------------------------------------------------
bool WriteBlobToFileA(IBlob* pBlob, const char* filename);

//-----------------------------------------------------------------------------
//! @brief      バイナリラージオブジェクトの内容をファイルに書き出します.
//!
//! @param[in]      pBlob       バイナリラージオブジェクト.
//! @param[in]      filename    出力ファイル名.
//! @retval true    書き出しに成功.
//! @retval false   書き出しに失敗.
//-----------------------------------------------------------------------------
bool WriteBlobToFileW(IBlob* pBlob, const wchar_t* filename);

} // namespace asdx
