//-----------------------------------------------------------------------------
// File : asdxBitFlags.
// Desc : Bit Flags.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cassert>
#include <cstdint>


namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      左端から連続した0となるビットの数を数えます.
//! 
//! @param[in]      value       数える数値.
//! @return     左端から連続した0となるビットの数を返却します.
//! @note       左端が0でない場合は常にゼロとなります.
//-----------------------------------------------------------------------------
int CountZeroL(uint8_t  value);
int CountZeroL(uint16_t value);
int CountZeroL(uint32_t value);
int CountZeroL(uint64_t value);

//-----------------------------------------------------------------------------
//! @brief      右端から連続した0となるビットの数を数えます.
//! 
//! @param[in]      value       数える数値.
//! @return     右端から連続した0となるビットの数を返却します.
//! @note       右端が0でない場合は常にゼロとなります.
//-----------------------------------------------------------------------------
int CountZeroR(uint8_t  value);
int CountZeroR(uint16_t value);
int CountZeroR(uint32_t value);
int CountZeroR(uint64_t value);

//-----------------------------------------------------------------------------
//! @brief      左端から連続した1となるビットの数を数えます.
//! 
//! @param[in]      value       数える数値.
//! @return     左端から連続した1となるビットの数を返却します.
//! @note       左端が1でない場合は常にゼロとなります.
//-----------------------------------------------------------------------------
inline int CountOneL(uint8_t  value) { return CountZeroL(uint8_t(~value)); }
inline int CountOneL(uint16_t value) { return CountZeroL(uint16_t(~value)); }
inline int CountOneL(uint32_t value) { return CountZeroL(uint32_t(~value)); }
inline int CountOneL(uint64_t value) { return CountZeroL(uint64_t(~value)); }

//-----------------------------------------------------------------------------
//! @brief      右端から連続した1となるビットの数を数えます.
//! 
//! @param[in]      value       数える数値.
//! @return     右端から連続した1となるビットの数を返却します.
//! @note       右端が1でない場合は常にゼロとなります.
//-----------------------------------------------------------------------------
inline int CountOneR(uint8_t  value) { return CountZeroR(uint8_t(~value)); }
inline int CountOneR(uint16_t value) { return CountZeroR(uint16_t(~value)); }
inline int CountOneR(uint32_t value) { return CountZeroR(uint32_t(~value)); }
inline int CountOneR(uint64_t value) { return CountZeroR(uint64_t(~value)); }

//-----------------------------------------------------------------------------
//! @brief      左から探索し，最初に0となるビットの番号を求めます.
//! 
//! @param[in]      value       数える数値.
//! @return     左から探索し，最初に0となるビットの番号を返却します.
//-----------------------------------------------------------------------------
inline int FindZeroL(uint8_t  value) { return value == uint8_t (~0) ? 0 :  8 - CountOneL(value); }
inline int FindZeroL(uint16_t value) { return value == uint16_t(~0) ? 0 : 16 - CountOneL(value); }
inline int FindZeroL(uint32_t value) { return value == uint32_t(~0) ? 0 : 32 - CountOneL(value); }
inline int FindZeroL(uint64_t value) { return value == uint64_t(~0) ? 0 : 64 - CountOneL(value); }

//-----------------------------------------------------------------------------
//! @brief      右から探索し，最初に0となるビットの番号を求めます.
//! 
//! @param[in]      value       数える数値.
//! @return     右から探索し，最初に0となるビットの番号を返却します.
//-----------------------------------------------------------------------------
inline int FindZeroR(uint8_t  value) { return value == uint8_t (~0) ? 0 : CountOneR(value) + 1; }
inline int FindZeroR(uint16_t value) { return value == uint16_t(~0) ? 0 : CountOneR(value) + 1; }
inline int FindZeroR(uint32_t value) { return value == uint32_t(~0) ? 0 : CountOneR(value) + 1; }
inline int FindZeroR(uint64_t value) { return value == uint64_t(~0) ? 0 : CountOneR(value) + 1; }

//-----------------------------------------------------------------------------
//! @brief      左から探索し，最初に1となるビットの番号を求めます.
//! 
//! @param[in]      value       数える数値.
//! @return     左から探索し，最初に1となるビットの番号を返却します.
//-----------------------------------------------------------------------------
inline int FindOneL(uint8_t  value) { return value == 0 ? 0 :  8 - CountZeroL(value); }
inline int FindOneL(uint16_t value) { return value == 0 ? 0 : 16 - CountZeroL(value); }
inline int FindOneL(uint32_t value) { return value == 0 ? 0 : 32 - CountZeroL(value); }
inline int FindOneL(uint64_t value) { return value == 0 ? 0 : 64 - CountZeroL(value); }

//-----------------------------------------------------------------------------
//! @brief      右から探索し，最初に1となるビットの番号を求めます.
//! 
//! @param[in]      value       数える数値.
//! @return     右から探索し，最初に1となるビットの番号を返却します.
//-----------------------------------------------------------------------------
inline int FindOneR(uint8_t  value) { return value == 0 ? 0 : CountZeroR(value) + 1; }
inline int FindOneR(uint16_t value) { return value == 0 ? 0 : CountZeroR(value) + 1; }
inline int FindOneR(uint32_t value) { return value == 0 ? 0 : CountZeroR(value) + 1; }
inline int FindOneR(uint64_t value) { return value == 0 ? 0 : CountZeroR(value) + 1; }


///////////////////////////////////////////////////////////////////////////////
// BitFlags8 class.
///////////////////////////////////////////////////////////////////////////////
class BitFlags8
{
    //=========================================================================
    // list of friend classes.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BitFlags8() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      value       初期値.
    //-------------------------------------------------------------------------
    BitFlags8(uint8_t value)
    : m_Flags(value)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BitFlags8() = default;

    //-------------------------------------------------------------------------
    //! @brief      フラグを設定します.
    //! 
    //! @param[in]      index       インデックス.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void Set(size_t index, bool value)
    {
        assert(index < 8);
        uint8_t bit = (0x1 << index);
        if (value)
        { m_Flags |= bit; }
        else
        { m_Flags &= ~bit; }
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグを取得します.
    //! 
    //! @param[in]      index       インデックス.
    //! @return     フラグを返却します.
    //-------------------------------------------------------------------------
    bool Get(size_t index) const
    {
        assert(index < 8);
        uint8_t bit = (0x1 << index);
        return !!(m_Flags & bit);
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグをリセットします.
    //-------------------------------------------------------------------------
    void Reset()
    { m_Flags = 0; }

    //-------------------------------------------------------------------------
    //! @brief      マスク結果を取得します.
    //! 
    //! @param[in]      mask        マスクビット.
    //! @return     マスク結果を返却します.
    //-------------------------------------------------------------------------
    uint8_t Mask(uint8_t mask) const
    { return m_Flags & mask; }

    //-------------------------------------------------------------------------
    //! @brief      任意のフラグが立っているかどうかチェックします.
    //! 
    //! @return     いずれかのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool Any() const
    { return m_Flags != 0; }

    //-------------------------------------------------------------------------
    //! @brief      全てのフラグが立っているかどうかチェックします.
    //! 
    //! @return     全てのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool All() const
    { return m_Flags == 0xFF; }

    //-------------------------------------------------------------------------
    //! @brief      全てのビットが0になっているか判定します.
    //! 
    //! @return     全てのビットが0であれば true を返却します.
    //-------------------------------------------------------------------------
    bool None() const
    { return m_Flags == 0; }

    //-------------------------------------------------------------------------
    //! @brief      キャスト演算子です.
    //-------------------------------------------------------------------------
    operator uint8_t () const
    { return m_Flags; }

    //-------------------------------------------------------------------------
    //! @brief      使用していないインデックスを取得します.
    //! 
    //! @return     使用していないインデックスを返却します.
    //-------------------------------------------------------------------------
    int FindUnused() const 
    { return FindZeroL(m_Flags); }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint8_t m_Flags = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// BitFlags16 class.
///////////////////////////////////////////////////////////////////////////////
class BitFlags16
{
    //=========================================================================
    // list of friend classes.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BitFlags16 () = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      value       初期値.
    //-------------------------------------------------------------------------
    BitFlags16(uint16_t value)
    : m_Flags(value)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BitFlags16() = default;

    //-------------------------------------------------------------------------
    //! @brief      フラグを設定します.
    //! 
    //! @param[in]      index       インデックス.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void Set(size_t index, bool value)
    {
        assert(index < 16);
        uint16_t bits = (0x1 << index);
        if (value)
        { m_Flags |= bits; }
        else
        { m_Flags &= ~bits; }
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグを取得します.
    //! 
    //! @param[in]      index       インデックス.
    //! @return     フラグを返却します.
    //-------------------------------------------------------------------------
    bool Get(size_t index) const
    {
        assert(index < 16);
        uint16_t bits = (0x1 << index);
        return !!(m_Flags & bits);
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグをリセットします.
    //-------------------------------------------------------------------------
    void Reset()
    { m_Flags = 0; }

    //-------------------------------------------------------------------------
    //! @brief      マスク結果を取得します.
    //! 
    //! @param[in]      mask        マスクビット.
    //! @return     マスク結果を返却します.
    //-------------------------------------------------------------------------
    uint16_t Mask(uint16_t mask) const
    { return m_Flags & mask; }

    //-------------------------------------------------------------------------
    //! @brief      任意のフラグが立っているかどうかチェックします.
    //! 
    //! @return     いずれかのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool Any() const
    { return m_Flags != 0; }

    //-------------------------------------------------------------------------
    //! @brief      全てのフラグが立っているかどうかチェックします.
    //! 
    //! @return     全てのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool All() const
    { return m_Flags == 0xFFFF; }

    //-------------------------------------------------------------------------
    //! @brief      全てのビットが0になっているか判定します.
    //! 
    //! @return     全てのビットが0であれば true を返却します.
    //-------------------------------------------------------------------------
    bool None() const
    { return m_Flags == 0; }

    //-------------------------------------------------------------------------
    //! @brief      キャスト演算子です.
    //-------------------------------------------------------------------------
    operator uint16_t () const
    { return m_Flags; }

    //-------------------------------------------------------------------------
    //! @brief      使用していないインデックスを取得します.
    //! 
    //! @return     使用していないインデックスを返却します.
    //-------------------------------------------------------------------------
    int FindUnused() const 
    { return FindZeroL(m_Flags); }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint16_t m_Flags = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// BitFlags32 class.
///////////////////////////////////////////////////////////////////////////////
class BitFlags32
{
    //=========================================================================
    // list of friend classes.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BitFlags32 () = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      value       初期値.
    //-------------------------------------------------------------------------
    BitFlags32(uint32_t value)
    : m_Flags(value)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BitFlags32() = default;

    //-------------------------------------------------------------------------
    //! @brief      フラグを設定します.
    //! 
    //! @param[in]      index       インデックス.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void Set(size_t index, bool value)
    {
        assert(index < 32);
        uint32_t bits = (0x1u << index);
        if (value)
        { m_Flags |= bits; }
        else
        { m_Flags &= ~bits; }
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグを取得します.
    //! 
    //! @param[in]      index       インデックス.
    //! @return     フラグを返却します.
    //-------------------------------------------------------------------------
    bool Get(size_t index) const
    {
        assert(index < 32);
        uint32_t bits = (0x1u << index);
        return !!(m_Flags & bits);
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグをリセットします.
    //-------------------------------------------------------------------------
    void Reset()
    { m_Flags = 0; }

    //-------------------------------------------------------------------------
    //! @brief      マスク結果を取得します.
    //! 
    //! @param[in]      mask        マスクビット.
    //! @return     マスク結果を返却します.
    //-------------------------------------------------------------------------
    uint32_t Mask(uint32_t mask) const
    { return m_Flags & mask; }

    //-------------------------------------------------------------------------
    //! @brief      任意のフラグが立っているかどうかチェックします.
    //! 
    //! @return     いずれかのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool Any() const
    { return m_Flags != 0; }

    //-------------------------------------------------------------------------
    //! @brief      全てのフラグが立っているかどうかチェックします.
    //! 
    //! @return     全てのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool All() const
    { return m_Flags == 0xFFFFFFFF; }

    //-------------------------------------------------------------------------
    //! @brief      全てのビットが0になっているか判定します.
    //! 
    //! @return     全てのビットが0であれば true を返却します.
    //-------------------------------------------------------------------------
    bool None() const
    { return m_Flags == 0; }

    //-------------------------------------------------------------------------
    //! @brief      キャスト演算子です.
    //-------------------------------------------------------------------------
    operator uint32_t () const
    { return m_Flags; }

    //-------------------------------------------------------------------------
    //! @brief      使用していないインデックスを取得します.
    //! 
    //! @return     使用していないインデックスを返却します.
    //-------------------------------------------------------------------------
    int FindUnused() const 
    { return FindZeroL(m_Flags); }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint32_t m_Flags = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// BitFlags64 class.
///////////////////////////////////////////////////////////////////////////////
class BitFlags64
{
    //=========================================================================
    // list of friend classes.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BitFlags64 () = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      value       初期値.
    //-------------------------------------------------------------------------
    BitFlags64(uint64_t value)
    : m_Flags(value)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BitFlags64() = default;

    //-------------------------------------------------------------------------
    //! @brief      フラグを設定します.
    //! 
    //! @param[in]      index       インデックス.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void Set(size_t index, bool value)
    {
        assert(index < 64);
        uint64_t bits = (0x1llu << index);
        if (value)
        { m_Flags |= bits; }
        else
        { m_Flags &= ~bits; }
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグを取得します.
    //! 
    //! @param[in]      index       インデックス.
    //! @return     フラグを返却します.
    //-------------------------------------------------------------------------
    bool Get(size_t index) const
    {
        assert(index < 64);
        uint64_t bits = (0x1llu << index);
        return !!(m_Flags & bits);
    }

    //-------------------------------------------------------------------------
    //! @brief      フラグをリセットします.
    //-------------------------------------------------------------------------
    void Reset()
    { m_Flags = 0; }

    //-------------------------------------------------------------------------
    //! @brief      マスク結果を取得します.
    //! 
    //! @param[in]      mask        マスクビット.
    //! @return     マスク結果を返却します.
    //-------------------------------------------------------------------------
    uint64_t Mask(uint64_t mask) const
    { return m_Flags & mask; }

    //-------------------------------------------------------------------------
    //! @brief      任意のフラグが立っているかどうかチェックします.
    //! 
    //! @return     いずれかのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool Any() const
    { return m_Flags != 0; }

    //-------------------------------------------------------------------------
    //! @brief      全てのフラグが立っているかどうかチェックします.
    //! 
    //! @return     全てのフラグが立っていれば true を返却します.
    //-------------------------------------------------------------------------
    bool All() const
    { return m_Flags == 0xFFFFFFFFFFFFFFFF; }

    //-------------------------------------------------------------------------
    //! @brief      全てのビットが0になっているか判定します.
    //! 
    //! @return     全てのビットが0であれば true を返却します.
    //-------------------------------------------------------------------------
    bool None() const
    { return m_Flags == 0; }

    //-------------------------------------------------------------------------
    //! @brief      キャスト演算子です.
    //-------------------------------------------------------------------------
    operator uint64_t () const
    { return m_Flags; }

    //-------------------------------------------------------------------------
    //! @brief      使用していないインデックスを取得します.
    //! 
    //! @return     使用していないインデックスを返却します.
    //-------------------------------------------------------------------------
    int FindUnused() const 
    { return FindZeroL(m_Flags); }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint64_t m_Flags = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

static_assert(sizeof(BitFlags8)  == sizeof(uint8_t) , "Size Not Match");
static_assert(sizeof(BitFlags16) == sizeof(uint16_t), "Size Not Match");
static_assert(sizeof(BitFlags32) == sizeof(uint32_t), "Size Not Match");
static_assert(sizeof(BitFlags64) == sizeof(uint64_t), "Size Not Match");

} // namespace asdx
