//-------------------------------------------------------------------------------------------------
// File : asdxStepTimer.h
// Desc : StepTimer Module.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <chrono>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////////////////////////
// StepTimer class
///////////////////////////////////////////////////////////////////////////////////////////////////
class StepTimer
{
    //=============================================================================================
    // list of friend classes and methods.
    //=============================================================================================
    /* NOTHING */

public:
    using Clock     = std::chrono::steady_clock;
    using TimePoint = Clock::time_point;

    //=============================================================================================
    // private variables
    //=============================================================================================
    /* NOTHING */

    //=============================================================================================
    // private methods
    //=============================================================================================

    //---------------------------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //---------------------------------------------------------------------------------------------
    StepTimer()
    : m_IsStop     (true)
    , m_StopTime   ()
    , m_ElapsedTime()
    , m_BaseTime   ()
    { /* DO_NOTHING */ }

    //---------------------------------------------------------------------------------------------
    //! @brief      タイマーをリセットします.
    //---------------------------------------------------------------------------------------------
    void Reset()
    {
        // 調整された現在時間を取得
        auto now = GetAdjustedCurrentTime();

        m_BaseTime    = now;
        m_ElapsedTime = now;
        m_StopTime    = {};
        m_IsStop      = false;
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      タイマーを開始します.
    //---------------------------------------------------------------------------------------------
    void Start()
    {
        const auto now = std::chrono::steady_clock::now();

        // 停止中ならベース時間を加算.
        if ( m_IsStop )
        { m_BaseTime += now - m_StopTime; }

        m_StopTime    = {};
        m_ElapsedTime = now;
        m_IsStop      = false;
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      タイマーを停止します.
    //---------------------------------------------------------------------------------------------
    void Stop()
    {
        if ( m_IsStop )
        { return; }

        const auto now = std::chrono::steady_clock::now();

        m_StopTime    = now;
        m_ElapsedTime = now;
        m_IsStop      = true;
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      0.1秒タイマーを進めます.
    //---------------------------------------------------------------------------------------------
    void Advance()
    { m_StopTime += std::chrono::milliseconds(100); }

    //---------------------------------------------------------------------------------------------
    //! @brief      停止状態かどうか判定します.
    //!
    //! @retval true    停止状態.
    //! @retval false   非停止状態.
    //---------------------------------------------------------------------------------------------
    bool IsStop() const
    { return m_IsStop; }

    //---------------------------------------------------------------------------------------------
    //! @brief      システム時間を取得します.
    //!
    //! @return     システム時間を返却します.
    //---------------------------------------------------------------------------------------------
    double GetAbsoluteSec() const
    {
        // システム時間を算出して，返却する.
        return std::chrono::duration<double>(std::chrono::steady_clock::now().time_since_epoch()).count();
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      相対時間を取得します.
    //!
    //! @return     相対時間を返却します.
    //---------------------------------------------------------------------------------------------
    double GetRelativeSec()
    {
        // 調整された現在時間を取得.
        auto now = GetAdjustedCurrentTime();

        // 時間を算出.
        return std::chrono::duration<double>(now - m_BaseTime).count();
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      経過時間を取得します.
    //!
    //! @return     経過時間を返却します.
    //---------------------------------------------------------------------------------------------
    double GetElapsedSec()
    {
        // 調整された現在時間を取得.
        auto now = GetAdjustedCurrentTime();

        // 経過時間を算出.
        auto elapsedTime = std::chrono::duration<double>(now - m_ElapsedTime).count();

        // 経過時間を更新.
        m_ElapsedTime = now;

        // 0以下であればランプ.
        if ( elapsedTime < 0 )
        { elapsedTime = 0.0; }

        return elapsedTime;
    }

    //---------------------------------------------------------------------------------------------
    //! @brief      時間の値を取得します.
    //!
    //! @param [out]    time           相対時間を格納する変数.
    //! @param [out]    absoluteTime   システム時間を格納する変数.
    //! @param [out]    elapsedTime    経過時間を格納する変数.
    //---------------------------------------------------------------------------------------------
    void GetValues(double& time, double& absoluteTime, double& elapsedTime)
    {
        // 調整された現在時間を取得.
        auto now = GetAdjustedCurrentTime();

        // 経過時間を取得.
        auto diffTime = std::chrono::duration<double>(now - m_ElapsedTime).count();

        // 経過時間を更新.
        m_ElapsedTime = now;

        // 0以下であればクランプ.
        if ( diffTime < 0 )
        { diffTime = 0.0; }

        // システム時間.
        absoluteTime = std::chrono::duration<double>(now.time_since_epoch()).count();

        // 相対時間.
        time = std::chrono::duration<double>(now - m_BaseTime).count();

        // 経過時間.
        elapsedTime = diffTime;
    }

private:
    //=============================================================================================
    // private variables
    //=============================================================================================
    bool        m_IsStop;               //!< 停止状態かどうか.
    TimePoint   m_StopTime;             //!< 停止時間.
    TimePoint   m_ElapsedTime;          //!< 最後の処理から経過時間です.
    TimePoint   m_BaseTime;             //!< タイマーの開始時間です.

    //=============================================================================================
    // private methods
    //=============================================================================================

    //---------------------------------------------------------------------------------------------
    //! @brief      調整された現在時間を取得します.
    //---------------------------------------------------------------------------------------------
    TimePoint GetAdjustedCurrentTime()
    {
        // 停止状態であれば，停止時間を返却.
        if ( m_StopTime != TimePoint{} )
        { return m_StopTime; }
        // 非停止状態ならば，現在のカウンタを取得.
        else
        { return Clock::now(); }
    }
};

} // namespace asdx
