//-----------------------------------------------------------------------------
// File : asdxFileIO.h
// Desc : File I/O.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Include
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>


namespace asdx {

//-----------------------------------------------------------------------------
// Using Statements
//-----------------------------------------------------------------------------
using RequestId = uint32_t;     //!< リクエストID. 

//-----------------------------------------------------------------------------
// Constant Values.
//-----------------------------------------------------------------------------
static constexpr RequestId kInvalidRequestId = UINT32_MAX;


//-----------------------------------------------------------------------------
//! @brief      非同期ファイルIOを初期化します.
//! 
//! @retval true    初期化に成功.
//! @retval false   初期化に失敗.
//-----------------------------------------------------------------------------
bool InitAsyncFileIO();

//-----------------------------------------------------------------------------
//! @brief      非同期ファイルIOの終了処理を行います.
//-----------------------------------------------------------------------------
void TermAsyncFileIO();

//-----------------------------------------------------------------------------
//! @brief      非同期ファイルIOが初期化済みかどうかチェックします.
//! 
//! @retval true    初期化済み.
//! @retval false   未初期化.
//-----------------------------------------------------------------------------
bool IsInitAsyncFileIO();

//-----------------------------------------------------------------------------
//! @brief      非同期読み込みをリクエストします.
//! 
//! @param[in]      path        ファイルパス.
//! @return     リクエストIDを返却します.
//-----------------------------------------------------------------------------
RequestId RequestLoad(const char* path);

//-----------------------------------------------------------------------------
//! @brief      非同期書き込みをリクエストします.
//! 
//! @param[in]      path        ファイルパス.
//! @param[in]      blob        バイナリラージオブジェクト.
//! @return     リクエストIDを返却します.
//-----------------------------------------------------------------------------
RequestId RequestSave(const char* path, const std::vector<uint8_t>& blob);

//-----------------------------------------------------------------------------
//! @brief      リクエストが完了したかどうか確認します.
//! 
//! @param[in]      requestId       リクエストID.
//! @retval true    完了済みです.
//! @retval false   未完了です.
//-----------------------------------------------------------------------------
bool IsFinished(RequestId requestId);

//-----------------------------------------------------------------------------
//! @brief      非同期読み込み結果を取得します
//! 
//! @param[in]      requestId       リクエストID.
//! @return     読み込み結果を返却します
//! @note       リクエストが完了したら必ず呼び出してください.
//!             内部でメモリ解放を行うため，呼び出しされないとメモリリークが発生します.
//-----------------------------------------------------------------------------
std::vector<uint8_t> GetLoadResult(RequestId requestId);

//-----------------------------------------------------------------------------
//! @brief      非同期書き込み結果を取得します
//! 
//! @param[in]      requestId       リクエストID.
//! @return     書き込み結果を返却します
//! @note       リクエストが完了したら必ず呼び出してください.
//!             内部でメモリ解放を行うため，呼び出しされないとメモリリークが発生します.
//-----------------------------------------------------------------------------
bool GetSaveResult(RequestId requestId);

//-----------------------------------------------------------------------------
//! @brief      同期読み込みを行います.
//! 
//! @param[in]      path        ファイルパス.
//! @param[in]      blob        バイナリラージオブジェクトの格納先.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-----------------------------------------------------------------------------
bool LoadA(const char* path, std::vector<uint8_t>& blob);

//-----------------------------------------------------------------------------
//! @brief      同期読み込みを行います.
//! 
//! @param[in]      path        ファイルパス.
//! @param[in]      blob        バイナリラージオブジェクトの格納先.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-----------------------------------------------------------------------------
bool LoadW(const wchar_t* path, std::vector<uint8_t>& blob);

//-----------------------------------------------------------------------------
//! @brief      同期書き込みを行います.
//! 
//! @param[in]      path        ファイルパス.
//! @param[in]      blob        バイナリラージオブジェクト.
//! @retval true    書き込みに成功.
//! @retval false   書き込みに失敗.
//-----------------------------------------------------------------------------
bool SaveA(const char* path, const std::vector<uint8_t>& blob);

//-----------------------------------------------------------------------------
//! @brief      同期書き込みを行います.
//! 
//! @param[in]      path        ファイルパス.
//! @param[in]      blob        バイナリラージオブジェクト.
//! @retval true    書き込みに成功.
//! @retval false   書き込みに失敗.
//-----------------------------------------------------------------------------
bool SaveW(const wchar_t* path, const std::vector<uint8_t>& blob);


} // namespace asdx
