//-----------------------------------------------------------------------------
// File : asdxHash.h
// Desc : Hash Key Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>


namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      バッファからハッシュキーを計算します.
//! 
//! @param[in]      pBuffer     バッファ.
//! @param[in]      size        バッファサイズ.
//! @return     ハッシュキーを返却します.
//-----------------------------------------------------------------------------
uint64_t CalcHash(const void* pBuffer, size_t size);

//-----------------------------------------------------------------------------
//! @brief      文字列からハッシュキーを計算します.
//! 
//! @param[in]      strings     NULL終端文字列.
//! @return     ハッシュキーを返却します.
//-----------------------------------------------------------------------------
uint64_t CalcHash(const char* strings);

//-----------------------------------------------------------------------------
//! @brief      シード値を用いてハッシュキーを計算します.
//!
//! @param[in]      pBuffer     バッファ.
//! @param[in]      size        バッファサイズ.
//! @param[in]      prevHash    シード値.
//! @return     ハッシュキーを返却します.
//-----------------------------------------------------------------------------
uint64_t CalcHashWithSeed(const void* pBuffer, size_t size, uint64_t prevHash);

} // namespace asdx
