//-----------------------------------------------------------------------------
// File : asdxAsyncFileLoader.h
// Desc : Async File Loader.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Include
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// IAsyncFileLoader interface
///////////////////////////////////////////////////////////////////////////////
struct IAsyncFileLoader
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IAsyncFileLoader() {}

    //-------------------------------------------------------------------------
    //! @brief      ロードリクエストを行います.
    //! 
    //! @param[in]      path        ファイルパスです.
    //! @return     ロードハンドルを返却します.
    //-------------------------------------------------------------------------
    virtual uint64_t RequestLoad(const char* path) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ロードが完了したかどうかチェックします.
    //! 
    //! @param[in]      handle      ロードハンドル.
    //! @retval true    ロード終了し，使用可能状態です.
    //! @retval false   ロード未完了です.
    //-------------------------------------------------------------------------
    virtual bool IsFinished(uint64_t handle) = 0;

    //-------------------------------------------------------------------------
    //! @brief      すべてのロードが完了したかどうかチェックします.
    //! 
    //! @retval true    ロード完了.
    //! @retval false   ロード未完了.
    //-------------------------------------------------------------------------
    virtual bool IsAllFinished() = 0;

    //-------------------------------------------------------------------------
    //! @brief      ロード結果を取得します.
    //! 
    //! @param[in]      handle      ロードハンドル.
    //! @return     ロード結果を返却します.
    //-------------------------------------------------------------------------
    virtual std::vector<uint8_t> GetResult(uint64_t handle) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ロードリクエストキューが空であるチェックします.
    //! 
    //! @retval true    ロードリクエストはありません.
    //! @retval false   ロードリクエストが残っています.
    //-------------------------------------------------------------------------
    virtual bool IsRequestEmpty() = 0;

    //-------------------------------------------------------------------------
    //! @brief      解放処理です.
    //-------------------------------------------------------------------------
    virtual void Release() = 0;
};

//-----------------------------------------------------------------------------
//! @brief      非同期ファイルローダーを生成します.
//! 
//! @param[out]     ppLoader        非同期ファイルローダーの格納先です.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateAsyncFileLoader(IAsyncFileLoader** ppLoader);

} // namespace asdx
