//-----------------------------------------------------------------------------
// File : asdxBlackboard.h
// Desc : Black Board.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <vector>
#include <unordered_map>
#include <fnd/asdxSpinLock.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Blackboard class
///////////////////////////////////////////////////////////////////////////////
class Blackboard
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Blackboard();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Blackboard();

    //-------------------------------------------------------------------------
    //! @brief      データを設定します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      pBuffer     バッファ.
    //! @param[in]      size        バッファサイズ.
    //-------------------------------------------------------------------------
    void Set(const char* tag, const uint8_t* pBuffer, size_t size);

    //-------------------------------------------------------------------------
    //! @brief      データを設定します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      buffer      バッファ.
    //-------------------------------------------------------------------------
    void Set(const char* tag, const std::vector<uint8_t>& buffer);

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @return     バッファを返却します.
    //-------------------------------------------------------------------------
    const std::vector<uint8_t>& Get(const char* tag) const;

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[out]     pBuffer     バッファ.
    //! @param[in]      size        バッファサイズ.
    //! @retval true    取得に成功.
    //! @retval false   取得に失敗.
    //-------------------------------------------------------------------------
    bool Get(const char* tag, uint8_t* pBuffer, size_t size) const;

    //-------------------------------------------------------------------------
    //! @brief      指定したタグ名が含まれるかチェックします
    //! 
    //! @param[in]      tag         タグ名.
    //! @retval true    検索にヒット.
    //! @retval false   タグ名が存在しません.
    //-------------------------------------------------------------------------
    bool Contains(const char* tag) const;

    //-------------------------------------------------------------------------
    //! @brief      データを全てクリアします.
    //-------------------------------------------------------------------------
    void Clear();

    //-------------------------------------------------------------------------
    //! @brief      データを設定します
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    template<typename T>
    void SetAs(const char* tag, const T& value)
    { Set(tag, &value, sizeof(T)); }

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @return     値を返却します.
    //-------------------------------------------------------------------------
    template<typename T>
    T GetAs(const char* tag)
    {
        T result = {};
        Get(tag, &result, sizeof(T));
        return result;
    }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::unordered_map<std::string, std::vector<uint8_t>> m_Dictionary; //!< 辞書データ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// ThreadSafeBlackboard class
///////////////////////////////////////////////////////////////////////////////
class ThreadSafeBlackboard
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ThreadSafeBlackboard()
    : m_SpinLock  ()
    , m_Blackboard()
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ThreadSafeBlackboard()
    { Clear(); }

    //-------------------------------------------------------------------------
    //! @brief      データを設定します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      pBuffer     バッファ.
    //! @param[in]      size        バッファサイズ.
    //-------------------------------------------------------------------------
    void Set(const char* tag, const uint8_t* pBuffer, size_t size)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        m_Blackboard.Set(tag, pBuffer, size);
    }

    //-------------------------------------------------------------------------
    //! @brief      データを設定します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      buffer      バッファ.
    //-------------------------------------------------------------------------
    void Set(const char* tag, const std::vector<uint8_t>& buffer)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        m_Blackboard.Set(tag, buffer);
    }

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @return     バッファを返却します.
    //-------------------------------------------------------------------------
    const std::vector<uint8_t>& Get(const char* tag)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        return m_Blackboard.Get(tag);
    }

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[out]     pBuffer     バッファ.
    //! @param[in]      size        バッファサイズ.
    //! @retval true    取得に成功.
    //! @retval false   取得に失敗.
    //-------------------------------------------------------------------------
    bool Get(const char* tag, uint8_t* pBuffer, size_t size)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        return m_Blackboard.Get(tag, pBuffer, size);
    }

    //-------------------------------------------------------------------------
    //! @brief      指定したタグ名が含まれるかチェックします
    //! 
    //! @param[in]      tag         タグ名.
    //! @retval true    検索にヒット.
    //! @retval false   タグ名が存在しません.
    //-------------------------------------------------------------------------
    bool Contains(const char* tag)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        return m_Blackboard.Contains(tag);
    }

    //-------------------------------------------------------------------------
    //! @brief      データを全てクリアします.
    //-------------------------------------------------------------------------
    void Clear()
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        m_Blackboard.Clear();
    }

    //-------------------------------------------------------------------------
    //! @brief      データを設定します
    //! 
    //! @param[in]      tag         タグ名.
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    template<typename T>
    void SetAs(const char* tag, const T& value)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        m_Blackboard.SetAs(tag, value);
    }

    //-------------------------------------------------------------------------
    //! @brief      データを取得します.
    //! 
    //! @param[in]      tag         タグ名.
    //! @return     値を返却します.
    //-------------------------------------------------------------------------
    template<typename T>
    T GetAs(const char* tag)
    {
        ScopedLock<SpinLock> locker(m_SpinLock);
        return m_Blackboard.GetAs(tag);
    }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    SpinLock    m_SpinLock;     //!< スピンロックです.
    Blackboard  m_Blackboard;   //!< 黒板です.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


} // namespace asdx
