//-----------------------------------------------------------------------------
// File : asdxStringView.h
// Desc : String View.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// BasicString class
///////////////////////////////////////////////////////////////////////////////
template<typename T>
class BasicStringView
{
    // std::string_view は 16 bytes 使用するので、消費メモリを抑えたい場合に使用します.
    // 文字列操作は基本的に出来ないので、静的文字列あるいは一時的な文字列を保持する役割としてのみ使用してください.

    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BasicStringView() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BasicStringView() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    BasicStringView(const T* value)
    : m_Ptr(value)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      文字列を取得します.
    //-------------------------------------------------------------------------
    const T* c_str() const
    { return m_Ptr; }

    //-------------------------------------------------------------------------
    //! @brief      文字数を取得します.
    //-------------------------------------------------------------------------
    size_t size() const
    { return count(m_Ptr); }

    //-------------------------------------------------------------------------
    //! @brief      空かどうかチェックします.
    //-------------------------------------------------------------------------
    bool empty() const
    { return m_Ptr == nullptr; }

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //-------------------------------------------------------------------------
    bool operator == (const BasicStringView& value) const
    { return compare(c_str(), value.c_str()); }

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //-------------------------------------------------------------------------
    bool operator != (const BasicStringView& value) const
    { return compare(c_str(), value.c_str()); }

    //-------------------------------------------------------------------------
    //! @brief      nullptr あるいは 空文字かどうかチェックします.
    //-------------------------------------------------------------------------
    bool IsNullOrEmpty() const
    {
        if (m_Ptr == nullptr)
            return true;

        return (m_Ptr[0] == T{});
    }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    const T* m_Ptr = nullptr;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      比較処理を行います.
    //-------------------------------------------------------------------------
    static int compare(const T* lhs, const T* rhs)
    {
        while(*lhs && *rhs)
        {
            if (*lhs < *rhs) return -1;
            if (*lhs > *rhs) return 1;
            ++lhs;
            ++rhs;
        }

        if (*lhs) return 1;
        if (*rhs) return -1;
        return 0;
    }

    //-------------------------------------------------------------------------
    //! @brief      文字数を数え上げます.
    //-------------------------------------------------------------------------
    static size_t count(const T* value)
    {
        const T* p = value;
        const auto empty = T{};
        while(*p != empty){ ++p; }
        return static_cast<size_t>(p - value);
    }
};

using StringView    = BasicStringView<char>;
using WStringView   = BasicStringView<wchar_t>;
using U8StringView  = BasicStringView<char8_t>;
using U16StringView = BasicStringView<char16_t>;
using U32StringView = BasicStringView<char32_t>;

} // namespace asdx
