//-----------------------------------------------------------------------------
// File : asdxPath.h
// Desc : File Path.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <filesystem>
#include <string>
#include <list>


namespace asdx {

//-----------------------------------------------------------------------------
// Aliasing
//-----------------------------------------------------------------------------
namespace fs = std::filesystem;


//-----------------------------------------------------------------------------
//! @brief      実行ファイルのファイルパスを取得します.
//!
//! @return     実行ファイルのファイルパスを返却します.
//-----------------------------------------------------------------------------
fs::path GetExePath();

//-----------------------------------------------------------------------------
//! @brief      一時ファイル用のディレクトリパスを取得します.
//! 
//! @return     一時ファイル用のディレクトリパスを返却します.
//-----------------------------------------------------------------------------
fs::path GetTempDir();

//-----------------------------------------------------------------------------
//! @brief      フルパスに変換します.
//!
//! @param[in]      value    変換するファイルパス.
//! @return     フルパスを返却します.
//-----------------------------------------------------------------------------
fs::path ToFullPath(const fs::path& value);

//-----------------------------------------------------------------------------
//! @brief      相対パスに変換します.
//! 
//! @param[in]      base        基準となるパス.
//! @param[in]      path        変換するファイルパス.
//! @param[in]      directory   ファイルパスの場合は false, ディレクトリパスの場合は true を指定.
//! @return     基準となるパスからの相対パスを返却します.
//!             変換に失敗した場合は空文字列が返却されます.
//-----------------------------------------------------------------------------
fs::path ToRelativePath(const fs::path& base, const fs::path& path, bool directory);

//-----------------------------------------------------------------------------
//! @brief      ファイルパスを検索します.
//!
//! @param[in]      filename        検索するファイスパス.
//! @param[out]     result          検索結果の格納先.
//! @retval true    ファイルを発見.
//! @retval false   ファイルが見つからなかった.
//! @memo 検索ルールは以下の通り.
//!      .\
//!      ..\
//!      ..\..\
//!      .\res\
//!      %EXE_DIR%\
//!      %EXE_DIR%\..\
//!      %EXE_DIR%\..\..\
//!      %EXE_DIR%\res\
//-----------------------------------------------------------------------------
bool SearchFilePath(const fs::path& filename, fs::path& result);

//-------------------------------------------------------------------------------------------------
//! @brief      特定ディレクトリの指定された拡張子に対応するファイル一覧を取得します.
//! 
//! @param[in]      directory       ディレクトリパス.
//! @param[in]      ext             拡張子.
//! @param[out]     result          拡張子に一致するファイルリスト.
//! @retval true    ファイルが見つかった.
//! @retval false   ファイルが見つからなかった.
//-------------------------------------------------------------------------------------------------
bool SearchFilesA(const fs::path& directory, const char* ext, std::list<fs::path>& result);

//-------------------------------------------------------------------------------------------------
//! @brief      ファイルを開くダイアログを出します.
//! 
//! @param[in]      filter      ファイルフィルタ.
//! @param[out]     result      ファイルパスの格納先.
//! @param[in]      defaultPath デフォルトパス.
//! @retval true    正常終了.
//! @retval false   キャンセルされました.
//-------------------------------------------------------------------------------------------------
bool OpenFileDlg(const char* filter, fs::path& result, const fs::path& defaultPath ="");

//-------------------------------------------------------------------------------------------------
//! @brief      ファイルを保存ダイアログを出します.
//! 
//! @param[in]      filter      ファイルフィルタ.
//! @param[out]     result      ファイルパスの格納先.
//! @param[in]      defaultPath デフォルトパス.
//! @retval true    正常終了.
//! @retval false   キャンセルされました.
//-------------------------------------------------------------------------------------------------
bool SaveFileDlg(const char* filter, fs::path& result, const fs::path& defaultPath ="");

//-------------------------------------------------------------------------------------------------
//! @brief      フォルダを開くダイアログを出します.
//! 
//! @param[out]     result      フォルダパスの格納先.
//! @param[in]      defaultPath デフォルトパス.
//-------------------------------------------------------------------------------------------------
bool OpenFolderDlg(fs::path& result, const fs::path& defaultPath = "");

//-----------------------------------------------------------------------------
//! @brief      ディレクトリを一括削除します.
//! 
//! @param[in]      dir         ディレクトリパス.
//! @retval true    成功.
//! @retval false   失敗.
//! @note       再帰的にディレクトリを削除していきます.
//-----------------------------------------------------------------------------
bool DeleteDir(const fs::path& dir);

} // namespace asdx
