//-----------------------------------------------------------------------------
// File : asdxTransform.hlsli
// Desc : Transform.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#ifndef ASDX_TRANSFORM_HLSLI
#define ASDX_TRANSFORM_HLSLI


///////////////////////////////////////////////////////////////////////////////
// Transform3x4 structure
///////////////////////////////////////////////////////////////////////////////
struct Transform3x4
{
    float4 Col[3];  // 列優先行列.
};

//-----------------------------------------------------------------------------
//      指定行列で変換します.
//-----------------------------------------------------------------------------
float4 Transform(Transform3x4 m, float4 v)
{
    return float4(
        dot(v, m.Col[0]),
        dot(v, m.Col[1]),
        dot(v, m.Col[2]),
        1.0f);
}

//-----------------------------------------------------------------------------
//      指定行列で変換します.
//-----------------------------------------------------------------------------
float4 Transform(float4x4 m, float4 v)
{
    // m は行優先行列とします.
    return mul(m, v);
}

//-----------------------------------------------------------------------------
//      平行移動成分を除いた指定行列で変換します.
//-----------------------------------------------------------------------------
float3 TransformNormal(Transform3x4 m, float3 v)
{
    return float3(
        dot(v, m.Col[0].xyz),
        dot(v, m.Col[1].xyz),
        dot(v, m.Col[2].xyz));
}

//-----------------------------------------------------------------------------
//      平行移動成分を除いた指定行列で変換します.
//-----------------------------------------------------------------------------
float3 TransformNormal(Transform3x4 m, float4 v)
{
    return float3(
        dot(v.xyz, m.Col[0].xyz),
        dot(v.xyz, m.Col[1].xyz),
        dot(v.xyz, m.Col[2].xyz));
}

//-----------------------------------------------------------------------------
//      平行移動成分を除いた指定行列で変換します.
//-----------------------------------------------------------------------------
float3 TransformNormal(float4x4 m, float3 v)
{
    // m は行優先行列とします.
    return mul((float3x3)m, v);
}

//-----------------------------------------------------------------------------
//      指定行列で変換し，w=1 に射影します.
//-----------------------------------------------------------------------------
float4 TransformCoord(float4x4 m, float4 v)
{
    float4 ret = mul(m, v);
    ret /= ret.w;
    return ret;
}

//-----------------------------------------------------------------------------
//      float4x4 に変換します.
//-----------------------------------------------------------------------------
float4x4 ToFloat4x4(Transform3x4 m)
{
    return float4x4(
        m.Col[0].x, m.Col[1].x, m.Col[2].x, 0.0f,
        m.Col[0].y, m.Col[1].y, m.Col[2].y, 0.0f,
        m.Col[0].z, m.Col[1].z, m.Col[2].z, 0.0f,
        m.Col[0].w, m.Col[1].w, m.Col[2].w, 1.0f);
}

//-----------------------------------------------------------------------------
//      Transform3x4 に変換します.
//-----------------------------------------------------------------------------
Transform3x4 ToTransform3x4(float4x4 m)
{
    // m は行優先行列とします.
    Transform3x4 result;
    result.Col[0] = m._11_21_31_41;
    result.Col[1] = m._12_22_32_42;
    result.Col[2] = m._13_23_33_43;
    return result;
}

//-----------------------------------------------------------------------------
//      X軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisX(Transform3x4 value)
{ return value.Col[0].xyz; }

//-----------------------------------------------------------------------------
//      Y軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisY(Transform3x4 value)
{ return value.Col[1].xyz; }

//-----------------------------------------------------------------------------
//      Z軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisZ(Transform3x4 value)
{ return value.Col[2].xyz; }

//-----------------------------------------------------------------------------
//      位置を取得します.
//-----------------------------------------------------------------------------
float3 GetPosition(Transform3x4 value)
{ return float3(value.Col[0].w, value.Col[1].w, value.Col[2].w); }

// float4x4 の GetAxisX(), GetAxisY(), GetAxisZ(), GetPosition() は
// asdxMath.hlsli にて定義されているため、ここでは定義しません.

#endif//ASDX_TRANSFORM_HLSLI
