//-----------------------------------------------------------------------------
// File : asdxMath.hlsli
// Desc : Math Utility.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#ifndef ASDX_MATH_HLSLI
#define ASDX_MATH_HLSLI

// HLSLのhalf型はfloatマッピングされてしまうため，16bitのまま扱えるようにdefineする. サフィックスはhを使う.
#define half    min16float
#define half2   min16float2
#define half3   min16float3
#define half4   min16float4
#define half2x2 min16float2x2
#define half2x3 min16float2x3
#define half3x2 min16float3x2
#define half3x3 min16float3x3
#define half3x4 min16float3x4
#define half4x2 min16float4x2
#define half4x3 min16float4x3
#define half4x4 min16float4x4

//-----------------------------------------------------------------------------
// Constant Values.
//-----------------------------------------------------------------------------
static const float HALF_MAX  = 65504.0f;         // 半精度浮動小数の最大値.
static const float FLT_NAN   = 0x7fc00000;       // qNaN
static const float FLT_MAX   = 3.402823466e+38f; // 浮動小数の最大値.
static const float F_PI      = 3.1415926535897932384626433832795f;
static const float F_2PI     = 6.283185307179586476925286766559f;
static const float F_1DIVPI  = 0.31830988618379067153776752674503f;
static const float F_1DIV2PI = 0.15915494309189533576888376337251f;
static const float F_PIDIV2  = 1.5707963267948966192313216916398f;

//-----------------------------------------------------------------------------
//      半精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float SaturateHalf(float value)
{ return clamp(value, 0.0f, HALF_MAX); }

//-----------------------------------------------------------------------------
//      半精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float2 SaturateHalf(float2 value)
{ return clamp(value, float(0).xx, HALF_MAX.xx); }

//-----------------------------------------------------------------------------
//      半精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float3 SaturateHalf(float3 value)
{ return clamp(value, float(0).xxx, HALF_MAX.xxx); }

//-----------------------------------------------------------------------------
//      半精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float4 SaturateHalf(float4 value)
{ return clamp(value, float(0).xxxx, HALF_MAX.xxxx); }

//-----------------------------------------------------------------------------
//      精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float SaturateFloat(float value)
{ return clamp(value, 0.0f, FLT_MAX); }

//-----------------------------------------------------------------------------
//      単精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float2 SaturateFloat(float2 value)
{ return clamp(value, float(0.0f).xx, FLT_MAX.xx); }

//-----------------------------------------------------------------------------
//      単精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float3 SaturateFloat(float3 value)
{ return clamp(value, float(0.0f).xxx, FLT_MAX.xxx); }

//-----------------------------------------------------------------------------
//      単精度浮動小数の最大値未満に飽和させます.
//-----------------------------------------------------------------------------
float4 SaturateFloat(float4 value)
{ return clamp(value, float(0.0f).xxxx, FLT_MAX.xxxx); }

#if __HLSL_VERSION >= 2021
//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
template<typename T>
T Pow2(T val)
{ return val * val; }

//-----------------------------------------------------------------------------
//      3乗計算を行います.
//-----------------------------------------------------------------------------
template<typename T>
T Pow3(T val)
{ return val * val * val; }

//-----------------------------------------------------------------------------
//      4乗計算を行います.
//-----------------------------------------------------------------------------
template<typename T>
T Pow4(T val)
{
    T val2 = val * val;
    return val2 * val2;
}
//-----------------------------------------------------------------------------
//      5乗計算を行います.
//-----------------------------------------------------------------------------
template<typename T>
T Pow5(T val)
{
    T val2 = val * val;
    return val2 * val2 * val;
}

//-----------------------------------------------------------------------------
//      再マッピングします.
//-----------------------------------------------------------------------------
template<typename T>
T Remap(T value, T oldMin, T oldMax, T newMin, T newMax)
{ return clamp((value - oldMin) * ((newMax - newMin) / (oldMax - oldMin)) + newMin, newMin, newMax); }

//-----------------------------------------------------------------------------
//      スロープ関数.
//-----------------------------------------------------------------------------
template<typename T>
T LinearStep(T edge0, T edge1, T x)
{ return (x - edge0) / (edge1 - edge0); }

//-----------------------------------------------------------------------------
//      3次エルミート補間.
//-----------------------------------------------------------------------------
template<typename T>
T SmoothStep(T a, T b, T x)
{
    x = LinearStep(a, b, x);
    return (x * x * (3.0f - 2.0f * x));
}

//-----------------------------------------------------------------------------
//      5次エルミート補間.
//-----------------------------------------------------------------------------
template<typename T>
T SmootherStep(T a, T b, T x)
{
    x = LinearStep(a, b, x);
    return (x * x * x * (x * (x * 6.0f - 15.0f) + 10.0f));
}

#else

//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
float Sq(float x)
{ return x * x; }

//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
float Pow2(float x)
{ return x * x; }

//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
float2 Pow2(float2 x)
{ return x * x; }

//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
float3 Pow2(float3 x)
{ return x * x; }

//-----------------------------------------------------------------------------
//      2乗計算を行います.
//-----------------------------------------------------------------------------
float4 Pow2(float4 x)
{ return x * x; }

//-----------------------------------------------------------------------------
//      4乗計算を行います.
//-----------------------------------------------------------------------------
float Pow4(float x)
{
    float x2 = x * x;
    return x2 * x2;
}

//-----------------------------------------------------------------------------
//      4乗計算を行います.
//-----------------------------------------------------------------------------
float2 Pow4(float2 x)
{
    float2 x2 = x * x;
    return x2 * x2;
}

//-----------------------------------------------------------------------------
//      4乗計算を行います.
//-----------------------------------------------------------------------------
float3 Pow4(float3 x)
{
    float3 x2 = x * x;
    return x2 * x2;
}

//-----------------------------------------------------------------------------
//      4乗計算を行います.
//-----------------------------------------------------------------------------
float4 Pow4(float4 x)
{
    float4 x2 = x * x;
    return x2 * x2;
}

//-----------------------------------------------------------------------------
//      5乗計算を行います.
//-----------------------------------------------------------------------------
float Pow5(float x)
{
    float x2 = x * x;
    return x2 * x2 * x;
}

//-----------------------------------------------------------------------------
//      5乗計算を行います.
//-----------------------------------------------------------------------------
float2 Pow5(float2 x)
{
    float2 x2 = x * x;
    return x2 * x2 * x;
}

//-----------------------------------------------------------------------------
//      5乗計算を行います.
//-----------------------------------------------------------------------------
float3 Pow5(float3 x)
{
    float3 x2 = x * x;
    return x2 * x2 * x;
}

//-----------------------------------------------------------------------------
//      5乗計算を行います.
//-----------------------------------------------------------------------------
float4 Pow5(float4 x)
{
    float4 x2 = x * x;
    return x2 * x2 * x;
}

//-----------------------------------------------------------------------------
//      累乗計算を行います.
//-----------------------------------------------------------------------------
float Pow(float a, float b)
{ return SaturateFloat(pow(a, b)); }

//-----------------------------------------------------------------------------
//      累乗計算を行います.
//-----------------------------------------------------------------------------
float2 Pow(float2 a, float2 b)
{ return SaturateFloat(pow(a, b)); }

//-----------------------------------------------------------------------------
//      累乗計算を行います.
//-----------------------------------------------------------------------------
float3 Pow(float3 a, float3 b)
{ return SaturateFloat(pow(a, b)); }

//-----------------------------------------------------------------------------
//      累乗計算を行います.
//-----------------------------------------------------------------------------
float4 Pow(float4 a, float4 b)
{ return SaturateFloat(pow(a, b)); }

//-----------------------------------------------------------------------------
//      再マッピングします.
//-----------------------------------------------------------------------------
float Remap(float value, float oldMin, float oldMax, float newMin, float newMax)
{ return clamp((value - oldMin) * ((newMax - newMin) / (oldMax - oldMin)) + newMin, newMin, newMax); }

//-----------------------------------------------------------------------------
//      再マッピングします.
//-----------------------------------------------------------------------------
float2 Remap(float2 value, float2 oldMin, float2 oldMax, float2 newMin, float2 newMax)
{ return clamp((value - oldMin) * ((newMax - newMin) / (oldMax - oldMin)) + newMin, newMin, newMax); }

//-----------------------------------------------------------------------------
//      再マッピングします.
//-----------------------------------------------------------------------------
float3 Remap(float3 value, float3 oldMin, float3 oldMax, float3 newMin, float3 newMax)
{ return clamp((value - oldMin) * ((newMax - newMin) / (oldMax - oldMin)) + newMin, newMin, newMax); }

//-----------------------------------------------------------------------------
//      再マッピングします.
//-----------------------------------------------------------------------------
float4 Remap(float4 value, float4 oldMin, float4 oldMax, float4 newMin, float4 newMax)
{ return clamp((value - oldMin) * ((newMax - newMin) / (oldMax - oldMin)) + newMin, newMin, newMax); }

//-----------------------------------------------------------------------------
//      スロープ関数.
//-----------------------------------------------------------------------------
float LinearStep(float edge0, float edge1, float x)
{ return (x - edge0) / (edge1 - edge0); }

//-----------------------------------------------------------------------------
//      スロープ関数.
//-----------------------------------------------------------------------------
float2 LinearStep(float2 edge0, float2 edge1, float2 x)
{ return (x - edge0) / (edge1 - edge0); }

//-----------------------------------------------------------------------------
//      スロープ関数.
//-----------------------------------------------------------------------------
float3 LinearStep(float3 edge0, float3 edge1, float3 x)
{ return (x - edge0) / (edge1 - edge0); }

//-----------------------------------------------------------------------------
//      スロープ関数.
//-----------------------------------------------------------------------------
float4 LinearStep(float4 edge0, float4 edge1, float4 x)
{ return (x - edge0) / (edge1 - edge0); }

//-----------------------------------------------------------------------------
//      3次エルミート補間.
//-----------------------------------------------------------------------------
float SmoothStep(float a, float b, float x)
{
    x = LinearStep(a, b, x);
    return (x * x * (3.0f - 2.0f * x));
}

//-----------------------------------------------------------------------------
//      3次エルミート補間.
//-----------------------------------------------------------------------------
float2 SmoothStep(float2 a, float2 b, float2 x)
{
    x = LinearStep(a, b, x);
    return (x * x * (3.0f - 2.0f * x));
}

//-----------------------------------------------------------------------------
//      3次エルミート補間.
//-----------------------------------------------------------------------------
float3 SmoothStep(float3 a, float3 b, float3 x)
{
    x = LinearStep(a, b, x);
    return (x * x * (3.0f - 2.0f * x));
}

//-----------------------------------------------------------------------------
//      3次エルミート補間.
//-----------------------------------------------------------------------------
float4 SmoothStep(float4 a, float4 b, float4 x)
{
    x = LinearStep(a, b, x);
    return (x * x * (3.0f - 2.0f * x));
}

//-----------------------------------------------------------------------------
//      5次エルミート補間.
//-----------------------------------------------------------------------------
float SmootherStep(float a, float b, float x)
{
    x = LinearStep(a, b, x);
    return (x * x * x * (x * (x * 6.0f - 15.0f) + 10.0f));
}

//-----------------------------------------------------------------------------
//      5次エルミート補間.
//-----------------------------------------------------------------------------
float2 SmootherStep(float2 a, float2 b, float2 x)
{
    x = LinearStep(a, b, x);
    return (x * x * x * (x * (x * 6.0f - 15.0f) + 10.0f));
}

//-----------------------------------------------------------------------------
//      5次エルミート補間.
//-----------------------------------------------------------------------------
float3 SmootherStep(float3 a, float3 b, float3 x)
{
    x = LinearStep(a, b, x);
    return (x * x * x * (x * (x * 6.0f - 15.0f) + 10.0f));
}

//-----------------------------------------------------------------------------
//      5次エルミート補間.
//-----------------------------------------------------------------------------
float4 SmootherStep(float4 a, float4 b, float4 x)
{
    x = LinearStep(a, b, x);
    return (x * x * x * (x * (x * 6.0f - 15.0f) + 10.0f));
}

#endif

//-----------------------------------------------------------------------------
//      最大コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Max2(float2 value)
{ return max(value.x, value.y); }

//-----------------------------------------------------------------------------
//      最大コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Max3(float3 value)
{ return max(value.x, max(value.y, value.z)); }

//-----------------------------------------------------------------------------
//      最大コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Max4(float4 value)
{ return max(value.x, max(value.y, max(value.z, value.w))); }

//-----------------------------------------------------------------------------
//      最小コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Min2(float2 value)
{ return min(value.x, value.y); }

//-----------------------------------------------------------------------------
//      最小コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Min3(float3 value)
{ return min(value.x, min(value.y, value.z)); }

//-----------------------------------------------------------------------------
//      最小コンポーネントの値を取得します.
//-----------------------------------------------------------------------------
float Min4(float4 value)
{ return min(value.x, min(value.y, min(value.z, value.w))); }

//-----------------------------------------------------------------------------
//      四捨五入を行います.
//-----------------------------------------------------------------------------
float Round(float value)
{ return floor(value + 0.5f); }

//-----------------------------------------------------------------------------
//      四捨五入を行います.
//-----------------------------------------------------------------------------
float2 Round(float2 value)
{ return floor(value + 0.5f.xx); }

//-----------------------------------------------------------------------------
//      四捨五入を行います.
//-----------------------------------------------------------------------------
float3 Round(float3 value)
{ return floor(value + 0.5f.xxx); }

//-----------------------------------------------------------------------------
//      四捨五入を行います.
//-----------------------------------------------------------------------------
float4 Round(float4 value)
{ return floor(value + 0.5f.xxxx); }

#if __HLSL_VERSION >= 2021
//-----------------------------------------------------------------------------
//      2つの値をソートします.
//-----------------------------------------------------------------------------
template<typename T>
void Sort2(inout T a, inout T b)
{
    T mini = min(a, b);
    T maxi = max(a, b);
    a = mini;
    b = maxi;
}

//-----------------------------------------------------------------------------
//      3つの値の中間値を求めます.
//-----------------------------------------------------------------------------
template<typename T>
T Med3(T a, T b, T c)
{ return max(min(a, b), min(max(a, b), c)); }

//-----------------------------------------------------------------------------
//      5つの値の中間値を求めます.
//-----------------------------------------------------------------------------
template<typename T>
T Med5(T a, T b, T c, T d, T e)
{
    Sort2(a, b);
    Sort2(d, e);
    Sort2(a, c);
    Sort2(b, c);
    Sort2(a, d);
    Sort2(c, d);
    Sort2(b, e);
    Sort2(b, c);
    return c;
}
#else
//-----------------------------------------------------------------------------
//      2つの値をソートします.
//-----------------------------------------------------------------------------
void Sort2(inout float a, inout float b)
{
    float mini = min(a, b);
    float maxi = max(a, b);
    a = mini;
    b = maxi;
}
void Sort2(inout float2 a, inout float2 b)
{
    float2 mini = min(a, b);
    float2 maxi = max(a, b);
    a = mini;
    b = maxi;
}
void Sort2(inout float3 a, inout float3 b)
{
    float3 mini = min(a, b);
    float3 maxi = max(a, b);
    a = mini;
    b = maxi;
}
void Sort2(inout float4 a, inout float4 b)
{
    float4 mini = min(a, b);
    float4 maxi = max(a, b);
    a = mini;
    b = maxi;
}

//-----------------------------------------------------------------------------
//      3つの値の中間値を求めます.
//-----------------------------------------------------------------------------
float Med3(float a, float b, float c)
{ return max(min(a, b), min(max(a, b), c)); }
float2 Med3(float2 a, float2 b, float2 c)
{ return max(min(a, b), min(max(a, b), c)); }
float3 Med3(float3 a, float3 b, float3 c)
{ return max(min(a, b), min(max(a, b), c)); }
float4 Med3(float4 a, float4 b, float4 c)
{ return max(min(a, b), min(max(a, b), c)); }

//-----------------------------------------------------------------------------
//      5つの値の中間値を求めます.
//-----------------------------------------------------------------------------
float Med5(float a, float b, float c, float d, float e)
{
    Sort2(a, b);
    Sort2(d, e);
    Sort2(a, c);
    Sort2(b, c);
    Sort2(a, d);
    Sort2(c, d);
    Sort2(b, e);
    Sort2(b, c);
    return c;
}
float2 Med5(float2 a, float2 b, float2 c, float2 d, float2 e)
{
    Sort2(a, b);
    Sort2(d, e);
    Sort2(a, c);
    Sort2(b, c);
    Sort2(a, d);
    Sort2(c, d);
    Sort2(b, e);
    Sort2(b, c);
    return c;
}
float3 Med5(float3 a, float3 b, float3 c, float3 d, float3 e)
{
    Sort2(a, b);
    Sort2(d, e);
    Sort2(a, c);
    Sort2(b, c);
    Sort2(a, d);
    Sort2(c, d);
    Sort2(b, e);
    Sort2(b, c);
    return c;
}
float4 Med5(float4 a, float4 b, float4 c, float4 d, float4 e)
{
    Sort2(a, b);
    Sort2(d, e);
    Sort2(a, c);
    Sort2(b, c);
    Sort2(a, d);
    Sort2(c, d);
    Sort2(b, e);
    Sort2(b, c);
    return c;
}
#endif

//-----------------------------------------------------------------------------
//      平方根を近似計算します.
//-----------------------------------------------------------------------------
float FastSqrt(float x)
{
    // [Drobot2014a] Low Level Optimizations for GCN
    // https://blog.selfshadow.com/publications/s2016-shading-course/activision/s2016_pbs_activision_occlusion.pdf slide 63
    return asfloat(0x1fbd1df5 + (asint(x) >> 1));
}

//-----------------------------------------------------------------------------
//      アークコサインを近似計算します.
//-----------------------------------------------------------------------------
float FastAcos(float x)
{
    // [Lagarde 2014] Sebastien Lagarde
    // "Inverse trigonometric functions GPU optimization for AMD GCN architecture"
    // https://seblagarde.wordpress.com/2014/12/01/inverse-trigonometric-functions-gpu-optimization-for-amd-gcn-architecture/
    
    // max absolute error 9.0x10^-3
    // Eberly's polynomial degree 1 - respect bounds
    // 4 VGPR, 12 FR (8 FR, 1 QR), 1 scalar
    // input [-1, 1] and output [0, PI]
    x = abs(x);
    float ret = -0.156583 * x + F_PIDIV2;
    ret *= FastSqrt(1.0 - x);
    return (x >= 0) ? ret : F_PI - ret;
}

//-----------------------------------------------------------------------------
//      アークサインを近似計算します.
//-----------------------------------------------------------------------------
float FastAsin(float x)
{
    // [Lagarde 2014] Sebastien Lagarde
    // "Inverse trigonometric functions GPU optimization for AMD GCN architecture"
    // https://seblagarde.wordpress.com/2014/12/01/inverse-trigonometric-functions-gpu-optimization-for-amd-gcn-architecture/
    
    // Same cost as Acos + 1 FR
    // Same error
    // input [-1, 1] and output [-PI/2, PI/2]
    return F_PIDIV2 - FastAcos(x);
}

//-----------------------------------------------------------------------------
//      正の値のアークタンジェントを近似計算します.
//-----------------------------------------------------------------------------
float FastAtanPos(float x)
{
    // [Lagarde 2014] Sebastien Lagarde
    // "Inverse trigonometric functions GPU optimization for AMD GCN architecture"
    // https://seblagarde.wordpress.com/2014/12/01/inverse-trigonometric-functions-gpu-optimization-for-amd-gcn-architecture/
    
    // max absolute error 1.3x10^-3
    // Eberly's odd polynomial degree 5 - respect bounds
    // 4 VGPR, 14 FR (10 FR, 1 QR), 2 scalar
    // input [0, infinity] and output [0, PI/2]
    float t0 = (x < 1.0f) ? x : 1.0f / x;
    float t1 = t0 * t0;
    float poly = 0.0872929f;
    poly = -0.301895f + poly * t1;
    poly = 1.0f + poly * t1;
    poly = poly * t0;
    return (x < 1.0f) ? poly : F_PIDIV2 - poly;
}

//-----------------------------------------------------------------------------
//      アークタンジェントを近似計算します.
//-----------------------------------------------------------------------------
float FastAtan(float x)
{
    // [Lagarde 2014] Sebastien Lagarde
    // "Inverse trigonometric functions GPU optimization for AMD GCN architecture"
    // https://seblagarde.wordpress.com/2014/12/01/inverse-trigonometric-functions-gpu-optimization-for-amd-gcn-architecture/

    // 4 VGPR, 16 FR (12 FR, 1 QR), 2 scalar
    // input [-infinity, infinity] and output [-PI/2, PI/2]
    float t0 = FastAtanPos(abs(x));
    return (x < 0.0f) ? -t0 : t0;
}

//-----------------------------------------------------------------------------
//      ハードウェアから出力された深度を線形深度に変換します.
//-----------------------------------------------------------------------------
float ToLinearDepth(float hardwareDepth, float nearClip, float farClip)
{ return nearClip / (hardwareDepth * (nearClip - farClip) + farClip); }

//-----------------------------------------------------------------------------
//      ハードウェアから出力された深度をビュー空間深度に変換します.
//-----------------------------------------------------------------------------
float ToViewDepth(float hardwareDepth, float nearClip, float farClip)
{ return -nearClip * farClip / (hardwareDepth * (nearClip - farClip) + farClip); }

//-----------------------------------------------------------------------------
//      ハードウェアから出力されたリバース深度を線形深度に変換します.
//-----------------------------------------------------------------------------
float ToLinearDepthFromReverseZ(float hardwareDepth, float nearClip, float farClip)
{ return -nearClip / (hardwareDepth * (nearClip - farClip) + nearClip); }

//-----------------------------------------------------------------------------
//      ハードウェアから出力されたリバース深度をビュー空間深度に変換します.
//-----------------------------------------------------------------------------
float ToViewDepthFromReverseZ(float hardwareDepth, float nearClip, float farClip)
{ return -farClip * nearClip / (hardwareDepth * (nearClip - farClip) + nearClip); }

//-----------------------------------------------------------------------------
//      farClip = ∞とするリバースZ深度バッファの値からビュー空間深度値を求めます.
//-----------------------------------------------------------------------------
float ToViewDepthFromReverseZ(float hardwareDepth, float nearClip)
{ return -nearClip / hardwareDepth; }

//-----------------------------------------------------------------------------
//      ビュー空間深度から線形深度に変換します.
//-----------------------------------------------------------------------------
float ToLinearDepth(float viewDepth, float farClip)
{ return viewDepth / farClip; }

//-----------------------------------------------------------------------------
//      線形深度からビュー空間深度に変換します.
//-----------------------------------------------------------------------------
float ToViewDepth(float linearDepth, float farClip)
{ return linearDepth * farClip; }

//-----------------------------------------------------------------------------
//      ビュー空間から射影空間に変換します.
//-----------------------------------------------------------------------------
float3 ToProjPos(float3 viewPos, float4 param)
{
    // param.x = 1.0f / proj[0][0];
    // param.y = 1.0f / proj[1][1];
    // param.z = nearClip;
    // param.w = farClip;
    return float3(
        -viewPos.x / (viewPos.z * param.x),
        -viewPos.y / (viewPos.z * param.y),
        -(param.w / (param.z - param.w)) * (1.0f + (param.z / viewPos.z)));
}

//-----------------------------------------------------------------------------
//      ビュー空間位置からテクスチャ座標を求めます.
//-----------------------------------------------------------------------------
float2 ToTexCoord(float3 viewPos, float2 param)
{
    // param.x = 1.0f / proj[0][0];
    // param.y = 1.0f / proj[1][1];
    float2 p;
    p.x = (-viewPos.x / (viewPos.z * param.x)) * ( 0.5f) + 0.5f;
    p.y = (-viewPos.y / (viewPos.z * param.y)) * (-0.5f) + 0.5f;
    return p;
}

//-----------------------------------------------------------------------------
//      ビュー空間位置を求めます.
//-----------------------------------------------------------------------------
float3 ToViewPos(float2 uv, float viewZ, float2 param)
{
    // param.x = 1.0f / proj[0][0];
    // param.y = 1.0f / proj[1][1];
    float2 p = uv * float2(2.0f, -2.0f) + float2(-1.0f, 1.0f);
    p *= -viewZ * param;
    return float3(p, viewZ);
}

//-----------------------------------------------------------------------------
//      余弦の値から正弦を求めます.
//-----------------------------------------------------------------------------
float ToSin(float cosine)
{ return sqrt(1.0f - cosine * cosine); }

//-----------------------------------------------------------------------------
//      2要素の合計を求めます.
//-----------------------------------------------------------------------------
float Sum(float2 v)
{ return v.x + v.y; }

//-----------------------------------------------------------------------------
//      3要素の合計を求めます.
//-----------------------------------------------------------------------------
float Sum(float3 v)
{ return v.x + v.y + v.z; }

//-----------------------------------------------------------------------------
//      4要素の合計を求めます.
//-----------------------------------------------------------------------------
float Sum(float4 v)
{ return v.x + v.y + v.z + v.w; }

//-----------------------------------------------------------------------------
//      Ray vs Sphereの交差判定を行います.
//-----------------------------------------------------------------------------
bool RaySphereHit(float3 rayOrigin, float3 rayDir, float3 sphereCenter, float sphereRadius)
{
    float3 closestPointOnRay = max(0, dot(sphereCenter - rayOrigin, rayDir)) * rayDir;
    float3 centerToRay = rayOrigin + closestPointOnRay - sphereCenter;
    return dot(centerToRay, centerToRay) <= Pow2(sphereRadius);
}

//-----------------------------------------------------------------------------
//      Ray vs AABBの交差判定を行います.
//-----------------------------------------------------------------------------
bool RayBoxHit(float3 rayOrigin, float3 invRayDir, float3 boxMin, float3 boxMax)
{
    float3 t0 = (boxMin - rayOrigin) * invRayDir;
    float3 t1 = (boxMax - rayOrigin) * invRayDir;
    float3 tmin = min(t0, t1);
    float3 tmax = max(t0, t1);
    return Max3(tmin) <= Min3(tmax);
}

//-----------------------------------------------------------------------------
//      AABBとの交差判定を行い, 交点までの距離を返却します.
//-----------------------------------------------------------------------------
float IntersectAABB(float3 dir, float3 orig, float3 mini, float3 maxi)
{
    float3 invDir = rcp(dir);
    float3 p0 = (mini - orig) * invDir;
    float3 p1 = (maxi - orig) * invDir;
    float3 t = min(p0, p1);
    return Max3(t);
}

//-----------------------------------------------------------------------------
//      X軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisX(float4x4 view)
{ return view._11_12_13; } // CPU側と比べて転置しているので注意.

//-----------------------------------------------------------------------------
//      Y軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisY(float4x4 view)
{ return view._21_22_23; } // CPU側と比べて転置しているので注意.

//-----------------------------------------------------------------------------
//      Z軸を取得します.
//-----------------------------------------------------------------------------
float3 GetAxisZ(float4x4 view)
{ return view._31_32_33; } // CPU側と比べて転置しているので注意.

//-----------------------------------------------------------------------------
//      カメラ位置を取得します.
//-----------------------------------------------------------------------------
float3 GetCameraPosition(float4x4 view)
{
    return -view._11_12_13 * view._14
           -view._21_22_23 * view._24
           -view._31_32_33 * view._34;
}

//-----------------------------------------------------------------------------
//      平行移動成分を取得します.
//-----------------------------------------------------------------------------
float3 GetTranslation(float4x4 value)
{ return value._14_24_34; }

//-----------------------------------------------------------------------------
//      垂直画角を取得します.
//-----------------------------------------------------------------------------
float GetFieldOfView(float4x4 proj)
{
    float yScale = proj._22;
    return 2.0f * atan(1.0f / yScale);
}

//-----------------------------------------------------------------------------
//      ニアクリップ平面の距離を取得します.
//-----------------------------------------------------------------------------
float GetNearClip(float4x4 proj)
{ return -proj._43 / proj._33; }

//-----------------------------------------------------------------------------
//      ファークリップ平面の距離を取得します.
//-----------------------------------------------------------------------------
float GetFarClip(float4x4 proj)
{
    float nearClip = GetNearClip(proj);
    return (proj._33 * nearClip) / (proj._33 - 1.0f);
}

//-----------------------------------------------------------------------------
//      FarClip = ∞ とするReverse-Z射影行列からニアクリップ平面の距離を取得します.
//-----------------------------------------------------------------------------
float GetNearClipReverseZ(float4x4 proj)
{ return -proj._43; }

//-----------------------------------------------------------------------------
//      レイの方向を求めます.
//-----------------------------------------------------------------------------
float3 CalcRayDir(float2 pixel, float4x4 view, float4x4 proj)
{
    // pixel : [-1, 1]の正規化されているピクセル座標とします(y方向は反転補正済みの前提).
    // view : ビュー行列.
    // proj : 透視投影行列.

    float aspect  = proj._22 / proj._11;
    float tanFovY = 1.0f / proj._22;

    return normalize(
        (view._11_12_13 * pixel.x * tanFovY * aspect)
      + (view._21_22_23 * pixel.y * tanFovY)
      - (view._31_32_33)); // 右手系なので，レイの進む向きは-Z方向.
}

//-----------------------------------------------------------------------------
//      単位行列を生成します.
//-----------------------------------------------------------------------------
float4x4 CreateIdentity()
{
    return float4x4(
        1.0f, 0.0f, 0.0f, 0.0f,
        0.0f, 1.0f, 0.0f, 0.0f,
        0.0f, 0.0f, 1.0f, 0.0f,
        0.0f, 0.0f, 0.0f, 1.0f);
}

//-----------------------------------------------------------------------------
//      X軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
float4x4 CreateRotationX(float radian)
{
    float sinRad, cosRad;
    sincos(radian, sinRad, cosRad);
    return float4x4(
        1.0f,     0.0f,     0.0f,   0.0f,
        0.0f,    cosRad,  sinRad,   0.0f,
        0.0f,   -sinRad,  cosRad,   0.0f,
        0.0f,      0.0f,    0.0f,   1.0f);
}

//-----------------------------------------------------------------------------
//      Y軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
float4x4 CreateRotationY(float radian)
{
    float sinRad, cosRad;
    sincos(radian, sinRad, cosRad);
    return float4x4(
        cosRad,     0.0f,   -sinRad,    0.0f,
          0.0f,     1.0f,      0.0f,    0.0f,
        sinRad,     0.0f,    cosRad,    0.0f,
          0.0f,     0.0f,      0.0f,    1.0f);
}

//-----------------------------------------------------------------------------
//      Z軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
float4x4 CreateRotationZ(float radian)
{
    float sinRad, cosRad;
    sincos(radian, sinRad, cosRad);
    return float4x4(
      cosRad,   sinRad,     0.0f,   0.0f,
     -sinRad,   cosRad,     0.0f,   0.0f,
        0.0f,     0.0f,     1.0f,   0.0f,
        0.0f,     0.0f,     0.0f,   1.0f);
}

//-----------------------------------------------------------------------------
//      パッキングされたプリミティブ番号を展開します.
//-----------------------------------------------------------------------------
uint3 UnpackPrimitiveIndex(uint packed)
{
    return uint3(
        packed & 0x3FF,
        (packed >> 10) & 0x3FF,
        (packed >> 20) & 0x3FF);
}

//-----------------------------------------------------------------------------
//      R8G8B8A8_SNORMを展開します.
//-----------------------------------------------------------------------------
float4 UnpackSnorm4(uint packed)
{
    float4 v;
    v.x = float((packed >> 0) & 0xFF);
    v.y = float((packed >> 8) & 0xFF);
    v.z = float((packed >> 16) & 0xFF);
    v.w = float((packed >> 24) & 0xFF);
    v = v / 255.0;
    v = v * 2.0 - 1.0;
    return v;
}

//-----------------------------------------------------------------------------
//      R8G8B8A8_UNORMを展開します.
//-----------------------------------------------------------------------------
float4 UnpackUnorm4(uint packed)
{
    float4 v;
    v.x = float((packed >> 0) & 0xFF);
    v.y = float((packed >> 8) & 0xFF);
    v.z = float((packed >> 16) & 0xFF);
    v.w = float((packed >> 24) & 0xFF);
    v = v / 255.0;
    return v;
}

//-----------------------------------------------------------------------------
//      R16G16_FLOATを展開します.
//-----------------------------------------------------------------------------
float2 UnpackHalf2(uint packed)
{
    float2 result;
    result.x = f16tof32(packed & 0xffff);
    result.y = f16tof32((packed >> 16) & 0xffff);
    return result;
}

//-----------------------------------------------------------------------------
//      R16G16_UINTを展開します.
//-----------------------------------------------------------------------------
uint2 UnpackUshort2(uint packed)
{
    return uint2(
        packed & 0xffff,
        (packed >> 16) & 0xffff);
}

//-----------------------------------------------------------------------------
//      R16G16B16A16_UINTを展開します.
//-----------------------------------------------------------------------------
uint4 UnpackUshort4(uint2 packed)
{
    return uint4(
        UnpackUshort2(packed.x),
        UnpackUshort2(packed.y));
}

//-----------------------------------------------------------------------------
//      R10G10B10A2_UINTフォーマットを展開します.
//-----------------------------------------------------------------------------
uint4 DecodeR10G10B10A2(uint packed)
{
    return uint4(
        packed & 0x3FF,
        (packed >> 10) & 0x3FF,
        (packed >> 20) & 0x3FF,
        (packed >> 30) & 0x2);
}

//-----------------------------------------------------------------------------
//      八面体リピート処理を行います.
//-----------------------------------------------------------------------------
float2 OctWrap(float2 v)
{
#if __HLSL_VERSION >= 2021
    return (1.0f - abs(v.yx)) * select(v.xy >= 0.0f, 1.0f, -1.0f);
#else
    return (1.0f - abs(v.yx)) * (v.xy >= 0.0f ? 1.0f : -1.0f);
#endif
}

#endif//ASDX_MATH_HLSLI
