//-----------------------------------------------------------------------------
// File : asdxColor.hlsli
// Desc : Color conversion and dithering functions.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#ifndef ASDX_COLOR_HLSLI
#define ASDX_COLOR_HLSLI

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "asdxMath.hlsli"
#include "asdxRandom.hlsli"


//-----------------------------------------------------------------------------
// Costants.
//-----------------------------------------------------------------------------
static const float PQ_m1 = 2610.0 / 16384.0;
static const float PQ_m2 = 2523.0 / 32.0;
static const float PQ_c1 = 3424.0 / 4096.0;
static const float PQ_c2 = 2413.0 / 128.0;
static const float PQ_c3 = 2392.0 / 128.0;
static const float PQ_MAX_NITS = 10000.0;


//-----------------------------------------------------------------------------
//      リニアからSRGBへの変換.
//-----------------------------------------------------------------------------
float3 LinearToSRGB(float3 color)
{
    float3 result;
    result.x = (color.x < 0.0031308f) ? 12.92f * color.x : 1.055f * pow(abs(color.x), 1.0f / 2.4f) - 0.05f;
    result.y = (color.y < 0.0031308f) ? 12.92f * color.y : 1.055f * pow(abs(color.y), 1.0f / 2.4f) - 0.05f;
    result.z = (color.z < 0.0031308f) ? 12.92f * color.z : 1.055f * pow(abs(color.z), 1.0f / 2.4f) - 0.05f;
    return result;
}

//-----------------------------------------------------------------------------
//      SRGBからリニアへの変換.
//-----------------------------------------------------------------------------
float3 SRGBToLinear(float3 color)
{
    float3 result;
    result.x = (color.x < 0.0405f) ? color.x / 12.92f : pow((abs(color.x) + 0.055f) / 1.055f, 2.4f);
    result.y = (color.y < 0.0405f) ? color.y / 12.92f : pow((abs(color.y) + 0.055f) / 1.055f, 2.4f);
    result.z = (color.z < 0.0405f) ? color.z / 12.92f : pow((abs(color.z) + 0.055f) / 1.055f, 2.4f);
    return result;
}

//-----------------------------------------------------------------------------
//      リニアからBT.709への変換.
//-----------------------------------------------------------------------------
float3 OETF_BT709(float3 color)
{
    float3 result;
    result.r = (color.r <= 0.018f) ? 4.5f * color.r : 1.099f * pow(abs(color.r), 0.45f) - 0.099f;
    result.g = (color.g <= 0.018f) ? 4.5f * color.g : 1.099f * pow(abs(color.g), 0.45f) - 0.099f;
    result.b = (color.b <= 0.018f) ? 4.5f * color.b : 1.099f * pow(abs(color.b), 0.45f) - 0.099f;
    return result;
}

//-----------------------------------------------------------------------------
//      BT.709からリニアへの変換.
//-----------------------------------------------------------------------------
float3 EOTF_BT709(float3 color)
{
    float3 result;
    result.r = (color.r < 0.081f) ? color.r / 4.5f : pow((color.r + 0.099f) / 1.099f, 1.0f / 0.45f);
    result.g = (color.g < 0.081f) ? color.g / 4.5f : pow((color.g + 0.099f) / 1.099f, 1.0f / 0.45f);
    result.b = (color.b < 0.081f) ? color.b / 4.5f : pow((color.b + 0.099f) / 1.099f, 1.0f / 0.45f);
    return result;
}

//-----------------------------------------------------------------------------
//      リニアから BT.2100 PQ への変換.
//-----------------------------------------------------------------------------
float3 OETF_BT2100_PQ(float3 color)
{
    float3 Y = pow(abs(color.rgb), PQ_m1);
    return pow((PQ_c1 + PQ_c2 * Y) / (1 + PQ_c3 * Y), PQ_m2);
}

//-----------------------------------------------------------------------------
//      BT.2100 PQ からリニアへの変換.
//-----------------------------------------------------------------------------
float3 EOTF_BT2100_PQ(float3 color)
{
    float3 E = pow(color, 1.0f / PQ_m2);
    return pow(max(E - PQ_c1, 0.0f) / (PQ_c2 - PQ_c3 * E), 1.0f / PQ_m1);
}

//-----------------------------------------------------------------------------
//      BT.601での輝度値を求めます.
//-----------------------------------------------------------------------------
float LuminanceBT601(float3 value)
{ return dot(value, float3(0.299f, 0.587f, 0.114f)); }

//-----------------------------------------------------------------------------
//      BT.709での輝度値を求めます.
//-----------------------------------------------------------------------------
float LuminanceBT709(float3 value)
{ return dot(value, float3(0.2126f, 0.7152f, 0.0722f)); }

//-----------------------------------------------------------------------------
//      BT.2020での輝度値を求めます.
//-----------------------------------------------------------------------------
float LuminanceBT2020(float3 value)
{ return dot(value, float3(0.2627f, 0.6780f, 0.0593f)); }

//-----------------------------------------------------------------------------
//      HLGでの輝度値を求めます.
//-----------------------------------------------------------------------------
float LuminanceHLG(float3 value)
{ return dot(value, float3(0.2627f, 0.6780f, 0.0593f)); }

//-----------------------------------------------------------------------------
//      BT.601 YCbCrに変換します.
//-----------------------------------------------------------------------------
float3 ToYCbCrBT601(float3 value)
{
    float Y  = LuminanceBT601(value);
    float Cb = (value.b - Y) / 1.772f;
    float Cr = (value.r - Y) / 1.402f;
    return float3(Y, Cb, Cr);
}

//-----------------------------------------------------------------------------
//      BT.709 YCbCrに変換します.
//-----------------------------------------------------------------------------
float3 ToYCbCrBT709(float3 value)
{
    float Y  = LuminanceBT709(value);
    float Cb = (value.b - Y) / 1.8556f;
    float Cr = (value.r - Y) / 1.5748f;
    return float3(Y, Cb, Cr);
}

//-----------------------------------------------------------------------------
//      BT.2020 YCbCrに変換します.
//-----------------------------------------------------------------------------
float3 ToYCbCrBT2020(float3 value)
{
    float Y  = LuminanceBT2020(value);
    float Cb = (value.b - Y) / 1.8814f;
    float Cr = (value.r - Y) / 1.4746f;
    return float3(Y, Cb, Cr);
}

//-----------------------------------------------------------------------------
//      BT.601 YCbCr から BT.601 RGB に変換します.
//-----------------------------------------------------------------------------
float3 FromYCbCrBT601(float3 ycbcr)
{
    float R = ycbcr.x + (ycbcr.z * 1.402f);
    float B = ycbcr.x + (ycbcr.y * 1.772f);
    float G = (ycbcr.x - 0.299f * R - 0.114f * B) / 0.587f;
    return float3(R, G, B);
}

//-----------------------------------------------------------------------------
//      BT.709 YCbCr から BT.709 RGB に変換します.
//-----------------------------------------------------------------------------
float3 FromYCbCrBT709(float3 ycbcr)
{
    float R = ycbcr.x + (ycbcr.z * 1.5748f);
    float B = ycbcr.x + (ycbcr.y * 1.8556f);
    float G = (ycbcr.x - 0.2126f * R - 0.0722f * B) / 0.7152f;
    return float3(R, G, B);
}

//-----------------------------------------------------------------------------
//      BT.2020 YCbCr から　BT.2020 RGB に変換します.
//-----------------------------------------------------------------------------
float3 FromYCbCrBT2020(float3 ycbcr)
{
    float R = ycbcr.x + (ycbcr.z * 1.4746f);
    float B = ycbcr.x + (ycbcr.y * 1.8814f);
    float G = (ycbcr.x - 0.2627f * R - 0.0593f * B) / 0.6780f;
    return float3(R, G, B);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.709からAdobeRGBへの変換.
//-----------------------------------------------------------------------------
float3 BT709_To_AdobeRGB(float3 color)
{
    const float3x3 conversion =
    {
        0.715126f, 0.284874f, -0.000000f,
        0.000000f, 1.000000f, 0.000000f,
        0.000000f, 0.041162f, 0.958838f
    };
    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.709からDCI-P3への変換.
//-----------------------------------------------------------------------------
float3 BT709_To_DCI_P3(float3 color)
{
    const float3x3 conversion =
    {
        0.898952f, 0.194049f, 0.000000f,
        0.031821f, 0.926804f, 0.000000f,
        0.019654f, 0.083296f, 1.047586f
    };
    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.709からITU-R BT.2020への変換.
//-----------------------------------------------------------------------------
float3 BT709_To_BT2020(float3 color)
{
    const float3x3 conversion =
    {
        0.627404f, 0.329283f, 0.043313f,
        0.069097f, 0.919540f, 0.011362f,
        0.016391f, 0.088013f, 0.895595f
    };
    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.601からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 BT601_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.393521f, 0.365258f, 0.191677f,
        0.212376f, 0.701060f, 0.086564f,
        0.018739f, 0.111934f, 0.958385f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.709からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 BT709_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.412391f, 0.357584f, 0.180481f,
        0.212639f, 0.715169f, 0.072192f,
        0.019331f, 0.119195f, 0.950532f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.20202からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 BT2020_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.636958f, 0.144617f, 0.168881f,
        0.262700f, 0.677998f, 0.059302f,
        0.000000f, 0.028073f, 1.060985f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      DCI-P3からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 DCI_P3_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.445170f, 0.277134f, 0.172283f,
        0.209492f, 0.721595f, 0.068913f,
        0.000000f, 0.047061f, 0.907355f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      AbodeRGBからCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 AdobeRGB_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.576669f, 0.185558f, 0.188229f,
        0.297345f, 0.627363f, 0.075291f,
        0.027031f, 0.070689f, 0.991337f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ACES AP0からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 AP0_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.9525523959, 0.0000000000, 0.0000936786,
        0.3439664498, 0.7281660966, -0.0721325464,
        0.0000000000, 0.0000000000, 1.0088251844
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ACES AP1からCIE 1931 XYZ表色系への変換.
//-----------------------------------------------------------------------------
float3 AP1_To_XYZ(float3 color)
{
    const float3x3 conversion =
    {
        0.6624541811, 0.1340042065, 0.1561876870,
        0.2722287168, 0.6740817658, 0.0536895174,
       -0.0055746495, 0.0040607335, 1.0103391003
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からITU-R BT.601への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_BT601(float3 color)
{
    const float3x3 conversion =
    {
         3.506002f, -1.739790f, -0.544058f,
        -1.069048f,  1.977779f,  0.035171f,
         0.056307f, -0.196976f,  1.049953f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からITU-R BT.709への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_BT709(float3 color)
{
    const float3x3 conversion =
    {
        3.240970f, -1.537383f, -0.498611f,
       -0.969244f,  1.875968f,  0.041555f,
        0.055630f, -0.203977f,  1.056972f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からITU-R BT.2020への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_BT2020(float3 color)
{
    const float3x3 conversion =
    {
        1.716651f, -0.355671f, -0.253366f,
       -0.666684f,  1.616481f,  0.015769f,
        0.017640f, -0.042771f,  0.942103f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からDCI-P3への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_DCI_P3(float3 color)
{
    const float3x3 conversion =
    {
        2.725394f, -1.018003f, -0.440163f,
       -0.795168f,  1.689732f,  0.022647f,
        0.041242f, -0.087639f,  1.100930f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からAdobeRGBへの変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_AdobeRGB(float3 color)
{
    const float3x3 conversion =
    {
        2.041588f, -0.565007f, -0.344731f,
       -0.969244f,  1.875968f,  0.041555f,
        0.013444f, -0.118362f,  1.015175f
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からACES AP0への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_AP0(float3 color)
{
    const float3x3 conversion =
    {
        1.0498110175, 0.0000000000, -0.0000974845,
       -0.4959030231, 1.3733130458,  0.0982400361,
        0.0000000000, 0.0000000000,  0.9912520182
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からACES AP1への変換.
//-----------------------------------------------------------------------------
float3 XYZ_To_AP1(float3 color)
{
    const float3x3 conversion =
    {
        1.6410233797, -0.3248032942, -0.2364246952,
       -0.6636628587,  1.6153315917,  0.0167563477,
        0.0117218943, -0.0082844420,  0.9883948585
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からCIE 1931 xy 色度座標に変換します.
//-----------------------------------------------------------------------------
float2 XYZ_To_xy(float3 XYZ)
{ return XYZ.xy / (XYZ.x + XYZ.y + XYZ.z).xx; }

//-----------------------------------------------------------------------------
//      CIE 1931 xy 色度座標からCIE 1931 XYZ表色系に変換します..
//-----------------------------------------------------------------------------
float3 xy_To_XYZ(float2 coord, float Y = 1.0f)
{
    float X = (coord.x / coord.y) * Y;
    float Z = ((1.0f - coord.x - coord.y) / coord.y) * Y;
    return float3(X, Y, Z);
}

//-----------------------------------------------------------------------------
//      CIE 1931 XYZ表色系からCIE 1976 u'v'色度座標に変換します.
//-----------------------------------------------------------------------------
float2 XYZ_To_uv(float3 XYZ)
{ return float2(4.0f * XYZ.x, 9.0f * XYZ.y) / (XYZ.x + 15.0f * XYZ.y + 3.0f * XYZ.z).xx; }

//-----------------------------------------------------------------------------
//      CIE 1976 u'v' 色度座標から CIE 1931 XYZ表色系に変換します.
//-----------------------------------------------------------------------------
float3 uv_To_XYZ(float2 uv, float Y = 1.0f)
{
    if (abs(uv.y) <= 1e-6f)
        return float3(0.0f, Y, 0.0f);
 
    return float3(
        Y * (9.0f * uv.x) / (4.0f * uv.y),
        Y,
        Y * (12.0f - 3.0f * uv.x - 20.0f * uv.y) / (4.0f * uv.y));
}

//-----------------------------------------------------------------------------
//      ITU-R BT601からCIE xyYへの変換.
//-----------------------------------------------------------------------------
float2 BT601_To_xy(float3 color)
{
    float3 XYZ = BT601_To_XYZ(color);
    return XYZ_To_xy(XYZ);
}

//-----------------------------------------------------------------------------
//      ITU-R BT709からCIE xyYへの変換.
//-----------------------------------------------------------------------------
float2 BT709_To_xy(float3 color)
{
    float3 XYZ = BT709_To_XYZ(color);
    return XYZ_To_xy(XYZ);
}

//-----------------------------------------------------------------------------
//      ITU-R BT.2020からCIE xyY表色系に変換します.
//-----------------------------------------------------------------------------
float2 BT2020_To_xy(float3 color)
{
    float3 XYZ = BT2020_To_XYZ(color);
    return XYZ_To_xy(XYZ);
}

//-----------------------------------------------------------------------------
//      CIE xyY表色系からITU-R BT.709への変換.
//-----------------------------------------------------------------------------
float3 xy_To_BT709(float2 coord, float Y = 1.0f)
{
    float3 XYZ = xy_To_XYZ(coord, Y);
    return XYZ_To_BT709(XYZ);
};

//-----------------------------------------------------------------------------
//      CIE xyY表色系からITU-R BT.2020に変換します.
//-----------------------------------------------------------------------------
float3 xy_To_BT2020(float2 coord, float Y = 1.0f)
{
    float3 XYZ = xy_To_XYZ(coord, Y);
    return XYZ_To_BT2020(XYZ);
}

//-----------------------------------------------------------------------------
//       CIE xyY表色系からAdobeRGBへの変換.
//-----------------------------------------------------------------------------
float3 xy_To_AdobeRGB(float2 coord, float Y = 1.0f)
{
    float3 XYZ = xy_To_XYZ(coord, Y);
    return XYZ_To_AdobeRGB(XYZ);
}

//-----------------------------------------------------------------------------
//       CIE xyY表色系からDCI-P3への変換.
//-----------------------------------------------------------------------------
float3 xy_To_DCI_P3(float2 coord, float Y = 1.0f)
{
    float3 XYZ = xy_To_XYZ(coord, Y);
    return XYZ_To_DCI_P3(XYZ);
}

//-----------------------------------------------------------------------------
//      ACES AP0 から ACES AP1への変換です.
//-----------------------------------------------------------------------------
float3 AP0_To_AP1(float3 color)
{
    const float3x3 conversion =
    {
        1.4514393161, -0.2365107469, -0.2149285693,
       -0.0765537734,  1.1762296998, -0.0996759264,
        0.0083161484, -0.0060324498,  0.9977163014
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      ACES AP1からACES AP0への変換です.
//-----------------------------------------------------------------------------
float3 AP1_To_AP0(float3 color)
{
    const float3x3 conversion =
    {
        0.6954522414, 0.1406786965, 0.1638690622,
        0.0447945634, 0.8596711185, 0.0955343182,
       -0.0055258826, 0.0040252103, 1.0015006723
    };

    return mul(conversion, color);
}

//-----------------------------------------------------------------------------
//      xy 色度座標から，相関色温度を求めます.
//-----------------------------------------------------------------------------
float CalcCCT(float2 color_xy)
{
    // [McCamy 1992] の近似式.
    // C. S. McCamy, "Correlated color temperature as an explicit function of chromaticity coordinates",
    // Color Research & Application, Vol.17, No.2, pp.142-144, 1992.
    const float n = (color_xy.x - 0.3320f) / (color_xy.y - 0.1858f);
    const float n2 = n * n;
    return -437.0f * (n * n2) + 3601.0f * n2 - 6861.0f * n - 5514.31f;
}

//-----------------------------------------------------------------------------
//      相関色温度から xy 色度座標を求めます.
//-----------------------------------------------------------------------------
float2 xy_FromCCT(float T)
{
    // https://en.wikipedia.org/wiki/Planckian_locus#Approximation
    // [Kang 2002] B.Kang, et.al., "Design of Advanced Color Temperature Control System for HDTV Applications", 2002.
    float invT  = rcp(T);
    float invT2 = invT * invT;
    float invT3 = invT * invT2;

    float x, y;

    if (T < 4000.0f)
        x = -0.2661239e9f * invT3 - 0.2343580e6f * invT2 + 0.8776956e3f * invT + 0.179910f;
    else
        x = -3.0258469e9f * invT3 + 2.1070379e6f * invT2 + 0.2226347e3f * invT + 0.240390f;

    float x2 = x * x;
    float x3 = x * x2;
 
    if (T < 2222.0f)
        y = -1.1063814f * x3 - 1.34811020f * x2 + 2.1855583f  * x - 0.20219683f;
    else if (T < 4000.0f)
        y = -0.9549476f * x3 - 1.37418593f * x2 + 2.09137015f * x - 0.16748867f;
    else
        y =  3.0817580f * x3 - 5.87338670f * x2 + 3.75112997f * x - 0.37001483f;

    return float2(x, y);
}

//-----------------------------------------------------------------------------
//      区分ガウス関数.
//-----------------------------------------------------------------------------
float PiecewiseGaussian(float val, float mu, float tau1, float tau2)
{
    // https://en.wikipedia.org/wiki/CIE_1931_color_space
    float temp = (val < mu) ? (tau1 * (val - mu)) : (tau2 * (val - mu));
    return exp(-0.5f * temp * temp);
}

//-----------------------------------------------------------------------------
//      波長から XYZ 表色系の近似値を求めます.
//-----------------------------------------------------------------------------
float3 WavelengthToXYZ(float lambda)
{
    // https://en.wikipedia.org/wiki/CIE_1931_color_space
    float3 XYZ;
    XYZ.x  = 1.056f * PiecewiseGaussian(lambda, 599.8f, 0.0264f, 0.0323f);
    XYZ.x += 0.363f * PiecewiseGaussian(lambda, 442.0f, 0.0624f, 0.0374f);
    XYZ.x -= 0.065f * PiecewiseGaussian(lambda, 501.1f, 0.0490f, 0.0382f);

    XYZ.y  = 0.821f * PiecewiseGaussian(lambda, 568.8f, 0.0213f, 0.0247f);
    XYZ.y += 0.286f * PiecewiseGaussian(lambda, 530.0f, 0.0613f, 0.0322f);

    XYZ.z  = 1.217f * PiecewiseGaussian(lambda, 437.0f, 0.0845f, 0.0278f);
    XYZ.z += 0.681f * PiecewiseGaussian(lambda, 459.0f, 0.0385f, 0.0725f);

    return XYZ;
}

//-----------------------------------------------------------------------------
//      RGBE形式に圧縮します.
//-----------------------------------------------------------------------------
float4 EncodeRGBE(float3 value)
{
    value = 65536.0f;
    float3 exponent  = clamp(ceil(log2(value)), -128.0f, 127.0f);
    float  component = Max3(exponent);
    float  range     = exp2(component);
    float3 mantissa  = saturate(value / range);
    return float4(mantissa, (component + 128.0f) / 256.0f);
}

//-----------------------------------------------------------------------------
//      RGBE形式を展開します.
//-----------------------------------------------------------------------------
float3 DecodeRGBE(float4 value)
{
    float  exponent = value.a * 256.0f - 128.0f;
    float3 mantissa = value.rgb;
    return exp2(exponent) * mantissa * 65536.0f;
}

//-----------------------------------------------------------------------------
//      色相からRGB値を求めます.
//-----------------------------------------------------------------------------
float3 HueToRGB(float hue)
{
    // https://www.ronja-tutorials.com/post/041-hsv-colorspace/
    hue = frac(hue); //only use fractional part of hue, making it loop
    float r = -1.0f + abs(hue * 6.0f - 3.0f); //red
    float g =  2.0f - abs(hue * 6.0f - 2.0f); //green
    float b =  2.0f - abs(hue * 6.0f - 4.0f); //blue
    return saturate(float3(r, g, b)); //clamp between 0 and 1
}

//-----------------------------------------------------------------------------
//      RGBからYCoCgに変換します.
//-----------------------------------------------------------------------------
float4 RGBToYCoCg(float4 value)
{
    float Y  = dot(value.rgb, float3( 1, 2,  1)) * 0.25;
    float Co = dot(value.rgb, float3( 2, 0, -2)) * 0.25 + (0.5 * 256.0 / 255.0);
    float Cg = dot(value.rgb, float3(-1, 2, -1)) * 0.25 + (0.5 * 256.0 / 255.0);
    return float4(Y, Co, Cg, value.a);
}

//-----------------------------------------------------------------------------
//      YCoCgからRGBに変換します.
//-----------------------------------------------------------------------------
float4 YCoCgToRGB(float4 YCoCg)
{
    float Y  = YCoCg.x;
    float Co = YCoCg.y - (0.5 * 256.0 / 255.0);
    float Cg = YCoCg.z - (0.5 * 256.0 / 255.0);
    float R  = Y + Co - Cg;
    float G  = Y + Cg;
    float B  = Y - Co - Cg;
    return float4(R, G, B, YCoCg.a);
}

//-----------------------------------------------------------------------------
//      Karisのアンチファイアフライウェイトを計算します.
//-----------------------------------------------------------------------------
float KarisAntiFireflyWeight(float3 value, float exposure)
{ return rcp(4.0f + LuminanceBT709(value) * exposure); }

//-----------------------------------------------------------------------------
//      Karisのアンチファイアフライウェイトを計算します.
//-----------------------------------------------------------------------------
float KarisAntiFireflyWeightY(float luma, float exposure)
{ return rcp(4.0f + luma * exposure); }

//-----------------------------------------------------------------------------
//      先鋭化フィルタを適用します.
//-----------------------------------------------------------------------------
float4 ApplySharpening
(
    float4  center,     // 中心ピクセル.
    float4  top,        // 上ピクセル.
    float4  left,       // 左ピクセル.
    float4  right,      // 右ピクセル.
    float4  bottom,     // 下ピクセル.
    float   weight,     // 中心の重み (デフォルト4.0)
    float   tolerance   // 許容値 (デフォルト0.1)
)
{
    // https://en.wikipedia.org/wiki/Unsharp_masking

    float4 result = RGBToYCoCg(center);

    float unsharpenMask;
    unsharpenMask = weight * result.x;
    unsharpenMask -= RGBToYCoCg(top).x;
    unsharpenMask -= RGBToYCoCg(bottom).x;
    unsharpenMask -= RGBToYCoCg(left).x;
    unsharpenMask -= RGBToYCoCg(right).x;

    const float invWeight = SaturateFloat(1.0f / weight);
    result.x = clamp(
        result.x + invWeight * unsharpenMask,
        (1.0f - tolerance) * result.x,
        (1.0f + tolerance) * result.x);

    return YCoCgToRGB(result);
}

//-----------------------------------------------------------------------------
//      暗い値を採用します.
//-----------------------------------------------------------------------------
float3 BlednDarken(float3 base, float3 blend)
{ return min(base, blend); }

//-----------------------------------------------------------------------------
//      明るい値を採用します.
//-----------------------------------------------------------------------------
float3 BlendLighten(float3 base, float3 blend)
{ return max(base, blend); }

//-----------------------------------------------------------------------------
//      カラー乗算します.
//-----------------------------------------------------------------------------
float3 BlendMultiply(float3 base, float3 blend)
{ return base * blend; }

//-----------------------------------------------------------------------------
//      スクリーン乗算します.
//-----------------------------------------------------------------------------
float3 BlendScreen(float3 base, float3 blend)
{ return 1.0f - (1.0f - base) * (1.0f - blend); }

//-----------------------------------------------------------------------------
//      オーバーレイ合成します.
//-----------------------------------------------------------------------------
float3 BlendOverlay(float3 base, float3 blend)
{ return lerp(2.0f * base * blend, 1.0f - 2.0f * (1.0f - base) * (1.0f - blend), step(0.5f, base)); }

#endif//ASDX_COLOR_HLSLI
