//-----------------------------------------------------------------------------
// File : asdxBlink.h
// Desc : blink Utility.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

#if _MSC_VER
namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      blink.exe を起動し，ホットリロードを可能にします.
//! 
//! @param[in]      path        blink.exeのファイルパスを指定してください.
//! @retval true    起動に成功.
//! @retval false   起動に失敗.
//-----------------------------------------------------------------------------
bool InitBlink(const char* path);

//------------------------------------------------------------------------------
//! @brief      blink.exe を終了させます.
//------------------------------------------------------------------------------
void TermBlink();

} // namespace asdx

#endif//_MSC_VER
