//-----------------------------------------------------------------------------
// File : asdxLivePP.h
// Desc : Live++ Helper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once
#if ASDX_ENABLE_LPP

//-----------------------------------------------------------------------------
// Includes.
//-----------------------------------------------------------------------------
#include "LivePP/API/x64/LPP_API_x64_CPP.h"


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// LivePP class
///////////////////////////////////////////////////////////////////////////////
class LivePP
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      lppPath     絶対パスまたは相対パス(末尾のスラッシュはなし).
    //! @note   lppPathは "asdx12/external/LivePP" へのパスを設定してください.
    //-------------------------------------------------------------------------
    LivePP(const wchar_t* const lppPath)
    {
        m_Agent = lpp::LppCreateDefaultAgent(nullptr, lppPath);

        if (!lpp::LppIsValidDefaultAgent(&m_Agent))
        {
            m_Valid = false;
            return;
        }

        m_Agent.EnableModule(
            lpp::LppGetCurrentModulePath(),
            lpp::LPP_MODULES_OPTION_ALL_IMPORT_MODULES,
            nullptr,
            nullptr);

        m_Valid = true;
    }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~LivePP()
    {
        if (!m_Valid)
            return;

        lpp::LppDestroyDefaultAgent(&m_Agent);
        m_Valid = false;
    }

    //-------------------------------------------------------------------------
    //! @brief      有効かどうかチェックします.
    //! 
    //! @retval true    有効です.
    //! @retval false   無効です.
    //-------------------------------------------------------------------------
    bool IsValid() const
    { return m_Valid; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    lpp::LppDefaultAgent m_Agent = {};
    bool                 m_Valid = false;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
#endif//ASDX_ENABLE_LPP
