//-----------------------------------------------------------------------------
// File : asdxGitHelper.h
// Desc : Git Helper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <vector>
#include <string>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// GitCommitRecord structure
///////////////////////////////////////////////////////////////////////////////
struct GitCommitRecord
{
    std::string Hash;       //!< コミットハッシュ.
    std::string Author;     //!< 作者.
    std::string Date;       //!< 日付.
    std::string Message;    //!< メッセージ.
};

///////////////////////////////////////////////////////////////////////////////
// GitStashRecord structure
///////////////////////////////////////////////////////////////////////////////
struct GitStashRecord
{
    std::string Name;       //!< スタッシュ名.
    std::string Message;    //!< スタッシュメッセージ.
};

//-----------------------------------------------------------------------------
//! @brief      ファイルを追加します.
//! 
//! @param[in]      filename        追加するファイル名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitAdd(const char* filename);

//-----------------------------------------------------------------------------
//! @brief      ファイルを削除します.
//! 
//! @param[in]      filename        削除するファイル名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitRemove(const char* filename);

//-----------------------------------------------------------------------------
//! @brief      ファイル名を変更します.
//! 
//! @param[in]      oldName         変更前のファイル名.
//! @param[in]      newName         変更後のファイル名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitRename(const char* oldName, const char* newName);

//-----------------------------------------------------------------------------
//! @brief      プルを行います.
//! 
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitPull();

//-----------------------------------------------------------------------------
//! @brief      フェッチを行います.
//! 
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitFetch();

//-----------------------------------------------------------------------------
//! @brief      プッシュを行います.
//! 
//! @param[in]      branchName      ブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitPush(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ログを取得します.
//! 
//! @param[in]      maxCount        最大履歴数.
//! @return     ログを返却します.
//-----------------------------------------------------------------------------
std::vector<GitCommitRecord> GitLog(int maxCount = 50);

//-----------------------------------------------------------------------------
//! @brief      コミットします.
//! 
//! @param[in]      message         コミットメッセージ
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitCommit(const char* message);

//-----------------------------------------------------------------------------
//! @brief      指定されたコミットを打ち消します.
//! 
//! @param[in]      commiteHash     コミットハッシュ.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitRevert(const char* commitHash);

//-----------------------------------------------------------------------------
//! @brief      指定されたコミットにリセットします.
//! 
//! @param[in]      commitHash      コミットハッシュ
//! @param[in]      hard            --hard オプションを指定する場合は true.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitReset(const char* commitHash, bool hard);

//-----------------------------------------------------------------------------
//! @brief      ブランチを作成します.
//! 
//! @param[in]      branchName      作成するブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitCreateBranch(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ブランチを削除します.
//! 
//! @param[in]      branchName      削除するブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitDeleteBranch(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ブランチ切り替えを行います.
//! 
//! @param[in]      branchName      切り替え先のブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitCheckout(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ブランチをリベースします.
//! 
//! @param[in]      branchName      リベース先ブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitRebase(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ブランチをマージします.
//! 
//! @param[in]      branchName      マージ先のブランチ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitMerge(const char* branchName);

//-----------------------------------------------------------------------------
//! @brief      ブランチ一覧を取得します.
//! 
//! @return     ブランチ一覧を返却します.
//-----------------------------------------------------------------------------
std::vector<std::string> GitBranchList();

//-----------------------------------------------------------------------------
//! @brief      スタッシュに退避します.
//! 
//! @param[in]      message     メッセージ.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitStashSave(const char* message);

//-----------------------------------------------------------------------------
//! @brief      スタッシュ一覧を取得します.
//! 
//! @return     スタッシュ一覧を返却します.
//-----------------------------------------------------------------------------
std::vector<GitStashRecord> GetStashList();

//-----------------------------------------------------------------------------
//! @brief      スタッシュに退避した変更を適用します.
//! 
//! @param[in]      stashName       スタッシュ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitStashApply(const char* stashName);

//-----------------------------------------------------------------------------
//! @brief      スタッシュに退避した作業を削除します.
//! 
//! @param[in]      stashName       スタッシュ名.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool GitStashDrop(const char* stashName);

} // namespace asdx
