//-----------------------------------------------------------------------------
// File : asdxSceneNode.h
// Desc : Scene Node.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <vector>
#include <memory>
#include <string>
#include <fnd/asdxTrasnform.h>
#include <rs/asdxSceneComponent.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// SceneNode class
///////////////////////////////////////////////////////////////////////////////
class SceneNode
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    SceneNode() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~SceneNode() = default;

    //-------------------------------------------------------------------------
    //! @brief      親ノードを設定します.
    //! 
    //! @param[in]      value       設定するノード.
    //-------------------------------------------------------------------------
    void SetParent(SceneNode* value);

    //-------------------------------------------------------------------------
    //! @brief      親ノードを取得します.
    //! 
    //! @return     親ノードを返却します.
    //-------------------------------------------------------------------------
    SceneNode* GetParent() const;

    //-------------------------------------------------------------------------
    //! @brief      子ノードを追加します.
    //! 
    //! @param[in]      child       追加する子ノード.
    //-------------------------------------------------------------------------
    void AddChild(SceneNode* child);

    //-------------------------------------------------------------------------
    //! @brief      子ノードを削除します.
    //! 
    //! @param[in]      child       削除する子ノード.
    //-------------------------------------------------------------------------
    void RemoveChild(SceneNode* child);

    //-------------------------------------------------------------------------
    //! @brief      子ノードのリストを取得します.
    //! 
    //! @return     子ノードのリストを返却します.
    //-------------------------------------------------------------------------
    const std::vector<SceneNode*>& GetChildren() const;

    //-------------------------------------------------------------------------
    //! @brief      位置座標を設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void SetPosition(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      位置座標を取得します.
    //! 
    //! @return     位置座標を返却します.
    //-------------------------------------------------------------------------
    const Vector3& GetPosition() const;

    //-------------------------------------------------------------------------
    //! @brief      回転値を設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void SetRotation(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      回転値を取得します.
    //! 
    //! @return     回転値を返却します.
    //-------------------------------------------------------------------------
    const Quaternion& GetRotation() const;

    //-------------------------------------------------------------------------
    //! @brief      スケールを設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void SetScale(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      スケールを取得します.
    //! 
    //! @return     スケールを返却します.
    //-------------------------------------------------------------------------
    const Vector3& GetScale() const;

    //-------------------------------------------------------------------------
    //! @brief      トランスフォームデータを設定します.
    //! 
    //! @param[in]      value       設定するトランスフォームデータ.
    //-------------------------------------------------------------------------
    void SetTransform(const Transform& value);

    //-------------------------------------------------------------------------
    //! @brief      トランスフォームデータを取得します.
    //! 
    //! @return     トランスフォームデータを返却します.
    //-------------------------------------------------------------------------
    const Transform& GetTransform() const;

    //-------------------------------------------------------------------------
    //! @brief      名前を設定します.
    //! 
    //! @param[in]      value       設定する名前.
    //-------------------------------------------------------------------------
    void SetName(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      名前を設定します.
    //! 
    //! @param[in]      value       設定する名前.
    //-------------------------------------------------------------------------
    void SetName(const char* value);

    //-------------------------------------------------------------------------
    //! @brief      名前を取得します.
    //! 
    //! @return     名前を返却します.
    //-------------------------------------------------------------------------
    const std::string& GetName() const;

    //-------------------------------------------------------------------------
    //! @brief      コンポーネントを追加します.
    //! 
    //! @return     追加したコンポーネントを返却します.
    //-------------------------------------------------------------------------
    template<typename T, typename... Args>
    T* AddComponent(Args&&... args);

    //-------------------------------------------------------------------------
    //! @brief      コンポーネントを取得します.
    //! 
    //! @return     コンポーネントを返却します.
    //-------------------------------------------------------------------------
    template<typename T>
    T* GetComponent();

    //-------------------------------------------------------------------------
    //! @brief      コンポーネントを取得します(const版).
    //! 
    //! @return     コンポート年とを返却します.
    //-------------------------------------------------------------------------
    template<typename T>
    const T* GetComponent() const;

    //-------------------------------------------------------------------------
    //! @brief      指定された型のコンポーネントを持つかチェックします.
    //! 
    //! @retval true    指定された型のコンポーネントを持ちます.
    //! @retval false   指定された型のコンポーネントを持ちません.
    //-------------------------------------------------------------------------
    template<typename T>
    bool HasComponent() const;

    //-------------------------------------------------------------------------
    //! @brief      指定された型のコンポーネントを削除します.
    //-------------------------------------------------------------------------
    template<typename T>
    void RemoveComponent();

private:
    ///////////////////////////////////////////////////////////////////////////
    // ComponentItem structure
    ///////////////////////////////////////////////////////////////////////////
    struct ComponentItem
    {
        std::unique_ptr<SceneComponent> Instance;
        std::type_info                  Type;
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    SceneNode*                  m_pParent = nullptr;
    std::vector<SceneNode*>     m_Children;
    Transform                   m_Transform;
    std::vector<ComponentItem>  m_Components;
    std::string                 m_Name;

    //=========================================================================
    // private methods.
    //=========================================================================
    SceneNode(const SceneNode&) = delete;
    SceneNode& operator = (const SceneNode&) = delete;
};


//-----------------------------------------------------------------------------
//      コンポーネントを追加します.
//-----------------------------------------------------------------------------
template<typename T, typename... Args>
inline T* SceneNode::AddComponent(Args&&... args)
{
    auto comp = std::make_unique<T>(std::forward<Args>(args)...);
    auto* result = comp.get();
    result->m_Node = this;

    ComponentItem item = {};
    item.Instance = comp;
    item.Type     = typeid(T);
    m_Components.push_back(std::move(item));

    return result;
}

//-----------------------------------------------------------------------------
//      コンポーネントを取得します.
//-----------------------------------------------------------------------------
template<typename T>
T* SceneNode::GetComponent()
{
    const auto& type = typeid(T);
    for(auto& comp : m_Components)
    {
        if (type == comp.Type)
            return static_cast<T*>(comp.Instance.get());
    }

    return nullptr;
}

//-----------------------------------------------------------------------------
//      コンポーネントを取得します(const版).
//-----------------------------------------------------------------------------
template<typename T>
const T* SceneNode::GetComponent() const
{
    const auto& type = typeid(T);
    for(auto& comp : m_Components)
    {
        if (type == comp.Type)
            return static_cast<const T*>(comp.Instance().get());
    }

    return nullptr;
}

//-----------------------------------------------------------------------------
//      指定されたコンポーネントを持つかチェックします.
//-----------------------------------------------------------------------------
template<typename T>
bool SceneNode::HasComponent() const
{
    const auto& type = typeid(T);
    for(auto& comp : m_Components)
    {
        if (type == comp.Type)
            return true;
    }

    return false;
}

//-----------------------------------------------------------------------------
//      指定されたコンポーネントを削除します.
//-----------------------------------------------------------------------------
template<typename T>
void SceneNode::RemoveComponent()
{
    const auto& type = typeid(T);
    for(auto itr = std::begin(m_Components); itr != std::end(m_Components); ++itr)
    {
        if (itr->Type != type)
            continue;

        itr->Instance->m_pNode = nullptr;
        m_Components.erase(itr);
        return;
    }
}

} // namespace asdx
