//-----------------------------------------------------------------------------
// File : ModelPrefabConverter.h
// Desc : Model Prefab Converter.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <vector>


///////////////////////////////////////////////////////////////////////////////
// MeshMaterial structure
///////////////////////////////////////////////////////////////////////////////
struct MeshMaterial
{
    std::string Name;
    std::string Path;
};

///////////////////////////////////////////////////////////////////////////////
// ModelPrefab structure
///////////////////////////////////////////////////////////////////////////////
struct ModelPrefab
{
    std::string                 ModelPath;
    std::vector<MeshMaterial>   Materials;
};

///////////////////////////////////////////////////////////////////////////////
// ModelPrefabConverter class
///////////////////////////////////////////////////////////////////////////////
class ModelPrefabConverter
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Desc structure
    ///////////////////////////////////////////////////////////////////////////
    struct Desc
    {
        std::string InputPath;      //!< 入力ファイルパス.
        std::string OutputPath;     //!< 出力ファイルパス.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      desc        変換設定.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool Convert(const Desc& desc);

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      input       モデルプレハブ.
    //! @param[out]     binary      バイナリ.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool Convert(const ModelPrefab& input, std::vector<uint8_t>& binary);

    //-------------------------------------------------------------------------
    //! @brief      逆変換処理を行います.
    //! 
    //! @param[in]      binary      バイナリ.
    //! @param[out]     result      モデルプレハブ
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool ReverseConvert(const std::vector<uint8_t>& binary, ModelPrefab& result);

    //-------------------------------------------------------------------------
    //! @brief      jsonファイルからモデルプレハブをロードします.
    //! 
    //! @param[in]      path        jsonファイルパス.
    //! @param[out]     prefab      モデルプレハブの格納先.
    //! @retval true    ロードに成功.
    //! @retval false   ロードに失敗.
    //-------------------------------------------------------------------------
    static bool LoadFromJson(const char* path, ModelPrefab& prefab);

    //-------------------------------------------------------------------------
    //! @brief      jsonファイルにモデルプレハブをセーブします.
    //! 
    //! @param[in]      path        jsonファイルパス.
    //! @param[in]      prefab      モデルプレハブ.
    //! @retval true    セーブに成功.
    //! @retval fasle   セーブに失敗.
    //-------------------------------------------------------------------------
    static bool SaveToJson(const char* path, const ModelPrefab& prefab);
};

