//-----------------------------------------------------------------------------
// File : asdxTask.cpp
// Desc : Task System.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fw/asdxTask.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// TaskManagerBase class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
TaskManagerBase::TaskManagerBase()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
TaskManagerBase::~TaskManagerBase()
{ m_TaskList.clear(); }

//-----------------------------------------------------------------------------
//      タスクを削除します.
//-----------------------------------------------------------------------------
void TaskManagerBase::RemoveTask(TaskBase*& ptr)
{
    if (ptr == nullptr)
        return;

    ptr->OnRemove();
    m_TaskList.erase(ptr);

    Free(ptr);
    ptr = nullptr;
}

//-----------------------------------------------------------------------------
//      更新処理を行います.
//-----------------------------------------------------------------------------
void TaskManagerBase::Update(float deltaSec)
{
    for(auto& task : m_TaskList)
        task.OnUpdate(deltaSec);
}

//-----------------------------------------------------------------------------
//      描画処理を行います.
//-----------------------------------------------------------------------------
void TaskManagerBase::Draw()
{
    for(auto& task : m_TaskList)
        task.OnDraw();
}

//-----------------------------------------------------------------------------
//      全タスクが完了したかチェックします.
//-----------------------------------------------------------------------------
bool TaskManagerBase::IsAllCompleted() const
{
    for(auto& task : m_TaskList)
    {
        if (!task.IsComplete())
            return false;
    }

    return true;
}

//-----------------------------------------------------------------------------
//      遅延削除を行います.
//-----------------------------------------------------------------------------
void TaskManagerBase::DeferredRemove()
{
    auto itr = m_TaskList.begin();
    while(itr != m_TaskList.end())
    {
        if (itr->IsRemovable())
        {
            auto ptr = &(*itr);
            ptr->OnRemove();
            itr = m_TaskList.erase(itr);

            Free(ptr);
            ptr = nullptr;
        }
        else
        {
            itr++;
        }
    }
}

} // namespace asdx
