//-----------------------------------------------------------------------------
// File : asdxSmaa.h
// Desc : Subpixel Morphological Anti-Aliasing.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <gfx/asdxTexture.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Smaa class
///////////////////////////////////////////////////////////////////////////////
class Smaa
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Smaa();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Smaa();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //-------------------------------------------------------------------------
    void Resize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      SMAAを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      handleSRV   入力カラーSRV.
    //! @param[in]      handleUAV   出力カラーUAV.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature> m_RootSignature;
    RefPtr<ID3D12PipelineState> m_EdgeDetectionPSO;
    RefPtr<ID3D12PipelineState> m_CalcBlendWeightPSO;
    RefPtr<ID3D12PipelineState> m_NeighborBlendingPSO;
    ComputeTarget               m_EdgeTarget;
    ComputeTarget               m_WeightTarget;
    ComputeTarget               m_OutputTarget;
    RefPtr<Texture>             m_SearchTexture;
    RefPtr<Texture>             m_AreaTexture;
    D3D12_RESOURCE_STATES       m_EdgeTargetState;
    D3D12_RESOURCE_STATES       m_WeightTargetState;
    D3D12_RESOURCE_STATES       m_OutputTargetState;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
