//-----------------------------------------------------------------------------
// File : asdxGfxMisc.h
// Desc : Graphics Utility.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <d3d12.h>


namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      ミップマップ数を求めます.
//! 
//! @param[in]      width       横幅.
//! @param[in]      height      縦幅.
//-----------------------------------------------------------------------------
uint32_t CountMips(uint32_t width, uint32_t height);

//-----------------------------------------------------------------------------
//! @brief      1ピクセルあたりのビット数を求めます.
//! 
//! @param[in]      format      フォーマット.
//! @return     1ピクセルあたりのビット数を返却します.
//-----------------------------------------------------------------------------
uint32_t GetBitsPerPixel(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      1ピクセルあたりのバイト数を求めます.
//! 
//! @param[in]      format      フォーマット.
//! @return     1ピクセルあたりのバイト数を返却します.
//-----------------------------------------------------------------------------
uint32_t GetBytePerPixel(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      深度フォーマットからリソースフォーマットに変換します.
//! 
//! @param[in]      format      フォーマット.
//! @param[in]      isStencil   ステンシルフォーマットにしたい場合は true.
//! @return     変換したフォーマットを返却します.
//-----------------------------------------------------------------------------
DXGI_FORMAT GetResourceFormat(DXGI_FORMAT format, bool isStencil);

//-----------------------------------------------------------------------------
//! @brief      sRGBフォーマットに変換します.
//! 
//! @param[in]      format      フォーマット.
//! @return     sRGBフォーマットに変換できる場合は変換したフォーマットを返却します.
//-----------------------------------------------------------------------------
DXGI_FORMAT GetSRGBFormat(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      非sRGBフォーマットに変換します.
//! 
//! @param[in]      format      フォーマット.
//! @return     非sRGBフォーマットに変換できる場合は変換したフォーマットを返却します.
//-----------------------------------------------------------------------------
DXGI_FORMAT GetNoSRGBFormat(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      sRGBフォーマットかどうかチェックします.
//! 
//! @param[in]      format      フォーマット.
//! @retval true    sRGBフォーマットです.
//! @retval false   非sRGBフォーマットです.
//-----------------------------------------------------------------------------
bool IsSRGBFormat(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      圧縮フォーマットかどうかチェックします.
//! 
//! @param[in]      format      フォーマット.
//! @retval true    圧縮フォーマットです.
//! @retval false   非圧縮フォーマットです.
//-----------------------------------------------------------------------------
bool IsCompressed(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      DXGI_FORMATを文字列に変換します.
//! 
//! @param[in]      format      フォーマット.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(DXGI_FORMAT format);

//-----------------------------------------------------------------------------
//! @brief      D3D12_RESOURCE_DIMENSIONを文字列に変換します.
//! 
//! @param[in]      dimension   リソース次元.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_RESOURCE_DIMENSION dimension);

//-----------------------------------------------------------------------------
//! @brief      D3D12_RTV_DIMENSIONを文字列に変換します.
//! 
//! @param[in]      dimension   レンダーターゲットビュー次元.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_RTV_DIMENSION dimension);

//-----------------------------------------------------------------------------
//! @brief      D3D12_DSV_DIMENSIONを文字列に変換します.
//! 
//! @param[in]      dimension   深度ステンシルビュー次元.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_DSV_DIMENSION dimension);

//-----------------------------------------------------------------------------
//! @brief      D3D12_SRV_DIMENSIONを文字列に変換します.
//! 
//! @param[in]      dimension   シェーダリソースビュー次元.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_SRV_DIMENSION dimension);

//-----------------------------------------------------------------------------
//! @brief      D3D12_UAV_DIMENSIONを文字列に変換します.
//! 
//! @param[in]      dimension   アンオーダードアクセスビュー次元.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_UAV_DIMENSION dimension);

//-----------------------------------------------------------------------------
//! @brief      D3D12_RESOURCE_STATESを文字列に変換します.
//! 
//! @param[in]      states      リソースステート.
//! @return     文字列を返却します.
//-----------------------------------------------------------------------------
const char* ToString(D3D12_RESOURCE_STATES states);

} // namespace asdx
