//-----------------------------------------------------------------------------
// File : asdxMapChip.h
// Desc : Map Chip.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <res/asdxResMapChip.h>
#include <gfx/asdxSprite.h>
#include <gfx/asdxTextureManager.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MapChip class
///////////////////////////////////////////////////////////////////////////////
class MapChip
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MapChip();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MapChip();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pCmd            グラフィックスコマンドリストです.
    //! @param[in]      blob            バイナリデータ.
    //! @param[in]      screenWidth     スクリーン横幅.
    //! @param[in]      screenHeight    スクリーン縦幅.
    //! @param[in]      drawTileWidth   描画タイル横幅.
    //! @param[in]      drawTileHeight  描画タイル縦幅.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(
        std::vector<uint8_t>&       blob,
        uint32_t                    screenWidth,
        uint32_t                    screenHeight,
        int                         drawTileWidth,
        int                         drawTileHeight);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      マップチップバイナリを取得します.
    //! 
    //! @return     マップチップバイナリを返却します.
    //-------------------------------------------------------------------------
    const MapChipBinary& GetBinary() const;

    //-------------------------------------------------------------------------
    //! @brief      描画処理を行います.
    //! 
    //! @param[in]      renderer    スプライトレンダラー.
    //! @param[in]      sampler     サンプラー.
    //-------------------------------------------------------------------------
    void Draw(SpriteRenderer& renderer, D3D12_GPU_DESCRIPTOR_HANDLE sampler);

    //-------------------------------------------------------------------------
    //! @brief      タイルオフセットを設定します.
    //! 
    //! @param[in]      x       X方向のタイルオフセット.
    //! @param[in]      y       Y方向のタイルオフセット.
    //-------------------------------------------------------------------------
    void SetTileOffset(uint32_t x, uint32_t y);

    //-------------------------------------------------------------------------
    //! @brief      描画スクロール値を設定します.
    //! 
    //! @param[in]      x       X方向のスクロール値.
    //! @param[in]      y       Y方向のスクロール値.
    //-------------------------------------------------------------------------
    void SetScroll(int x, int y);

    //-------------------------------------------------------------------------
    //! @brief      スクリーンサイズを設定します.
    //! 
    //! @param[in]      w       スクリーン横幅.
    //! @param[in]      h       スクリーン縦幅.
    //-------------------------------------------------------------------------
    void SetScreenSize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      描画タイルサイズを設定します.
    //! 
    //! @param[in]      w       タイル横幅.
    //! @param[in]      h       タイル縦幅.
    //-------------------------------------------------------------------------
    void SetDrawTileSize(int w, int h);

    //-------------------------------------------------------------------------
    //! @brief      X方向のタイルオフセットを取得します.
    //! 
    //! @return     X方向のタイルオフセットを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTileOffsetX() const;

    //-------------------------------------------------------------------------
    //! @brief      Y方向のタイルオフセットを取得します.
    //! 
    //! @return     Y方向のタイルオフセットを返却します.
    //-------------------------------------------------------------------------
    uint32_t getTileOffsetY() const;

    //-------------------------------------------------------------------------
    //! @brief      X方向の描画スクロール値を取得します.
    //! 
    //! @return     X方向の描画スクロール値を返却します.
    //-------------------------------------------------------------------------
    int GetScrollX() const;

    //-------------------------------------------------------------------------
    //! @brief      Y方向の描画スクロール値を取得します.
    //! 
    //! @return     Y方向の描画スクロール値を返却します.
    //-------------------------------------------------------------------------
    int GetScrollY() const;

    //-------------------------------------------------------------------------
    //! @brief      描画タイル横幅を取得します.
    //! 
    //! @return     描画タイル横幅を返却します.
    //-------------------------------------------------------------------------
    int GetDrawTileWidth() const;

    //-------------------------------------------------------------------------
    //! @brief      描画タイル縦幅を取得します.
    //! 
    //! @return     描画タイル縦幅を返却します.
    //-------------------------------------------------------------------------
    int GetDrawTileHeight() const;

    //-------------------------------------------------------------------------
    //! @brief      スクリーン横幅を取得します.
    //! 
    //! @return     スクリーン横幅を返却します.
    //------------------------------------------------------------------------
    uint32_t GetScreenWidth() const;

    //-------------------------------------------------------------------------
    //! @brief      スクリーン縦幅を取得します.
    //! 
    //! @return     スクリーン縦幅を返却します.
    //------------------------------------------------------------------------
    uint32_t GetScreenHeight() const;

    //-------------------------------------------------------------------------
    //! @brief      チップIDを取得します.
    //! 
    //! @param[in]      x           X方向のタイル番号.
    //! @param[in]      y           Y方向のタイル番号.
    //! @return     タイルIDを返却します.
    //-------------------------------------------------------------------------
    uint16_t GetChipId(uint32_t x, uint32_t y) const;

    //-------------------------------------------------------------------------
    //! @brief      プロパティを持つかチェックします.
    //! 
    //! @param[in]      x       X方向のタイル番号.
    //! @param[in]      y       Y方向のタイル番号.
    //! @retval true    プロパティを持ちます.
    //! @retval false   プロパティを持ちません.
    //-------------------------------------------------------------------------
    bool HasProperty(uint32_t x, uint32_t y, ResChipProperty& prop) const;

    //-------------------------------------------------------------------------
    //! @brief      クランプフラグを設定します.
    //! 
    //! @param[in]      value       リピート処理を無効化する場合は true を指定.
    //-------------------------------------------------------------------------
    void SetClamp(bool value);

    //-------------------------------------------------------------------------
    //! @brief      クランプフラグを取得します.
    //! 
    //! @retval true    リピート処理が無効です.
    //! @retval false   リピート処理が有効です.
    //-------------------------------------------------------------------------
    bool IsClamp() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    MapChipBinary   m_Binary;
    int             m_ScrollX       = 0;
    int             m_ScrollY       = 0;
    uint32_t        m_TileOffsetX   = 0;
    uint32_t        m_TileOffsetY   = 0;
    int             m_DrawTileW     = 0;
    int             m_DrawTileH     = 0;
    uint32_t        m_ScreenWidth   = 0;
    uint32_t        m_ScreenHeight  = 0;
    int             m_DrawRows      = 0;
    int             m_DrawCols      = 0;
    bool            m_Clamp         = false;

    std::vector<TextureHolder> m_Textures = {};

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      チップIDを取得します.
    //! 
    //! @param[in]      layerId     レイヤーID.
    //! @param[in]      x           X方向のタイル番号.
    //! @param[in]      y           Y方向のタイル番号.
    //! @return     タイルIDを返却します.
    //-------------------------------------------------------------------------
    uint16_t GetChipId(uint32_t layerId, uint32_t x, uint32_t y) const;

    //-------------------------------------------------------------------------
    //! @brief      描画数を更新します.
    //-------------------------------------------------------------------------
    void UpdateDrawCount();

    //-------------------------------------------------------------------------
    //! @brief      タイルオフセット値を更新します.
    //-------------------------------------------------------------------------
    void UpdateTileOffset();
};

} // namespace asdx
