//-----------------------------------------------------------------------------
// File : asdxMovie.h
// Desc : Movie Stream
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <fnd/asdxRef.h>
#include <dxgiformat.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MovieFrame structure
///////////////////////////////////////////////////////////////////////////////
struct MovieFrame
{
    void*   pData = nullptr;  //!< デコードしたピクセルデータ.
    size_t  Size  = 0;        //!< ピクセルデータサイズ(単位:byte).
};

///////////////////////////////////////////////////////////////////////////////
// IMovieStream interface
///////////////////////////////////////////////////////////////////////////////
struct IMovieStream : public IReference
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IMovieStream() = default;

    //-------------------------------------------------------------------------
    //! @brief      ムービーストリームをオープンします.
    //! 
    //! @param[in]      path        ファイル名です.
    //! @retval true    オープンに成功.
    //! @retval false   オープンに失敗.
    //-------------------------------------------------------------------------
    virtual bool Open(const char* path) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ムービーストリームをクローズします.
    //-------------------------------------------------------------------------
    virtual void Close() = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームシークを行います.
    //! 
    //! @param[in]      time        進める時間(単位:100ns).
    //! @retval true    シークに成功.
    //! @retval false   シークに失敗.
    //-------------------------------------------------------------------------
    virtual bool Seek(int64_t time) = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームデータの読み取りを行います.
    //! 
    //! @param[out]     frame       デコード結果の格納先.
    //! @retval true    デコードに成功.
    //! @retval false   デコードに失敗.
    //-------------------------------------------------------------------------
    virtual bool Read(MovieFrame& frame) = 0;

    //-------------------------------------------------------------------------
    //! @brief      横幅を取得します.
    //! 
    //! @return     横幅を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetWidth() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      縦幅を取得します.
    //! 
    //! @return     縦幅を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetHeight() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを取得します.
    //! 
    //! @return     フォーマットを返却します.
    //-------------------------------------------------------------------------
    virtual DXGI_FORMAT GetFormat() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームレートを取得します.
    //! 
    //! @return     フレームレートを返却します(単位:FPS).
    //-------------------------------------------------------------------------
    virtual double GetFrameRate() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム時間を取得します.
    //! 
    //! @return     総フレーム時間を返却します.
    //-------------------------------------------------------------------------
    virtual int64_t GetDuration() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム数を取得します.
    //! 
    //! @return     総フレーム数を返却します.
    //-------------------------------------------------------------------------
    virtual uint64_t GetFrameCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      現在のフレーム番号を取得します.
    //! 
    //! @return     現在のフレーム番号を返却します.
    //-------------------------------------------------------------------------
    virtual uint64_t GetFrameIndex() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      再生の一時停止を設定します.
    //! 
    //! @param[in]      pause       一時停止する場合は true を指定.
    //-------------------------------------------------------------------------
    virtual void SetPause(bool puase) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定を行います.
    //! 
    //! @param[in]      loop        ループ再生を行う場合は true を指定.
    //! @note       ループ再生を有効にした場合は, IsFinished() メソッドは true を返さなくなるので注意してください.
    //-------------------------------------------------------------------------
    virtual void SetLoop(bool loop) = 0;

    //-------------------------------------------------------------------------
    //! @brief      一時停止中かどうかチェックします.
    //! 
    //! @retval true    一時停止中です.
    //! @retval false   再生中です.
    //-------------------------------------------------------------------------
    virtual bool IsPause() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定かどうかチェックします.
    //! 
    //! @retval true    ループ再生です.
    //! @retval false   非ループ再生です.
    //-------------------------------------------------------------------------
    virtual bool IsLoop() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      再生が終了したかどうかチェックします.
    //! 
    //! @retval true    完了状態です.
    //! @retval false   未完了状態です.
    //! @note       ループ再生設定が行われている場合，この関数は常に false を返却します.
    //-------------------------------------------------------------------------
    virtual bool IsFinished() const = 0;
};

//-----------------------------------------------------------------------------
//! @brief      ムービーストリームを生成します.
//! 
//! @param[out]     ppResult   ムービーストリームの格納先.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateMovieStream(IMovieStream** ppResult);

} // namespace asdx

