//-----------------------------------------------------------------------------
// File : asdxRayTracing.h
// Desc : DirectX Ray Tracing Helper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <vector>
#include <d3d12.h>
#include <fnd/asdxMath.h>
#include <fnd/asdxRef.h>
#include <edit/asdxFileWatcher.h>


namespace asdx {

constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_NONE               = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_NONE;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_ALLOW_UPDATE       = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_ALLOW_UPDATE;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_ALLOW_COMPATION    = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_ALLOW_COMPACTION;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_PREFER_FAST_TRACE  = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_PREFER_FAST_TRACE;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_PREFER_FAST_BUILD  = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_PREFER_FAST_BUILD;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_MINIMIZE_MEMORY    = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_MINIMIZE_MEMORY;
constexpr D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS DXR_BUILD_FLAG_PERFORM_UPDATE     = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAG_PERFORM_UPDATE;

using DXR_GEOMETRY_DESC = D3D12_RAYTRACING_GEOMETRY_DESC;
using DXR_BUILD_FLAGS   = D3D12_RAYTRACING_ACCELERATION_STRUCTURE_BUILD_FLAGS;
using DXR_BUILD_DESC    = D3D12_BUILD_RAYTRACING_ACCELERATION_STRUCTURE_DESC;
using DXR_INSTANCE_DESC = D3D12_RAYTRACING_INSTANCE_DESC;


//-----------------------------------------------------------------------------
//! @brief      DXRがサポートされているかどうかチェックします.
//! 
//! @param[in]      pDevice     デバイス.
//! @retval true    DXRサポート.
//! @retval false   DXR非サポート.
//-----------------------------------------------------------------------------
bool IsSupportDXR(ID3D12Device6* pDevice);

//-----------------------------------------------------------------------------
//! @brief      UAVバッファを生成します.
//! 
//! @param[in]      pDevice         デバイス
//! @param[in]      bufferSize      バッファサイズ.
//! @param[out]     ppResource      リソース格納先.
//! @param[in]      initState       初期ステート.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateBufferUAV(
    ID3D12Device*           pDevice,
    UINT64                  bufferSize,
    ID3D12Resource**        ppResource,
    D3D12_RESOURCE_STATES   initState = D3D12_RESOURCE_STATE_COMMON);

//-----------------------------------------------------------------------------
//! @brief      アップロードバッファを生成します.
//! 
//! @param[in]      pDevice         デバイス.
//! @param[in]      bufferSize      バッファサイズ
//! @param[out]     ppResource      リソース格納先
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateUploadBuffer(
    ID3D12Device*           pDevice,
    UINT64                  bufferSize,
    ID3D12Resource**        ppResource);

///////////////////////////////////////////////////////////////////////////////
// AsScratchBuffer class
///////////////////////////////////////////////////////////////////////////////
class AsScratchBuffer
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    AsScratchBuffer() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~AsScratchBuffer();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //-------------------------------------------------------------------------
    bool Init(ID3D12Device* pDevice, size_t size);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      GPU仮想アドレスを取得します.
    //-------------------------------------------------------------------------
    D3D12_GPU_VIRTUAL_ADDRESS GetGpuAddress() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR name);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>  m_Scratch;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// Blas class
///////////////////////////////////////////////////////////////////////////////
class Blas
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Blas() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Blas();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //-------------------------------------------------------------------------
    bool Init(
        ID3D12Device6*              pDevice,
        uint32_t                    count,
        const DXR_GEOMETRY_DESC*    pDescs,
        DXR_BUILD_FLAGS             flags);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      スクラッチバッファサイズを取得します.
    //-------------------------------------------------------------------------
    size_t GetScratchBufferSize() const;

    //-------------------------------------------------------------------------
    //! @brief      ビルドします.
    //-------------------------------------------------------------------------
    void Build(ID3D12GraphicsCommandList4* pCmd, D3D12_GPU_VIRTUAL_ADDRESS scratchAddress);

    //-------------------------------------------------------------------------
    //! @brief      ジオメトリ数を取得します.
    //-------------------------------------------------------------------------
    uint32_t GetGeometryCount() const;

    //-------------------------------------------------------------------------
    //! @brief      ジオメトリ構成を取得します.
    //-------------------------------------------------------------------------
    const DXR_GEOMETRY_DESC& GetGeometry(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      ジオメトリ構成を設定します.
    //-------------------------------------------------------------------------
    void SetGeometry(uint32_t index, const DXR_GEOMETRY_DESC& desc);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR name);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>          m_Structure;
    DXR_BUILD_DESC                  m_BuildDesc;
    std::vector<DXR_GEOMETRY_DESC>  m_GeometryDesc;
    size_t                          m_ScratchBufferSize;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// Tlas class
///////////////////////////////////////////////////////////////////////////////
class Tlas
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Tlas() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Tlas();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //-------------------------------------------------------------------------
    bool Init(
        ID3D12Device6*              pDevice, 
        uint32_t                    instanceCount,
        const DXR_INSTANCE_DESC*    pInstanceDescs,
        DXR_BUILD_FLAGS             flags);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      スクラッチバッファサイズを取得します.
    //-------------------------------------------------------------------------
    size_t GetScratchBufferSize() const;

    //-------------------------------------------------------------------------
    //! @brief      ビルドします.
    //-------------------------------------------------------------------------
    void Build(ID3D12GraphicsCommandList4* pCmd, D3D12_GPU_VIRTUAL_ADDRESS scratchAddress);

    //-------------------------------------------------------------------------
    //! @brief      メモリマッピングを行います.
    //-------------------------------------------------------------------------
    DXR_INSTANCE_DESC* Map();

    //-------------------------------------------------------------------------
    //! @brief      メモリマッピングを解除します.
    //-------------------------------------------------------------------------
    void Unmap();

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR name);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>  m_Structure;
    RefPtr<ID3D12Resource>  m_Instances;
    DXR_BUILD_DESC          m_BuildDesc;
    size_t                  m_ScratchBufferSize;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// RayTracingPipelineStateDesc structure
///////////////////////////////////////////////////////////////////////////////
struct RayTracingPipelineStateDesc
{
    ID3D12RootSignature*                pGlobalRootSignature;
    D3D12_SHADER_BYTECODE               DXILLibrary;
    std::wstring                        RayGeneration;
    std::vector<D3D12_HIT_GROUP_DESC>   HitGroups;
    std::vector<std::wstring>           MissTable;
    uint32_t                            MaxPayloadSize;
    uint32_t                            MaxAttributeSize;
    uint32_t                            MaxTraceRecursionDepth;
};

///////////////////////////////////////////////////////////////////////////////
// ShaderRecord structure
///////////////////////////////////////////////////////////////////////////////
struct ShaderRecord
{
    void* ShaderIdentifier      = nullptr;
    void* LocalRootArguments    = nullptr;
};

///////////////////////////////////////////////////////////////////////////////
// ShaderTable class
///////////////////////////////////////////////////////////////////////////////
class ShaderTable
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Desc structure
    ///////////////////////////////////////////////////////////////////////////
    struct Desc
    {
        uint32_t            RecordCount             = 0;
        uint32_t            LocalRootArgumentSize   = 0;
        const ShaderRecord* pRecords                = nullptr;
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ShaderTable();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ShaderTable();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //-------------------------------------------------------------------------
    bool Init(ID3D12Device* pDevice, const Desc* pDesc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      GPU仮想アドレスと範囲を取得します.
    //-------------------------------------------------------------------------
    D3D12_GPU_VIRTUAL_ADDRESS_RANGE GetRecordView() const;

    //-------------------------------------------------------------------------
    //! @brief      GPU仮想アドレスと範囲とストライドを取得します.
    //-------------------------------------------------------------------------
    D3D12_GPU_VIRTUAL_ADDRESS_RANGE_AND_STRIDE GetTableView() const;

private:
    //=========================================================================
    // private varables.
    //=========================================================================
    RefPtr<ID3D12Resource>  m_Resource;
    UINT                    m_RecordSize;
};

///////////////////////////////////////////////////////////////////////////////
// RayTracingPipelineState class
///////////////////////////////////////////////////////////////////////////////
class RayTracingPipelineState : public IFileListener
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    RayTracingPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~RayTracingPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理です.
    //! 
    //! @param[in]      pDevice     デバイスです.
    //! @param[in]      desc        構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ID3D12Device5* pDevice, const RayTracingPipelineStateDesc& desc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      レイトレーシングパイプラインを起動します.
    //! 
    //! @param[in]      pCmd        コマンドリストです.
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //-------------------------------------------------------------------------
    void DispatchRays(ID3D12GraphicsCommandList4* pCmd, uint32_t width, uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      シェーダライブラリのリロードパスを設定します.
    //! 
    //! @param[in]      path        監視対象となるファイルパス.
    //! @param[in]      shaderModel シェーダモデル.
    //-------------------------------------------------------------------------
    void SetReloadPathLib(const char* path, const char* shaderModel);

    //-------------------------------------------------------------------------
    //! @brief      シェーダリロードの為のインクルードディレクトリを設定します.
    //! 
    //! @param[in]      dirs        インクルードディレクトリ.
    //-------------------------------------------------------------------------
    void SetIncludeDirs(const std::vector<std::string>& dirs);

    //-------------------------------------------------------------------------
    //! @brief      依存ファイル名を設定します.
    //! 
    //! @param[in]      path        ファイルパス.
    //-------------------------------------------------------------------------
    void SetDependencies(const std::vector<std::string>& dependencies);

    //-------------------------------------------------------------------------
    //! @brief      ファイル更新時の処理です.
    //-------------------------------------------------------------------------
    void OnChanged(const FileEventArgs& arg) override;

    //-------------------------------------------------------------------------
    //! @brief      リビルドを要求します.
    //-------------------------------------------------------------------------
    void RequestRebuild() { m_Dirty = true; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RayTracingPipelineStateDesc         m_Desc;

    RefPtr<ID3D12StateObject>           m_pDefaultObject;
    RefPtr<ID3D12StateObjectProperties> m_pDefaultProps;
    ShaderTable                         m_DefaultRayGeneration;
    ShaderTable                         m_DefaultMiss;
    ShaderTable                         m_DefaultHitGroup;

    RefPtr<ID3D12StateObject>           m_pReloadObject;
    RefPtr<ID3D12StateObjectProperties> m_pReloadProps;
    ShaderTable                         m_ReloadRayGeneration;
    ShaderTable                         m_ReloadMiss;
    ShaderTable                         m_ReloadtHitGroup;


    std::string                 m_ReloadPathLib;
    std::string                 m_ShaderModelLib;

    std::vector<std::string>    m_IncludeDirs;
    std::vector<std::string>    m_Dependencies;

    std::vector<uint8_t>        m_Lib;
    std::atomic<bool>           m_Dirty = false;

    //=========================================================================
    // private methods.
    //=========================================================================
    void Rebuild();
    bool ReloadShader(const char* path, const char* shaderModel, std::vector<uint8_t>& result);
};


} // namespace asdx
