//-----------------------------------------------------------------------------
// File : asdxTextureManager.h
// Desc : Texture Manager.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <unordered_map>
#include <fnd/asdxSpinLock.h>
#include <gfx/asdxTexture.h>
#include <gfx/asdxCommandList.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// TextureManager class
///////////////////////////////////////////////////////////////////////////////
class TextureManager
{
    //=========================================================================
    // list of friend classe and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static TextureManager& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init();

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを生成または取得します.
    //! 
    //! @param[in]      path        ファイルパス(フルパス).
    //! @return     テクスチャを返却します.
    //!             テクスチャが生成または取得に失敗した場合は nullptr を返却します.
    //! @note       pathには，SearchFilePath()を実行済みの値を渡してください.
    //-------------------------------------------------------------------------
    const Texture* GetOrCreate(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを削除します.
    //! 
    //! @param[in]      path        ファイルパス(フルパス).
    //! @note       pathには，SearchFilePath()を実行済みの値を渡してください.
    //-------------------------------------------------------------------------
    void Remove(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを削除します.
    //! 
    //! @param[in]      hash        ファイルハッシュ.
    //! @note       GetOrCreate() で渡したファイル名から作成されるハッシュ値を渡してください.
    //-------------------------------------------------------------------------
    void Remove(uint64_t hash);

    //-------------------------------------------------------------------------
    //! @brief      コマンドリストを入れ替えます.
    //! 
    //! @return     アップデートコマンドが登録されているコマンドリストを返却します.
    //-------------------------------------------------------------------------
    ID3D12GraphicsCommandList* Swap();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static TextureManager                   s_Instance;
    SpinLock                                m_SpinLock;
    std::unordered_map<uint64_t, Texture*>  m_Textures;
    RefPtr<ID3D12GraphicsCommandList>       m_CmdList[2];
    RefPtr<ID3D12CommandAllocator>          m_CmdAllocator[2];
    uint8_t                                 m_BufferIndex = 0;
    bool                                    m_Initialized = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    TextureManager();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~TextureManager();

    TextureManager              (const TextureManager&) = delete;
    TextureManager& operator =  (const TextureManager&) = delete;
};

} // namespace asdx
