//-----------------------------------------------------------------------------
// File : asdxPipelineState.h
// Desc : Pipeline State.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <string>
#include <fnd/asdxRef.h>


#if defined(DEBUG) || defined(_DEBUG)
#define D3DCOMPILE_DEBUG 1      // デバッグ情報がシェーダー BLOB に出力されるようする.
#endif//defined(DEBUG) || defined(_DEBUG)


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MESH_SAHDER_PIPELINE_STATE_DESC structure
///////////////////////////////////////////////////////////////////////////////
struct MESH_SHADER_PIPELINE_STATE_DESC
{
    ID3D12RootSignature*        pRootSignature;         //!< ルートシグニチャ.
    D3D12_SHADER_BYTECODE       AS;                     //!< 増幅シェーダ.
    D3D12_SHADER_BYTECODE       MS;                     //!< メッシュシェーダ.
    D3D12_SHADER_BYTECODE       PS;                     //!< ピクセルシェーダ.
    D3D12_BLEND_DESC            BlendState;             //!< ブレンドステート.
    UINT                        SampleMask;             //!< サンプルマスク.
    D3D12_RASTERIZER_DESC       RasterizerState;        //!< ラスタライザーステート.
    D3D12_DEPTH_STENCIL_DESC    DepthStencilState;      //!< 深度ステンシルステート.
    D3D12_RT_FORMAT_ARRAY       RTVFormats;             //!< レンダーターゲットフォーマット.
    DXGI_FORMAT                 DSVFormat;              //!< 深度ステンシルビューフォーマット.
    DXGI_SAMPLE_DESC            SampleDesc;             //!< サンプル設定.
    UINT                        NodeMask;               //!< ノードマスク.
    D3D12_CACHED_PIPELINE_STATE CachedPSO;              //!< キャッシュ済みPSO.
    D3D12_PIPELINE_STATE_FLAGS  Flags;                  //!< フラグ.
};


///////////////////////////////////////////////////////////////////////////////
// RAYTRACING_PIPELINE_STATE_DESC structure
///////////////////////////////////////////////////////////////////////////////
struct RAYTRACING_PIPELINE_STATE_DESC
{
    ID3D12RootSignature*                pRootSignature;     //!< ルートシグニチャ.
    D3D12_SHADER_BYTECODE               Shader;             //!< シェーダコード.
    std::wstring                        RayGeneration;      //!< レイ生成の関数名.
    std::vector<D3D12_HIT_GROUP_DESC>   HitGroups;          //!< ヒットグループ.
    std::vector<std::wstring>           MissTables;         //!< ミステーブル.
    uint32_t                            MaxPayloadSize;     //!< ペイロードサイズの最大値.
    uint32_t                            MaxAttributeSize;   //!< アトリビュートサイズの最大値.
    uint32_t                            MaxTraceDepth;      //!< 最大トレース深度.
};


///////////////////////////////////////////////////////////////////////////////
// ShaderInfo structure
///////////////////////////////////////////////////////////////////////////////
struct ShaderInfo
{
    std::string             Path;       //!< ファイルパス.
    std::vector<uint8_t>    Blob;       //!< シェーダバイナリ.
};

///////////////////////////////////////////////////////////////////////////////
// GraphicsPipelineState class
///////////////////////////////////////////////////////////////////////////////
class GraphicsPipelineState
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    GraphicsPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~GraphicsPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      desc        構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const D3D12_GRAPHICS_PIPELINE_STATE_DESC* desc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //-------------------------------------------------------------------------
    void SetState(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      頂点シェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathVS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      ピクセルシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathPS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      ハルシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathHS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      ドメインシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathDS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      ジオメトリシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathGS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      リロード時の処理です.
    //! 
    //! @param[in]      fullPath    変更ファイルのフルパス.
    //-------------------------------------------------------------------------
    void OnReload(const std::string& fullPath);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12PipelineState>         m_State;
    D3D12_GRAPHICS_PIPELINE_STATE_DESC  m_Desc;
    RefPtr<ID3D12PipelineState>         m_ReloadState;
    ShaderInfo                          m_VS;
    ShaderInfo                          m_PS;
    ShaderInfo                          m_HS;
    ShaderInfo                          m_DS;
    ShaderInfo                          m_GS;
    bool                                m_Dirty = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief
    //-------------------------------------------------------------------------
    void Recreate();
};

///////////////////////////////////////////////////////////////////////////////
// ComputePipelineState class
///////////////////////////////////////////////////////////////////////////////
class ComputePipelineState
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ComputePipelineState();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ComputePipelineState();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理です.
    //! 
    //! @param[in]      desc        構成設定.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const D3D12_COMPUTE_PIPELINE_STATE_DESC* desc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //-------------------------------------------------------------------------
    void SetState(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      コンピュートシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathCS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      リロード時の処理です.
    //! 
    //! @param[in]      fullPath    変更ファイルのフルパス.
    //-------------------------------------------------------------------------
    void OnReload(const std::string& fullPath);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12PipelineState>         m_State;
    D3D12_COMPUTE_PIPELINE_STATE_DESC   m_Desc;
    RefPtr<ID3D12PipelineState>         m_ReloadState;
    ShaderInfo                          m_CS;
    bool                                m_Dirty = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief
    //-------------------------------------------------------------------------
    void Recreate();
};

///////////////////////////////////////////////////////////////////////////////
// MeshShaderPipelineState class
///////////////////////////////////////////////////////////////////////////////
class MeshShaderPipelineState
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MeshShaderPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MeshShaderPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理です.
    //! 
    //! @param[in]      desc        構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const MESH_SHADER_PIPELINE_STATE_DESC* desc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //-------------------------------------------------------------------------
    void SetState(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      増幅シェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathAS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      メッシュシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPathMS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      ピクセルシェーダのリロードファイルパスを設定します.
    //! 
    //! @param[in]      value       設定するパス.
    //-------------------------------------------------------------------------
    void SetRelaodPathPS(const std::string& value);

    //-------------------------------------------------------------------------
    //! @brief      リロード時の処理です.
    //! 
    //! @param[in]      fullPath    変更ファイルのフルパス.
    //-------------------------------------------------------------------------
    void OnReload(const std::string& fullPath);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12PipelineState>     m_State;
    MESH_SHADER_PIPELINE_STATE_DESC m_Desc;
    RefPtr<ID3D12PipelineState>     m_ReloadState;
    ShaderInfo                      m_AS;
    ShaderInfo                      m_MS;
    ShaderInfo                      m_PS;
    bool                            m_Dirty = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      再生成処理です.
    //-------------------------------------------------------------------------
    void Recreate();
};

///////////////////////////////////////////////////////////////////////////////
// RayTracingPipelineState class
///////////////////////////////////////////////////////////////////////////////
class RayTracingPipelineState
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    RayTracingPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~RayTracingPipelineState();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      desc        構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const RAYTRACING_PIPELINE_STATE_DESC& desc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      レイトレーシングパイプラインを起動します.
    //! 
    //! @param[in]      pCmd        グラフィクスコマンドリストです.
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //-------------------------------------------------------------------------
    void DispatchRays(
        ID3D12GraphicsCommandList4* pCmd,
        uint32_t width,
        uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      DXILライブラリのリロードファイルパスを設定します.
    //! 
    //! @param[in]      path        設定するパス.
    //-------------------------------------------------------------------------
    void SetReloadPath(const std::string& path);

    //-------------------------------------------------------------------------
    //! @brief      リロード時の処理です.
    //! 
    //! @param[in]      fullPath        変更がファイルのフルパス.
    //-------------------------------------------------------------------------
    void OnReload(const std::string& fullPath);

private:
    ///////////////////////////////////////////////////////////////////////////
    // State structure
    ///////////////////////////////////////////////////////////////////////////
    struct State
    {
        RefPtr<ID3D12StateObject>           Object;
        RefPtr<ID3D12StateObjectProperties> Props;
        RefPtr<ID3D12Resource>              RayGenTable;
        RefPtr<ID3D12Resource>              MissTable;
        RefPtr<ID3D12Resource>              HitGroupTable;

        void Reset();

        bool IsValid() const;
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    State                           m_State;
    State                           m_ReloadState;
    RAYTRACING_PIPELINE_STATE_DESC  m_Desc;
    ShaderInfo                      m_Lib;
    bool                            m_Dirty = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      再生成処理です.
    //-------------------------------------------------------------------------
    void Recreate();
};


bool InitPipelineStateWatcher(const char* directory, const std::vector<std::string>& includes);
void TermPipelineStateWatcher();

void InitRangeAsSRV(D3D12_DESCRIPTOR_RANGE& range, UINT registerIndex, UINT count = 1, UINT registerSpace = 0);
void InitRangeAsUAV(D3D12_DESCRIPTOR_RANGE& range, UINT registerIndex, UINT count = 1, UINT registerSpace = 0);
void InitAsConstants(D3D12_ROOT_PARAMETER& param, UINT registerIndex, UINT count, D3D12_SHADER_VISIBILITY visibility, UINT registerSpace = 0);
void InitAsCBV(D3D12_ROOT_PARAMETER& param, UINT registerIndex, D3D12_SHADER_VISIBILITY visibility, UINT registerSpace = 0);
void InitAsSRV(D3D12_ROOT_PARAMETER& param, UINT registerIndex, D3D12_SHADER_VISIBILITY visibility, UINT registerSpace = 0);
void InitAsUAV(D3D12_ROOT_PARAMETER& param, UINT registerIndex, D3D12_SHADER_VISIBILITY visibility, UINT registerSpace = 0);
void InitAsTable(D3D12_ROOT_PARAMETER& param, UINT count, const D3D12_DESCRIPTOR_RANGE* range, D3D12_SHADER_VISIBILITY visiblity);
bool InitRootSignature(ID3D12Device* pDevice, const D3D12_ROOT_SIGNATURE_DESC* pDesc, ID3D12RootSignature** ppRootSig);

} // namespace asdx
