//-----------------------------------------------------------------------------
// File : asdxCommandList.h
// Desc : Command List Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cassert>
#include <d3d12.h>
#include <fnd/asdxRef.h>


#if ASDX_AUTO_LINK
//----------------------------------------------------------------------------
// Linker
//----------------------------------------------------------------------------
#if defined(DEBUG) || defined(_DEBUG)
    #pragma comment(lib, "../external/PixEvents/output/Debug/x64/WinPixEventRuntime.lib")
#else
    #pragma comment(lib, "../external/PixEvents/output/Release/x64/WinPixEventRuntime.lib")
#endif
#endif//ASDX_AUTO_LINK


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// CommandList class
///////////////////////////////////////////////////////////////////////////////
class CommandList
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    CommandList();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~CommandList();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pDevice             デバイスです.
    //! @param[in]      type                コマンドリストタイプです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ID3D12Device* pDevice, D3D12_COMMAND_LIST_TYPE type);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      コマンドリストをリセットします.
    //-------------------------------------------------------------------------
    ID3D12GraphicsCommandList6* Reset();

    //-------------------------------------------------------------------------
    //! @brief      アロケータを取得します.
    //!
    //! @param[in]      index       バッファ番号です.
    //! @return     コマンドアロケータを返却します.
    //-------------------------------------------------------------------------
    ID3D12CommandAllocator* GetD3D12CommandAllocator(uint8_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      グラフィックスコマンドリストを取得します.
    //!
    //! @return     グラフィックスコマンドリストを返却します.
    //-------------------------------------------------------------------------
    ID3D12GraphicsCommandList6* GetD3D12CommandList() const;

    //-------------------------------------------------------------------------
    //! @brief      現在のバッファ番号を返却します.
    //-------------------------------------------------------------------------
    uint8_t GetIndex() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR name);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12CommandAllocator>      m_Allocator[2];         //!< アロケータです.
    RefPtr<ID3D12GraphicsCommandList6>  m_CmdList;              //!< コマンドリストです.
    uint8_t                             m_Index;                //!< バッファ番号です.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// ScopedMarker class
///////////////////////////////////////////////////////////////////////////////
class ScopedMarker
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ScopedMarker(ID3D12GraphicsCommandList* pCmd, const char* text);

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ScopedMarker();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    ID3D12GraphicsCommandList* m_pCmd = nullptr;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

//-----------------------------------------------------------------------------
//! @brief      UAVバリアを設定します.
//! 
//! @param[in]      barrier     バリアです
//! @param[in]      pResource   リソースです.
//-----------------------------------------------------------------------------
void SetUAVBarrier(D3D12_RESOURCE_BARRIER& barrier, ID3D12Resource* pResource);

//-----------------------------------------------------------------------------
//! @brief      UAVバリアを発行します.
//! 
//! @param[in]      pCmd        コマンドリストです.
//! @param[in]      pResource   リソースです.
//-----------------------------------------------------------------------------
void UAVBarrier(ID3D12GraphicsCommandList* pCmd, ID3D12Resource* pResource);

//-----------------------------------------------------------------------------
//! @brief      遷移バリアを設定します.
//!
//! @param[in]      barrier     バリアです.
//! @param[in]      pResource   リソースです.
//! @param[in]      before      遷移前のリソースステートです.
//! @param[in]      after       遷移後のリソースステートです.
//-----------------------------------------------------------------------------
void SetTransitionBarrier(
    D3D12_RESOURCE_BARRIER& barrier,
    ID3D12Resource*         pResource,
    D3D12_RESOURCE_STATES   before,
    D3D12_RESOURCE_STATES   after);

//-----------------------------------------------------------------------------
//! @brief      遷移バリアを発行します.
//! 
//! @param[in]      pCmd        コマンドリストです.
//! @param[in]      pResource   リソースです.
//! @param[in]      before      遷移前のリソースステートです.
//! @param[in]      after       遷移後のリソースステートです.
//-----------------------------------------------------------------------------
void TransitionBarrier(
    ID3D12GraphicsCommandList*  pCmd,
    ID3D12Resource*             pResource,
    D3D12_RESOURCE_STATES       before,
    D3D12_RESOURCE_STATES       after);

//-----------------------------------------------------------------------------
//! @brief      エイリアシングバリアを設定します.
//! 
//! @param[in]      barrier     バリアです.
//! @param[in]      pBefore     遷移前のリソースです.
//! @param[in]      pAfter      遷移後のリソースです.
//-----------------------------------------------------------------------------
void SetAliasBarrier(
    D3D12_RESOURCE_BARRIER& barrier,
    ID3D12Resource*         pBefore,
    ID3D12Resource*         pAfter);

//-----------------------------------------------------------------------------
//! @brief      エイリアシングバリアを設定します.
//! 
//! @param[in]      pCmd        コマンドリストです.
//! @param[in]      pBefore     遷移前のリソースです.
//! @param[in]      pAfter      遷移後のリソースです.
//-----------------------------------------------------------------------------
void AliasBarrier(
    ID3D12GraphicsCommandList*  pCmd,
    ID3D12Resource*             pBefore,
    ID3D12Resource*             pAfter);

} // namespace asdx
