//-----------------------------------------------------------------------------
// File : asdxScopedMarker.h
// Desc : Scoped Marker.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cassert>
#include <d3d12.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ScopedMarker class
///////////////////////////////////////////////////////////////////////////////
class ScopedMarker
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      text        マーカーに表示するテキストです.
    //-------------------------------------------------------------------------
    ScopedMarker(ID3D12GraphicsCommandList* pCmd, const char* text)
    : m_pCmd(pCmd)
    {
        assert(m_pCmd != nullptr);
        assert(text != nullptr);
    #ifdef _PIX3_H_
        PIXBeginEvent(m_pCmd, PIX_COLOR_DEFAULT, text);
    #else
        static const UINT PIX_EVENT_ANSI_VERSION = 1u;
        auto size = UINT((strlen(text) + 1) * sizeof(char));
        m_pCmd->BeginEvent(PIX_EVENT_ANSI_VERSION, text, size);
    #endif
    }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ScopedMarker()
    {
        assert(m_pCmd != nullptr);
    #ifdef _PIX3_H_
        PIXEndEvent(m_pCmd);
    #else
        m_pCmd->EndEvent();
    #endif
        m_pCmd = nullptr;
    }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    ID3D12GraphicsCommandList* m_pCmd = nullptr;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
