//---------------------------------------------------------------------------
// File : asdxStarEffect.h
// Desc : Star(Light Streak) Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <gfx/asdxBuffer.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// STAR_TYPE enum
///////////////////////////////////////////////////////////////////////////////
enum STAR_TYPE
{
    STAR_DISABLE,               //!< 無効.
    STAR_CROSS_SCREEN,          //!< クロスフィルタ.
    STAR_CROSS_SCREEN_SPECTRAL, //!< クロスフィルタ・スペクトル.
    STAR_SNOW_CROSS,            //!< スノークロス.
    STAR_SNOW_CROSS_SPECTRAL,   //!< スノークロス・スペクトル.
    STAR_SUNNY_CROSS,           //!< サニークロス.
    STAR_SUNNY_CROSS_SPECTRAL,  //!< サニークロス・スペクトル.
    STAR_CINEMA_VERTICAL,       //!< シネマ垂直方向.
    STAR_CINEMA_HORIZONTAL,     //!< シネマ水平方向.
};

///////////////////////////////////////////////////////////////////////////////
// StarEffect class
///////////////////////////////////////////////////////////////////////////////
class StarEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    StarEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~StarEffect();
 
    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      type        光芒タイプ.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        STAR_TYPE                   type,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetHandleSRV() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature>     m_RootSignature;        //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState>     m_StarPSO;              //!< パイプラインステート.
    RefPtr<ID3D12PipelineState>     m_CompositePSO;
    ComputeTarget                   m_PingPongTarget[2];
    ComputeTarget                   m_OutputTarget;
    D3D12_RESOURCE_STATES           m_PingPongStates[2];
    D3D12_RESOURCE_STATES           m_OutputStates;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
