//-----------------------------------------------------------------------------
// File : asdxSprite.h
// Desc : Sprite Renderer.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <vector>
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// SpriteRenderer
///////////////////////////////////////////////////////////////////////////////
class SpriteRenderer
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    SpriteRenderer();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~SpriteRenderer();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pDevice         デバイスです.
    //! @param[in]      screenWidth     スクリーンの横幅.
    //! @param[in]      screenHeight    スクリーンの縦幅.
    //! @param[in]      maxSpriteCount  最大スプライト数.
    //! @param[in]      maxBatchCount   最大バッチ数(最大テクスチャの切り替え可能数).
    //! @param[in]      rtvFormat       レンダーターゲットビューのフォーマット.
    //! @param[in]      dsvFroamt       深度ステンシルビューのフォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(
        ID3D12Device*   pDevice,
        uint32_t        screenWidth,
        uint32_t        srceenHeight,
        uint32_t        maxSpriteCount,
        uint32_t        maxBatchCount,
        DXGI_FORMAT     rtvFormat,
        DXGI_FORMAT     dsvFormat);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リセット処理です.
    //! 
    //! @note       フレーム開始時に呼び出してしてください.
    //-------------------------------------------------------------------------
    void Reset();

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを設定します.
    //! 
    //! @param[in]      handleSRV       シェーダリソースビューハンドル.
    //! @param[in]      handleSampler   サンプラーハンドル.
    //! @note       バッチの切り替えが発生します.
    //-------------------------------------------------------------------------
    void SetTexture(D3D12_GPU_DESCRIPTOR_HANDLE handleSRV, D3D12_GPU_DESCRIPTOR_HANDLE handleSampler);

    //-------------------------------------------------------------------------
    //! @brief      カラーを設定します.
    //! 
    //! @param[in]      r       R成分.
    //! @param[in]      g       G成分.
    //! @param[in]      b       B成分.
    //! @param[in]      a       A成分.,
    //-------------------------------------------------------------------------
    void SetColor(float r, float g, float b, float a);

    //-------------------------------------------------------------------------
    //! @brief      カラーを設定します.
    //! 
    //! @param[in]      r       R成分.
    //! @param[in]      g       G成分.
    //! @param[in]      b       B成分.
    //! @param[in]      a       A成分.,
    //-------------------------------------------------------------------------
    void SetColor(uint8_t r, uint8_t g, uint8_t b, uint8_t a);

    //-------------------------------------------------------------------------
    //! @brief      スクリーンサイズを設定します.
    //! 
    //! @note       Draw()時に設定されるため，Add()ごとに設定することはできません.
    //-------------------------------------------------------------------------
    void SetScreenSize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      スプライトを追加します.
    //!
    //! @param[in]      x           描画開始位置Xです.
    //! @param[in]      y           描画開始位置Yです.
    //! @param[in]      w           スプライトの横幅です.
    //! @param[in]      h           スプライトの縦幅です.
    //! @param[in]      layer       レイヤーです(Z座標).
    //! @param[in]      uv0         左上のUV座標です.
    //! @param[in]      uv1         右下のUV座標です.
    //-------------------------------------------------------------------------   
    void Add(int x, int y, int w, int h, int layer, const Vector2& uv0, const Vector2& uv1);

    //-------------------------------------------------------------------------
    //! @brief      スプライトを追加します.
    //!
    //! @param[in]      x           描画開始位置Xです.
    //! @param[in]      y           描画開始位置Yです.
    //! @param[in]      w           スプライトの横幅です.
    //! @param[in]      h           スプライトの縦幅です.
    //-------------------------------------------------------------------------   
    void Add(int x, int y, int w, int h)
    { Add(x, y, w, h, 0, Vector2(0.0f, 1.0f), Vector2(1.0f, 0.0f)); }

    //-------------------------------------------------------------------------
    //! @brief      スプライトを追加します.
    //!
    //! @param[in]      x           描画開始位置Xです.
    //! @param[in]      y           描画開始位置Yです.
    //! @param[in]      w           スプライトの横幅です.
    //! @param[in]      h           スプライトの縦幅です.
    //! @param[in]      layer       レイヤーです(Z座標).
    //-------------------------------------------------------------------------   
    void Add(int x, int y, int w, int h, int layer)
    { Add(x, y, w, h, layer, Vector2(0.0f, 1.0f), Vector2(1.0f, 0.0f)); }

    //-------------------------------------------------------------------------
    //! @brief      スプライトを追加します.
    //!
    //! @param[in]      x           描画開始位置Xです.
    //! @param[in]      y           描画開始位置Yです.
    //! @param[in]      w           スプライトの横幅です.
    //! @param[in]      h           スプライトの縦幅です.
    //! @param[in]      uv0         左上のUV座標です.
    //! @param[in]      uv1         右下のUV座標です.
    //-------------------------------------------------------------------------   
    void Add(int x, int y, int w, int h, const Vector2& uv0, const Vector2& uv1)
    { Add(x, y, w, h, 0, uv0, uv1); }

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmdList        グラフィックスコマンドリストです.
    //! @param[in]      pPipelineState  パイプラインステートです(nullptrの場合はデフォルトのパイプラインステートが設定されます).
    //-------------------------------------------------------------------------
    void SetPipelineState(ID3D12GraphicsCommandList* pCmdList, ID3D12PipelineState* pPipelineState);

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmdList        グラフィックスコマンドリストです.
    //-------------------------------------------------------------------------
    void SetPipelineState(ID3D12GraphicsCommandList* pCmdList)
    { SetPipelineState(pCmdList, nullptr); }

    //-------------------------------------------------------------------------
    //! @brief      描画処理を行います.
    //! 
    //! @param[in]      pCmdList        グラフィックスコマンドリストです.
    //-------------------------------------------------------------------------
    void Draw(ID3D12GraphicsCommandList* pCmdList);

    //-------------------------------------------------------------------------
    //! @brief      スクリーンサイズを取得します.
    //! 
    //! @return     スクリーンサイズを返却します.
    //-------------------------------------------------------------------------
    const Vector2& GetScreenSize() const;

    //-------------------------------------------------------------------------
    //! @brief      カラーを取得します.
    //! 
    //! @return     カラーを返却します.
    //-------------------------------------------------------------------------
    Vector4 GetColor() const;

    //-------------------------------------------------------------------------
    //! @brief      スプライト描画用パイプラインステートを生成します.
    //! 
    //! @param[in]      ps          ピクセルシェーダ
    //! @param[out]     ppResult    パイプラインステートの格納先です.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    bool CreateSpritePipelineState(ID3D12Device* pDevice, const D3D12_SHADER_BYTECODE& ps, ID3D12PipelineState** pResult); 

private:
    ///////////////////////////////////////////////////////////////////////////
    // Unorm4 structure
    ///////////////////////////////////////////////////////////////////////////
    struct Unorm4
    {
        uint8_t R;      //!< 赤.
        uint8_t G;      //!< 緑.
        uint8_t B;      //!< 青.
        uint8_t A;      //!< 透明度.
    };

    ///////////////////////////////////////////////////////////////////////////
    // Vertex structure
    ///////////////////////////////////////////////////////////////////////////
    struct Vertex
    {
        Vector3 Position;   //!< 位置座標.
        Vector2 TexCoord;   //!< テクスチャ座標.
        Unorm4  Color;      //!< 頂点カラー.
    };

    ///////////////////////////////////////////////////////////////////////////
    // Batch structure
    ///////////////////////////////////////////////////////////////////////////
    struct Batch
    {
        uint32_t                    IndexCount;     //!< インデックス数.
        uint32_t                    IndexOffset;    //!< インデックスオフセット.
        D3D12_GPU_DESCRIPTOR_HANDLE SRV;            //!< シェーダリソースビュー.
        D3D12_GPU_DESCRIPTOR_HANDLE Sampler;        //!< サンプラーステート.
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>      m_VB[2];                                            //!< 頂点バッファ.
    RefPtr<ID3D12Resource>      m_IB;                                               //!< インデックスバッファ.
    RefPtr<ID3D12RootSignature> m_RootSig;                                          //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState> m_PSO;                                              //!< パイプラインステート.
    std::vector<Batch>          m_Batches;                                          //!< バッチ.
    Vertex*                     m_pVertices[2]      = {};                           //!< マップ済みメモリ.
    uint32_t                    m_SpriteCount       = 0;                            //!< 描画スプライト数.
    uint32_t                    m_BatchCount        = 0;                            //!< 描画バッチ数.
    uint32_t                    m_SubmitCount       = 0;                            //!< サブミット数.
    uint32_t                    m_MaxSpriteCount    = 0;                            //!< 最大スプライト数.
    uint32_t                    m_MaxBatchCount     = 0;                            //!< 最大バッチ数.
    uint8_t                     m_BufferIndex       = 0;                            //!< バッファインデックス.
    Matrix                      m_Transform         = Matrix::CreateIdentity();     //!< 変換行列.
    Vector2                     m_ScreenSize        = Vector2(0, 0);                //!< スクリーンサイズ.
    Unorm4                      m_Color             = {};                           //!< 頂点カラー.
    D3D12_GPU_DESCRIPTOR_HANDLE m_HandleSRV         = {};                           //!< シェーダリソースビュー.
    D3D12_GPU_DESCRIPTOR_HANDLE m_HandleSampler     = {};                           //!< サンプラー
    DXGI_FORMAT                 m_ColorFormat       = DXGI_FORMAT_UNKNOWN;
    DXGI_FORMAT                 m_DepthFormat       = DXGI_FORMAT_UNKNOWN;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx

