//-----------------------------------------------------------------------------
// File : asdxFxaa.cpp
// Desc : Fast Approximate Anti-Aliasing.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Fxaa class
///////////////////////////////////////////////////////////////////////////////
class Fxaa
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Fxaa();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Fxaa();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      format      レンダーターゲットフォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      FXAAを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      rtvWidth    レンダーターゲットの横幅.
    //! @param[in]      rtvHeight   レンダーターゲットの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Draw(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    rtvWidth,
        uint32_t                    rtvHeight,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      FXAAを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      uavWidth    アンオーダードアクセスビューの横幅.
    //! @param[in]      uavHeight   アンオーダードアクセスビューの縦幅.
    //! @param[in]      haneleUAV   出力アンオーダードアクセスビュー.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    uavWidth,
        uint32_t                    uavHeight,
        D3D12_GPU_DESCRIPTOR_HANDLE handleUAV,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    asdx::RefPtr<ID3D12RootSignature>   m_RootSignature;
    asdx::RefPtr<ID3D12PipelineState>   m_PipelineStatePS;
    asdx::RefPtr<ID3D12PipelineState>   m_PipelineStateCS;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
