//-----------------------------------------------------------------------------
// File : asdxMosaicEffect.h
// Desc : Mosaic Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MosaicEffect class
///////////////////////////////////////////////////////////////////////////////
class MosaicEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MosaicEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MosaicEffect();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      format      レンダーターゲットフォーマットです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      ピクセルシェーダを用いてエフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Draw(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    inputW,
        uint32_t                    inputH,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      コンピュートシェーダを用いてエフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      outputW     出力横幅.
    //! @param[in]      outputH     出力縦幅.
    //! @param[in]      handleUAV   出力アンオーダードアクセスビュー.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    outputW,
        uint32_t                    outputH,
        D3D12_GPU_DESCRIPTOR_HANDLE handleUAV,
        uint32_t                    inputW,
        uint32_t                    inputH,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      制御パラメータを設定します.
    //! 
    //! @param[in]      value       設定するパラメータ[0, 1].
    //! @note       0に近づくにつれてモザイクが大きくなります.
    //-------------------------------------------------------------------------
    void SetScale(float value);

    //-------------------------------------------------------------------------
    //! @brief      制御パラメータを取得します.
    //! 
    //! @return     制御パラメータを返却します.
    //-------------------------------------------------------------------------
    float GetScale() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature> m_RootSignature;
    RefPtr<ID3D12PipelineState> m_GraphicsPSO;
    RefPtr<ID3D12PipelineState> m_ComputePSO;
    float                       m_Scale = 1.0f;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
