//---------------------------------------------------------------------------
// File : asdxStarEffect.h
// Desc : Star(Light Streak) Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <gfx/asdxBuffer.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// StarEffect class
///////////////////////////////////////////////////////////////////////////////
class StarEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////////
    // FILTER_TYPE enum
    ///////////////////////////////////////////////////////////////////////////////
    enum FILTER_TYPE
    {
        NONE,                       //!< 無効.
        CROSS,                      //!< 4本.
        CROSS_SPECTRAL,             //!< 4本(スペクトル).
        SNOW_CROSS,                 //!< 6本.
        SNOW_CROSS_SPECTRAL,        //!< 6本(スペクトル).
        SUNNY_CROSS,                //!< 8本.
        SUNNY_CROSS_SPECTRAL,       //!< 8本(スペクトル).
        TWINKLE_STAR,               //!< 短め4本
        TWINKLE_STAR_SPECTRAL,      //!< 短め4本(スペクトル).
        TWINKLE_STAR6X,             //!< 短め6本.
        TWINKLE_STAR6X_SPECTRAL,    //!< 短め6本(スペクトル).
        TWINKLE_STAR8X,             //!< 短め8本.
        TWINKLE_STAR8X_SPECTRAL,    //!< 短め8本(スペクトル).
        NATURAL_CROSS,              //!< 4本・効果弱.
        NATURAL_CROSS_SPECTRAL,     //!< 4本・効果弱(スペクトル).
        ANAMORFLARE_RED,            //!< アナモルフィックフレア・赤.
        ANAMORFLARE_YELLOW,         //!< アナモルフィックフレア・黄.
        ANAMORFLARE_GREEN,          //!< アナモルフィックフレア・緑.
        ANAMORFLARE_BLUE,           //!< アナモルフィックフレア・青.
        ANAMORFLARE_CLEAR,          //!< アナモルフィックフレア・無色.
        ANAMORFLARE_RAINBOW,        //!< アナモルフィックフレア・虹.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    StarEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~StarEffect();
 
    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      ブルーム適用結果を合成します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void CompositeBloom(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      クロスフィルタタイプを設定します.
    //! 
    //! @param[in]      type        設定する値.
    //-------------------------------------------------------------------------
    void SetType(FILTER_TYPE type);

    //-------------------------------------------------------------------------
    //! @brief      クロスフィルタタイプを取得します.
    //! 
    //! @return     クロスフィルタタイプを返却します.
    //-------------------------------------------------------------------------
    FILTER_TYPE GetType() const;

    //-------------------------------------------------------------------------
    //! @brief      閾値を設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void SetThreshold(float value);

    //-------------------------------------------------------------------------
    //! @brief      閾値を取得します.
    //! 
    //! @return     閾値を返却します.
    //-------------------------------------------------------------------------
    float GetThreshold() const;

    //-------------------------------------------------------------------------
    //! @brief      露出値を設定します.
    //! 
    //! @param[in]      value       設定する露出値.
    //-------------------------------------------------------------------------
    void SetExposure(float value);

    //-------------------------------------------------------------------------
    //! @brief      露出値を取得します.
    //! 
    //! @return     露出値を返却します.
    //-------------------------------------------------------------------------
    float GetExposure() const;

    //-------------------------------------------------------------------------
    //! @brief      回転角を設定します.
    //! 
    //! @param[in]      rad     設定する回転角(単位:ラジアン)
    //-------------------------------------------------------------------------
    void SetAngle(float rad);

    //-------------------------------------------------------------------------
    //! @brief      回転角を取得します.
    //! 
    //! @return     回転角を返却します.
    //-------------------------------------------------------------------------
    float GetAngle() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature>     m_RootSignature;                            //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState>     m_FirstPassPSO;                             //!< 初期用パイプラインステートです.
    RefPtr<ID3D12PipelineState>     m_StarPSO;                                  //!< 光芒用パイプラインステートです.
    RefPtr<ID3D12PipelineState>     m_CompositePSO;                             //!< 合成用パイプラインステートです.
    ComputeTarget                   m_PingPongTarget[2];                        //!< ピンポンターゲット.
    ComputeTarget                   m_InputTarget;                              //!< 入力ターゲット.
    ComputeTarget                   m_OutputTarget;                             //!< 出力ターゲット.
    D3D12_RESOURCE_STATES           m_PingPongStates[2] = {};                   //!< ピンポンターゲット用リソースステート.
    D3D12_RESOURCE_STATES           m_InputStates       = {};                   //!< 入力ターゲット用リソースステート.
    D3D12_RESOURCE_STATES           m_OutputStates      = {};                   //!< 出力ターゲット用リソースステート.
    FILTER_TYPE                     m_Type              = FILTER_TYPE::NONE;    //!< 光芒タイプ.
    float                           m_Threshold         = 1.0f;                 //!< 閾値.
    float                           m_Exposure          = 1.0f;                 //!< 露出値.
    float                           m_Angle             = 0.0f;                 //!< 回転角.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
