//-----------------------------------------------------------------------------
// File : asdxFade.h
// Desc : Fade.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Include
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>
#include <gfx/asdxTexture.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Fade class
///////////////////////////////////////////////////////////////////////////////
class Fade
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static Fade& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      rtvFormat   レンダーターゲットフォーマットです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ID3D12GraphicsCommandList* pCmd, DXGI_FORMAT rtvFormat);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      更新処理を行います.
    //! 
    //! @param[in]      deltaSec    差分時間(秒)です.
    //-------------------------------------------------------------------------
    void Update(float deltaSec);

    //-------------------------------------------------------------------------
    //! @brief      描画処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      handleSRV   テクスチャハンドルです.
    //-------------------------------------------------------------------------
    void Draw(ID3D12GraphicsCommandList* pCmd, D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      描画処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //-------------------------------------------------------------------------
    void Draw(ID3D12GraphicsCommandList* pCmd);

    //-------------------------------------------------------------------------
    //! @brief      フェード処理を設定します.
    //! 
    //! @param[in]      color           目標カラー.
    //! @param[in]      alpha           目標アルファ値.
    //! @param[in]      durationSec     遷移完了までの時間(単位：秒).
    //-------------------------------------------------------------------------
    void FadeTo(const Vector3& color, float alpha, float durationSec);

    //-------------------------------------------------------------------------
    //! @brief      フェード処理を設定します.
    //! 
    //! @param[in]      srcColor        開始カラー.
    //! @param[in]      dstColor        目標カラー.
    //! @param[in]      srcAlpha        開始アルファ値.
    //! @param[in]      dstAlpha        目標アルファ値.
    //! @param[in]      durationSec     遷移完了までの時間(単位：秒).
    //-------------------------------------------------------------------------
    void FadeTo(
        const Vector3& srcColor,
        const Vector3& dstColor,
        float          srcAlpha,
        float          dstAlpha,
        float          durationSec);

    //-------------------------------------------------------------------------
    //! @brief      フェードインします.
    //! 
    //! @param[in]      durationSec     遷移完了までの時間(単位:秒).
    //-------------------------------------------------------------------------
    void FadeIn(float durationSec);

    //-------------------------------------------------------------------------
    //! @brief      フェードアウトします.
    //! 
    //! @param[in]      durationSec     遷移完了までの時間(単位:秒).
    //-------------------------------------------------------------------------
    void FadeOut(float duerationSec);

    //-------------------------------------------------------------------------
    //! @brief      フェードインします.
    //! 
    //! @param[in]      color           目標カラー.
    //! @param[in]      durationSec     遷移完了までの時間(単位:秒).
    //-------------------------------------------------------------------------
    void FadeIn(const Vector3& color, float durationSec);

    //-------------------------------------------------------------------------
    //! @brief      フェードアウトします.
    //! 
    //! @param[in]      color           目標カラー.
    //! @param[in]      durationSec     遷移完了までの時間(単位:秒).
    //-------------------------------------------------------------------------
    void FadeOut(const Vector3& color, float durationSec);

    //-------------------------------------------------------------------------
    //! @brief      画面を明滅させます.
    //! 
    //! @param[in]      color           目標カラー.
    //! @param[in]      durationSec     明滅完了までの時間(単位:秒).
    //-------------------------------------------------------------------------
    void Flash(const Vector3& color, float durationSec);

    //-------------------------------------------------------------------------
    //! @brief      完了済みかどうかチェックします.
    //! 
    //! @retval true    完了済みです.
    //! @retval false   未完了です.
    //-------------------------------------------------------------------------
    bool IsComplete() const;

    //-------------------------------------------------------------------------
    //! @brief      遷移完了までの時間(単位：秒)を取得します.
    //! 
    //! @return     遷移完了までの時間(単位：秒)を返却します.
    //-------------------------------------------------------------------------
    float GetDurationSec() const;

    //-------------------------------------------------------------------------
    //! @brief      経過時間(単位：秒)を取得します.
    //! 
    //! @return     経過時間(単位：秒)を返却します.
    //-------------------------------------------------------------------------
    float GetElapsedSec() const;

    //-------------------------------------------------------------------------
    //! @brief      開始カラーを取得します.
    //! 
    //! @return     開始カラーを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetStartColor() const;

    //-------------------------------------------------------------------------
    //! @brief      目標カラーを取得します.
    //! 
    //! @return     目標カラーを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetTargetColor() const;

    //-------------------------------------------------------------------------
    //! @brief      現在カラーを取得します.
    //! 
    //! @return     現在カラーを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetCurrentColor() const;

    //-------------------------------------------------------------------------
    //! @brief      開始アルファ値を取得します.
    //! 
    //! @return     開始アルファ値を返却します.
    //-------------------------------------------------------------------------
    float GetStartAlpha() const;

    //-------------------------------------------------------------------------
    //! @brief      目標アルファ値を取得します.
    //! 
    //! @return     目標アルファ値を返却します.
    //-------------------------------------------------------------------------
    float GetTargetAlpha() const;

    //-------------------------------------------------------------------------
    //! @brief      現在アルファ値を取得します.
    //! 
    //! @return     現在アルファ値を返却します.
    //-------------------------------------------------------------------------
    float GetCurrentAlpha() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static Fade                 s_Instance;         //!< シングルトンインスタンスです.
    RefPtr<ID3D12RootSignature> m_RootSig;          //!< ルートシグニチャです.
    RefPtr<ID3D12PipelineState> m_PipelineState;    //!< パイプラインステートです.
    Texture*                    m_WhiteTexture;     //!< テクスチャ.

    Vector3 m_StartColor   = Vector3(0.0f, 0.0f, 0.0f); //!< 開始カラー.
    Vector3 m_TargetColor  = Vector3(0.0f, 0.0f, 0.0f); //!< 目標カラー.
    Vector3 m_CurrentColor = Vector3(0.0f, 0.0f, 0.0f); //!< 現在カラー.
    float   m_StartAlpha   = 0.0f;                      //!< 開始アルファ.
    float   m_TargetAlpha  = 0.0f;                      //!< 目標アルファ.
    float   m_CurrentAlpha = 0.0f;                      //!< 現在アルファ.
    float   m_ElapsedSec   = 0.0f;                      //!< 経過時間.
    float   m_DurationSec  = 1.0f;                      //!< 遷移時間.
    bool    m_Complete     = false;                     //!< 完了フラグ.

    //========================================================================
    // private methods.
    //========================================================================

    //------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //------------------------------------------------------------------------
    Fade();

    //------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //------------------------------------------------------------------------
    ~Fade();

    Fade             (const Fade&) = delete;
    Fade& operator = (const Fade&) = delete;
};

} // namespace asdx
