//-----------------------------------------------------------------------------
// File : asdxMaterial.h
// Desc : Material.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <gfx/asdxBuffer.h>
#include <gfx/asdxTextureManager.h>
#include <res/asdxResMaterial.h>
#include <fnd/asdxLogger.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Material class
///////////////////////////////////////////////////////////////////////////////
class Material : public IReference
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを生成.
    //! 
    //! @param[in]      binary      マテリアルバイナリ.
    //! @param[out]     ppMaterial  マテリアルの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    template<typename T>
    static bool Create(std::vector<uint8_t>&& binary, T** ppMaterial)
    {
        // Materialから派生していることを確認.
        static_assert(std::is_base_of<Material, T>::value, "T must derive from Material");

        // インスタンス生成.
        auto instance = new (std::nothrow) T();
        if (instance == nullptr)
        {
            ELOG("Error : Out of memory");
            return false;
        }

        // インスタンス初期化.
        if (!instance->Init(std::move(binary)))
        {
            ELOG("Error : Material::Init() Failed.");
            instance->Release();
            instance = nullptr;
            return false;
        }

        // インスタンスを格納.
        (*ppMaterial) = instance;

        // 正常終了.
        return true;
    }

    //-------------------------------------------------------------------------
    //! @brief      参照カウントを増やします.
    //-------------------------------------------------------------------------
    void AddRef() override;

    //-------------------------------------------------------------------------
    //! @brief      解放処理を行います.
    //-------------------------------------------------------------------------
    void Release() override;

    //-------------------------------------------------------------------------
    //! @brief      参照カウントを取得します.
    //! 
    //! @return     参照カウントを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetRefCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル種別を取得します.
    //! 
    //! @return     マテリアル種別を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetKind() const;

    //-------------------------------------------------------------------------
    //! @brief      ブレンドステートを取得します.
    //! 
    //! @return     ブレンドステートを返却します.
    //-------------------------------------------------------------------------
    MaterialBlendState GetBlendState() const;

    //-------------------------------------------------------------------------
    //! @brief      深度ステートを取得します.
    //! 
    //! @return     深度ステートを返却します.
    //-------------------------------------------------------------------------
    MaterialDepthState GetDepthState() const;

    //-------------------------------------------------------------------------
    //! @brief      ラスタライザーステートを取得します.
    //! 
    //! @return     ラスタライザーステートを返却します.
    //-------------------------------------------------------------------------
    MaterialRasterizerState GetRasterizerState() const;

    //-------------------------------------------------------------------------
    //! @brief      定数バッファを取得します.
    //! 
    //! @return     定数バッファを返却します.
    //-------------------------------------------------------------------------
    ConstantBuffer& GetBuffer();

    //-------------------------------------------------------------------------
    //! @brief      定数バッファを取得します.
    //! 
    //! @return     定数バッファを返却します.
    //-------------------------------------------------------------------------
    const ConstantBuffer& GetBuffer() const;

    //-------------------------------------------------------------------------
    //! @brief      定数バッファのGPU仮想アドレスを取得します.
    //! 
    //! @return     定数バッファのGPU仮想アドレスを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_VIRTUAL_ADDRESS GetGpuAddress() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ数を取得します.
    //! 
    //! @return     テクスチャ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTextureCount() const;

    //-------------------------------------------------------------------------
    //! @brief      SRVのCPUディスクリプタハンドルを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     SRVのCPUディスクリプタハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetHandleCPU(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      SRVのGPUディスクリプタハンドルを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     SRVのGPUディスクリプタハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetHandleGPU(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      SRVのバインドレスインデックスを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     SRVのバインドレスインデックスを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetBindlessIndex(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      適用処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //-------------------------------------------------------------------------
    virtual void Apply(ID3D12GraphicsCommandList* pCmd);

protected:
    //=========================================================================
    // protected variables.
    //=========================================================================
    ConstantBuffer              m_Buffer            = {};   //!< 定数バッファ.
    std::vector<TextureHolder>  m_Textures          = {};   //!< テクスチャリスト.

    //=========================================================================
    // protected methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Material();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~Material();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      binary      マテリアルバイナリ.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(std::vector<uint8_t>&& binary);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      マテリアル初期化時の処理です.
    //! 
    //! @param[in]      binary      マテリアルバイナリ.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //! @note       主にバッファの初期化と，テクスチャの初期化をカスタマイズする用途で使用してください.
    //-------------------------------------------------------------------------
    virtual bool OnInit(const MaterialBinary& binary);

private:
    //=========================================================================
    // private variables;
    //=========================================================================
    std::atomic<uint32_t>       m_RefCount          = {};   //!< 参照カウントです.
    uint32_t                    m_Kind              = 0;    //!< マテリアル種別.
    MaterialBlendState          m_BlendState        = {};   //!< ブレンドステート.
    MaterialDepthState          m_DepthState        = {};   //!< 深度ステート.
    MaterialRasterizerState     m_RasterizerState   = {};   //!< ラスタライザーステート.

    //=========================================================================
    // private methods.
    //=========================================================================
    Material             (const Material&) = delete;
    Material& operator = (const Material&) = delete;
};

} // namespace asdx
