//-----------------------------------------------------------------------------
// File : asdxMovie.h
// Desc : Movie Stream
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <fnd/asdxRef.h>
#include <gfx/asdxDescriptorHolder.h>


#if ASDX_AUTO_LINK
//-----------------------------------------------------------------------------
// Linker.
//-----------------------------------------------------------------------------
#pragma comment(lib, "Mfplat.lib")
#pragma comment(lib, "Mfreadwrite.lib")
#pragma comment(lib, "mfuuid.lib")
#pragma comment(lib, "Propsys.lib")
#endif//ASDX_AUTO_LINK


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// IMovieStream interface
///////////////////////////////////////////////////////////////////////////////
struct IMovieStream : public IReference
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IMovieStream() = default;

    //-------------------------------------------------------------------------
    //! @brief      ストリームをオープンします.
    //! 
    //! @param[in]      path        ファイル名です.
    //! @retval true    オープンに成功.
    //! @retval false   オープンに失敗.
    //-------------------------------------------------------------------------
    virtual bool Open(const char* path) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ストリームをクローズします.
    //-------------------------------------------------------------------------
    virtual void Close() = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームシークを行います.
    //! 
    //! @param[in]      time        進める時間(単位:100ns).
    //! @retval true    シークに成功.
    //! @retval false   シークに失敗.
    //-------------------------------------------------------------------------
    virtual bool Seek(int64_t time) = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームデータの読み取りを行います.
    //! 
    //! @param[in]      pDstResource    コピー先テクスチャです.
    //! @param[in]      elapsedSec      前フレームからの経過時間(単位:秒).
    //! @retval true    デコードに成功.
    //! @retval false   デコードに失敗.
    //! @note       NV12を前提したコピー処理が実行されます.
    //-------------------------------------------------------------------------
    virtual bool Read(ID3D12Resource* pDstResource, double elapsedSec) = 0;

    //-------------------------------------------------------------------------
    //! @brief      横幅を取得します.
    //! 
    //! @return     横幅を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetWidth() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      縦幅を取得します.
    //! 
    //! @return     縦幅を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetHeight() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを取得します.
    //! 
    //! @return     フォーマットを返却します.
    //-------------------------------------------------------------------------
    virtual DXGI_FORMAT GetFormat() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      フレームレートを取得します.
    //! 
    //! @return     フレームレートを返却します(単位:FPS).
    //-------------------------------------------------------------------------
    virtual double GetFrameRate() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム時間を取得します.
    //! 
    //! @return     総フレーム時間を返却します.
    //-------------------------------------------------------------------------
    virtual double GetDurationSec() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム数を取得します.
    //! 
    //! @return     総フレーム数を返却します.
    //-------------------------------------------------------------------------
    virtual uint64_t GetFrameCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      現在のフレーム番号を取得します.
    //! 
    //! @return     現在のフレーム番号を返却します.
    //-------------------------------------------------------------------------
    virtual uint64_t GetFrameIndex() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      再生の一時停止を設定します.
    //! 
    //! @param[in]      pause       一時停止する場合は true を指定.
    //-------------------------------------------------------------------------
    virtual void SetPause(bool puase) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定を行います.
    //! 
    //! @param[in]      loop        ループ再生を行う場合は true を指定.
    //! @note       ループ再生を有効にした場合は, IsFinished() メソッドは true を返さなくなるので注意してください.
    //-------------------------------------------------------------------------
    virtual void SetLoop(bool loop) = 0;

    //-------------------------------------------------------------------------
    //! @brief      一時停止中かどうかチェックします.
    //! 
    //! @retval true    一時停止中です.
    //! @retval false   再生中です.
    //-------------------------------------------------------------------------
    virtual bool IsPause() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定かどうかチェックします.
    //! 
    //! @retval true    ループ再生です.
    //! @retval false   非ループ再生です.
    //-------------------------------------------------------------------------
    virtual bool IsLoop() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      再生が終了したかどうかチェックします.
    //! 
    //! @retval true    完了状態です.
    //! @retval false   未完了状態です.
    //! @note       ループ再生設定が行われている場合，この関数は常に false を返却します.
    //-------------------------------------------------------------------------
    virtual bool IsFinished() const = 0;
};

///////////////////////////////////////////////////////////////////////////////
// MovieTexture class
///////////////////////////////////////////////////////////////////////////////
class MovieTexture
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MovieTexture();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MovieTexture();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      更新処理を行います.
    //! 
    //! @param[in]      elapsedTimeSec      経過時間(単位:秒).
    //! @return     デコードした場合は true を返却します.
    //-------------------------------------------------------------------------
    bool Update(double elapsedTimeSec);

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します.
    //! 
    //! @param[in]      offset      オフセットです.
    //! @return     CPUディスクリプタハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetHandleCPU(uint32_t offset = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      GPUディスクリプタハンドルを取得します.
    //! 
    //! @param[in]      offset      オフセットです.
    //! @return     GPUディスクリプタハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetHandleGPU(uint32_t offset = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      フレームレートを取得します.
    //! 
    //! @return     フレームレートを返却します(単位:FPS).
    //-------------------------------------------------------------------------
    double GetFrameRate() const;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム時間を取得します.
    //! 
    //! @return     総フレーム時間を返却します.
    //-------------------------------------------------------------------------
    double GetDurationSec() const;

    //-------------------------------------------------------------------------
    //! @brief      総フレーム数を取得します.
    //! 
    //! @return     総フレーム数を返却します.
    //-------------------------------------------------------------------------
    uint64_t GetFrameCount() const;

    //-------------------------------------------------------------------------
    //! @brief      現在のフレーム番号を取得します.
    //! 
    //! @return     現在のフレーム番号を返却します.
    //-------------------------------------------------------------------------
    uint64_t GetFrameIndex() const;

    //-------------------------------------------------------------------------
    //! @brief      再生の一時停止を設定します.
    //! 
    //! @param[in]      pause       一時停止する場合は true を指定.
    //-------------------------------------------------------------------------
    void SetPause(bool puase);

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定を行います.
    //! 
    //! @param[in]      loop        ループ再生を行う場合は true を指定.
    //! @note       ループ再生を有効にした場合は, IsFinished() メソッドは true を返さなくなるので注意してください.
    //-------------------------------------------------------------------------
    void SetLoop(bool loop);

    //-------------------------------------------------------------------------
    //! @brief      一時停止中かどうかチェックします.
    //! 
    //! @retval true    一時停止中です.
    //! @retval false   再生中です.
    //-------------------------------------------------------------------------
    bool IsPause() const;

    //-------------------------------------------------------------------------
    //! @brief      ループ再生設定かどうかチェックします.
    //! 
    //! @retval true    ループ再生です.
    //! @retval false   非ループ再生です.
    //-------------------------------------------------------------------------
    bool IsLoop() const;

    //-------------------------------------------------------------------------
    //! @brief      再生が終了したかどうかチェックします.
    //! 
    //! @retval true    完了状態です.
    //! @retval false   未完了状態です.
    //! @note       ループ再生設定が行われている場合，この関数は常に false を返却します.
    //-------------------------------------------------------------------------
    bool IsFinished() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<IMovieStream>    m_Stream;
    RefPtr<ID3D12Resource>  m_Texture[2];
    DescriptorHolder        m_HandleSRV[2];
    uint8_t                 m_PrevIndex = 0;
    uint8_t                 m_CurrIndex = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

//-----------------------------------------------------------------------------
//! @brief      動画ストリームを生成します.
//! 
//! @param[out]     ppResult   ムービーストリームの格納先.
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateMovieStream(IMovieStream** ppResult);

//-----------------------------------------------------------------------------
//! @brief      NV12形式のコピー処理を行います.
//! 
//! @param[int]     dstPtr      コピー先のポインタです.
//! @param[in]      dstPitch    コピー先の1行あたりのサイズ(単位:byte)です.
//! @param[in]      srcPtr      コピー元のポインタです.
//! @param[in]      srcPitch    コピー元の1行あたりのサイズ(単位:byte)です.
//! @param[in]      width       横幅です.
//! @param[in]      height      縦幅です.
//-----------------------------------------------------------------------------
void CopyNV12(
    void*       dstPtr,
    uint32_t    dstPitch,
    const void* srcPtr,
    uint32_t    srcPitch,
    uint32_t    width,
    uint32_t    height);

} // namespace asdx

