//---------------------------------------------------------------------------
// File : asdxStarEffect.h
// Desc : Star(Light Streak) Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <gfx/asdxBuffer.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// StarEffect class
///////////////////////////////////////////////////////////////////////////////
class StarEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////////
    // TYPE enum
    ///////////////////////////////////////////////////////////////////////////////
    enum TYPE
    {
        DISABLE,               //!< 無効.
        CROSS_SCREEN,          //!< クロスフィルタ.
        CROSS_SCREEN_SPECTRAL, //!< クロスフィルタ・スペクトル.
        SNOW_CROSS,            //!< スノークロス.
        SNOW_CROSS_SPECTRAL,   //!< スノークロス・スペクトル.
        SUNNY_CROSS,           //!< サニークロス.
        SUNNY_CROSS_SPECTRAL,  //!< サニークロス・スペクトル.
        CINEMA_VERTICAL,       //!< シネマ垂直方向.
        CINEMA_HORIZONTAL,     //!< シネマ水平方向.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    StarEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~StarEffect();
 
    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      ブルーム適用結果を合成します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力シェーダリソースビュー.
    //-------------------------------------------------------------------------
    void CompositeBloom(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      光芒タイプを設定します.
    //! 
    //! @param[in]      type        設定する値.
    //-------------------------------------------------------------------------
    void SetType(TYPE type);

    //-------------------------------------------------------------------------
    //! @brief      光芒タイプを取得します.
    //! 
    //! @return     光芒タイプを返却します.
    //-------------------------------------------------------------------------
    TYPE GetType() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature>     m_RootSignature;        //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState>     m_StarPSO;              //!< 光芒用パイプラインステートです.
    RefPtr<ID3D12PipelineState>     m_CompositePSO;         //!< 合成用パイプラインステートです.
    ComputeTarget                   m_PingPongTarget[2];    //!< ピンポンターゲット.
    ComputeTarget                   m_OutputTarget;         //!< 出力ターゲット.
    D3D12_RESOURCE_STATES           m_PingPongStates[2];    //!< ピンポンターゲット用リソースステート.
    D3D12_RESOURCE_STATES           m_OutputStates;         //!< 出力ターゲット用リソースステート.
    TYPE                            m_Type = TYPE::DISABLE; //!< 光芒タイプ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
