//-----------------------------------------------------------------------------
// File : asdxTarget.h
// Desc : Target Wrapper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <dxgi1_6.h>
#include <vector>
#include <fnd/asdxOffsetAllocator.h>
#include <fnd/asdxRef.h>
#include <gfx/asdxAllocationHolder.h>
#include <gfx/asdxDescriptorHolder.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// TARGET_FLAGS enum
///////////////////////////////////////////////////////////////////////////////
enum TARGET_FLAGS
{
    TARGET_FLAG_NONE           = 0,             //!< フラグ設定なし.
    TARGET_FLAG_CREATE_MIP_RTV = 0x1 << 0,      //!< RTVに対して各ミップごとのディスクリプタを生成する.
    TARGET_FLAG_CREATE_MIP_DSV = 0x1 << 1,      //!< DSVに対して各ミップごとのディスクリプタを生成する.
    TARGET_FLAG_CREATE_MIP_UAV = 0x1 << 3,      //!< UAVに対して各ミップごとのディスクリプタを生成する.
    TARGET_FLAG_NO_SRV         = 0x1 << 4,      //!< SRVを作成しない.
};

///////////////////////////////////////////////////////////////////////////////
// TargetDesc2D structure
///////////////////////////////////////////////////////////////////////////////
struct TargetDesc
{
    D3D12_RESOURCE_DIMENSION    Dimension           = D3D12_RESOURCE_DIMENSION_UNKNOWN;     //!< 次元です.
    uint64_t                    Alignment           = 0;                                    //!< アライメントです.
    uint64_t                    Width               = 0;                                    //!< 横幅です.
    uint32_t                    Height              = 1;                                    //!< 縦幅です.
    uint16_t                    DepthOrArraySize    = 1;                                    //!< 奥行 または 配列サイズです.
    uint16_t                    MipLevels           = 1;                                    //!< ミップレベル数です.
    DXGI_FORMAT                 Format              = DXGI_FORMAT_UNKNOWN;                  //!< フォーマットです.
    DXGI_SAMPLE_DESC            SampleDesc          = { 1, 0 };                             //!< サンプル設定です.
    D3D12_RESOURCE_STATES       InitState           = D3D12_RESOURCE_STATE_COMMON;          //!< 初期ステート.
    float                       ClearColor[4]       = { 1.0f, 1.0f, 1.0f, 1.0f };           //!< クリアカラー値です.
    float                       ClearDepth          = 1.0f;                                 //!< クリア深度値です.
    uint8_t                     ClearStencil        = 0;                                    //!< クリアステンシル値です.
    uint32_t                    Flags               = TARGET_FLAG_NONE;                     //!< ターゲットフラグです.
};

///////////////////////////////////////////////////////////////////////////////
// ColorTarget class
///////////////////////////////////////////////////////////////////////////////
class ColorTarget
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ColorTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ColorTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化成功.
    //! @retval false   初期化失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc);

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pSwapChain          スワップチェインです.
    //! @param[in]      backbufferIndex     バックバッファ番号です.
    //! @param[in]      sRGB                sRGBが適用可能な場合にsRGBフォーマットにする場合は true.
    //! @retval true    初期化成功.
    //! @retval false   初期化失敗.
    //-------------------------------------------------------------------------
    bool Init(IDXGISwapChain* pSwapChain, uint32_t backbufferIndex, bool sRGB);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅
    //! @param[in]      height      縦幅.
    //! @retval true    リサイズに成功.
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(RTV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(RTV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleRTV(uint32_t index = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      バインドレスインデックスを取得します(SRV用).
    //!
    //! @return     バインドレスインデックスを返却します(SRV用).
    //-------------------------------------------------------------------------
    uint32_t GetBindlessIndexSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      GPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     GPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //!
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      sRGBフラグを取得します.
    //! 
    //! @return     sRGBフラグを返却します.
    //-------------------------------------------------------------------------
    bool IsSRGB() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>          m_pResource;
    AllocationHolder                m_HolderAlloc;
    std::vector<DescriptorHolder>   m_HolderRTV;
    DescriptorHolder                m_HolderSRV;
    TargetDesc                      m_Desc;
    D3D12_RESOURCE_STATES           m_PrevState = D3D12_RESOURCE_STATE_COMMON;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// DepthTarget class
///////////////////////////////////////////////////////////////////////////////
class DepthTarget
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    DepthTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~DepthTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      device      グラフィックスデバイスです.
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //! @retval true    リサイズに成功
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(DSV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(DSV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleDSV(uint32_t index = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      バインドレスインデックスを取得します(SRV用).
    //!
    //! @return     バインドレスインデックスを返却します(SRV用).
    //-------------------------------------------------------------------------
    uint32_t GetBindlessIndexSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      GPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     GPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //! 
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>          m_pResource;
    AllocationHolder                m_HolderAlloc;
    std::vector<DescriptorHolder>   m_HolderDSV;
    DescriptorHolder                m_HolderSRV;
    TargetDesc                      m_Desc;
    D3D12_RESOURCE_STATES           m_PrevState = D3D12_RESOURCE_STATE_COMMON;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// ComputeTarget
///////////////////////////////////////////////////////////////////////////////
class ComputeTarget
{
public:
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ComputeTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ComputeTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      device      グラフィックスデバイスです.
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc, uint32_t stride = 0);

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      target      カラーターゲットです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ColorTarget& target, uint32_t flags);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //! @param[in]      depth       奥行.
    //! @retval true    リサイズに成功.
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height = 1, uint16_t depth = 1);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      バインドレスインデックスを取得します(UAV用).
    //!
    //! @return     バインドレスインデックスを返却します(UAV用).
    //-------------------------------------------------------------------------
    uint32_t GetBindlessIndexUAV(uint32_t index = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(UAV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(UAV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleUAV(uint32_t index = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      GPUディスクリプタハンドルを取得します(UAV用).
    //! 
    //! @return     GPUディスクリプタハンドルを返却します(UAV用).
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleUAV(uint32_t index = 0) const;

    //-------------------------------------------------------------------------
    //! @brief      バインドレスインデックスを取得します(SRV用).
    //!
    //! @return     バインドレスインデックスを返却します(SRV用).
    //-------------------------------------------------------------------------
    uint32_t GetBindlessIndexSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      CPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     CPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_CPU_DESCRIPTOR_HANDLE GetCpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      GPUディスクリプタハンドルを取得します(SRV用).
    //! 
    //! @return     GPUディスクリプタハンドルを返却します(SRV用).
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //! 
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      ストライドサイズを取得します.
    //! 
    //! @return     ストライドサイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetStride() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

    //-------------------------------------------------------------------------
    //! @brief      UAVバリアを設定します.
    //! 
    //! @param[in]      pCmdList        コマンドリスト.
    //-------------------------------------------------------------------------
    void UAVBarrier(ID3D12GraphicsCommandList* pCmdList);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>          m_pResource;
    AllocationHolder                m_HolderAlloc;
    std::vector<DescriptorHolder>   m_HolderUAV;
    DescriptorHolder                m_HolderSRV;
    TargetDesc                      m_Desc;
    uint32_t                        m_Stride    = 0;
    D3D12_RESOURCE_STATES           m_PrevState = D3D12_RESOURCE_STATE_COMMON;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
