//-----------------------------------------------------------------------------
// File : asdxFont.h
// Desc : Font Rasterizer.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once


//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <d3d12.h>
#include <fnd/asdxMath.h>
#include <res/asdxResFont.h>
#include <gfx/asdxTexture.h>
#include <gfx/asdxSampler.h>


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Decalarations.
//-----------------------------------------------------------------------------
class SpriteRenderer;


///////////////////////////////////////////////////////////////////////////////
// Font class
///////////////////////////////////////////////////////////////////////////////
class Font
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // DrawInfo structure
    ///////////////////////////////////////////////////////////////////////////
    struct DrawInfo
    {
        float   x;          //!< 開始位置X成分.
        float   y;          //!< 開始位置Y成分.
        float   w;          //!< 横幅.
        float   h;          //!< 縦幅.
        Vector2 uv0;        //!< 左上のテクスチャ座標.
        Vector2 uv1;        //!< 右下のテクスチャ座標.
        float   advance;    //!< 次の文字まで横幅.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public variables.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Font();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Font();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      path        フォントバイナリのファイルパスです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ID3D12GraphicsCommandList* pCmd, const char* path);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを取得します.
    //! 
    //! @return     テクスチャを返却します.
    //-------------------------------------------------------------------------
    const Texture& GetTexture() const;

    //-------------------------------------------------------------------------
    //! @brief      フォントバイナリを取得します.
    //! 
    //! @return     フォントバイナリを返却します.
    //-------------------------------------------------------------------------
    const FontBinary& GetBinary() const;

    //-------------------------------------------------------------------------
    //! @brief      グリフを検索します.
    //! 
    //! @param[in]      unicode     ユニコード文字.
    //! @param[out]     info        描画情報.
    //! @retval true    検索にヒット.
    //! @retval false   見つからなかった.
    //-------------------------------------------------------------------------
    bool Find(uint32_t unicode, DrawInfo& info) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    FontBinary      m_Binary;       //!< フォントバイナリです.
    Texture         m_Texture;      //!< フォントテクスチャです.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// FontRenderer class
///////////////////////////////////////////////////////////////////////////////
class FontRenderer
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static FontRenderer& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理です.
    //! 
    //! @param[in]      renderer        スプライトレンダラーです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(SpriteRenderer& renderer);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[out]     outX            文字描画後のX成分
    //! @param[out]     outY            文字描画後のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, int* outX, int* outY, const char* text);

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, const char* text)
    { Add(renderer, font, x, y, layer, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, const char* text)
    { Add(renderer, font, x, y, 0, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      書式指定子でフォーマットし，指定された配列に格納します.
    //! 
    //! @param[in,out]  buffer      格納先のバッファ.
    //! @param[in]      bufferSize  バッファサイズ.
    //! @param[in]      format      書式指定子.
    //! @return     bufferのポインタを返却します.
    //-------------------------------------------------------------------------
    static char* Format(char* buffer, size_t bufferSize, const char* format, ...);

    //-------------------------------------------------------------------------
    //! @brief      書式指定子でフォーマットし，指定された配列に格納します.
    //! 
    //! @param[in,out]  buffer      格納先のバッファ.
    //! @param[in]      bufferSize  バッファサイズ.
    //! @param[in]      format      書式指定子.
    //! @return     bufferのポインタを返却します.
    //-------------------------------------------------------------------------
    template<size_t ArraySize, class... Args>
    static char* Format(char buffer[ArraySize], const char* format, Args ...args)
    { return Format(buffer, ArraySize, format, args...); }

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      pCmdList    グラフィックスコマンドリストです.
    //! @param[in]      renderer    スプライトレンダラーです.
    //-------------------------------------------------------------------------
    void SetState(ID3D12GraphicsCommandList* pCmdList, SpriteRenderer& renderer, const Font& font);

    //-------------------------------------------------------------------------
    //! @brief      スケールを設定します.
    //! 
    //! @param[in]      value       設定するスケール値.
    //-------------------------------------------------------------------------
    void SetScale(float value);

    //-------------------------------------------------------------------------
    //! @brief      スケール値を取得します.
    //! 
    //! @return     スケール値を返却します.
    //-------------------------------------------------------------------------
    float GetScale() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static FontRenderer             s_Instance;         //!< シングルトンインスタンスです.
    RefPtr<ID3D12PipelineState>     m_PipelineState;    //!< パイプラインステートです.
    Sampler                         m_LinearClamp;      //!< リニアクランプ.
    float                           m_Scale = 1.0f;     //!< フォントスケールです.

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    FontRenderer();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~FontRenderer();

    FontRenderer             (const FontRenderer&) = delete;
    FontRenderer& operator = (const FontRenderer&) = delete;
};

} // namespace asdx
