//-----------------------------------------------------------------------------
// File : asdxMesh.h
// Desc : Polygon Mesh.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxMath.h>
#include <fnd/asdxString.h>
#include <fnd/asdxStringView.h>
#include <fnd/asdxArrayView.h>
#include <gfx/asdxBuffer.h>


namespace asdx {

struct ResMesh;

///////////////////////////////////////////////////////////////////////////////
// Mesh class
///////////////////////////////////////////////////////////////////////////////
class Mesh
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Mesh();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Mesh();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      res            リソースメッシュです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const ResMesh& res);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      メッシュ名を取得します.
    //! 
    //! @return     メッシュ名を返却します.
    //-------------------------------------------------------------------------
    const String& GetName() const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルIDを取得します.
    //! 
    //! @return     マテリアルIDを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetMaterialId() const;

    //-------------------------------------------------------------------------
    //! @brief      位置座標バッファを取得します.
    //! 
    //! @return     位置座標バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetPositions() const;

    //-------------------------------------------------------------------------
    //! @brief      法線バッファを取得します.
    //! 
    //! @return     法線バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetNormals() const;

    //-------------------------------------------------------------------------
    //! @brief      接線バッファを取得します.
    //! 
    //! @return     接線バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetTangents() const;

    //-------------------------------------------------------------------------
    //! @brief      カラーバッファを取得します.
    //! 
    //! @return     カラーバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetColors() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ座標バッファを取得します.
    //! 
    //! @return     テクスチャ座標バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetTexCoords() const;

    //-------------------------------------------------------------------------
    //! @brief      ボーンインデックスバッファを取得します.
    //! 
    //! @return     ボーンインデックスバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetBoneIndices() const;

    //-------------------------------------------------------------------------
    //! @brief      ボーンウェイトバッファを取得します.
    //! 
    //! @return     ボーンウェイトバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetBoneWeights() const;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックスバッファを取得します.
    //! 
    //! @return     頂点インデックスバッファを返却します.
    //-------------------------------------------------------------------------
    const IndexBuffer& GetIndices() const;

    //-------------------------------------------------------------------------
    //! @brief      頂点数を取得します.
    //! 
    //! @return     頂点数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetVertexCount() const;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックス数を取得します.
    //! 
    //! @return     頂点インデックス数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetIndexCount() const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    const BoundingSphere& GetSphere() const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングボックスを取得します.
    //! 
    //! @return     バウンディングボックスを返却します.
    //-------------------------------------------------------------------------
    const BoundingBox& GetBox() const;

    //-------------------------------------------------------------------------
    //! @brief      レイトレーシングジオメトリトライアングル設定を取得します.
    //! 
    //! @return     レイトレーシングジオメトリトライアングル設定を返却します.
    //-------------------------------------------------------------------------
    D3D12_RAYTRACING_GEOMETRY_TRIANGLES_DESC GetTrianglesDesc() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    String          m_Name;                 //!< メッシュ名.
    uint32_t        m_MaterialId;           //!< マテリアルID.
    VertexBuffer    m_Positions;            //!< 位置座標バッファ.
    VertexBuffer    m_Normals;              //!< 法線バッファ.
    VertexBuffer    m_Tangents;             //!< 接線バッファ.
    VertexBuffer    m_Colors;               //!< カラーバッファ.
    VertexBuffer    m_TexCoords;            //!< テクスチャ座標バッファ.
    VertexBuffer    m_BoneIndices;          //!< ボーンインデックスバッファ.
    VertexBuffer    m_BoneWeights;          //!< ボーンウェイトバッファ.
    IndexBuffer     m_VertexIndices;        //!< 頂点インデックスバッファ.
    BoundingSphere  m_Sphere;               //!< バウンディングスフィア.
    BoundingBox     m_Box;                  //!< バウンディングボックス.
    uint32_t        m_VertexCount   = 0;    //!< 頂点数.
    uint32_t        m_IndexCount    = 0;    //!< 頂点インデックス数.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

//-----------------------------------------------------------------------------
//! @brief      メッシュジオメトリを描画します.
//! 
//! @param[in]      pCmd            グラフィックスコマンドリストです.
//! @param[in]      pMesh           メッシュ.
//! @param[in]      instanceCount   インタンス数.
//! @param[in]      isSkeltal       スケルタルメッシュフラグ.
//-----------------------------------------------------------------------------
void DrawMesh(
    ID3D12GraphicsCommandList*  pCmd,
    const Mesh*                 pMesh,
    uint32_t                    instanceCount,
    bool                        isSkeltal = false);

} // namespace
