//-----------------------------------------------------------------------------
// File : asdxModelSystem.h
// Desc : Model System.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <vector>
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>
#include <fnd/asdxList.h>


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
struct IMaterial;
class VertexBuffer;
class IndexBuffer;


///////////////////////////////////////////////////////////////////////////////
// IBone interface
///////////////////////////////////////////////////////////////////////////////
struct IBone
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IBone() {};

    //-------------------------------------------------------------------------
    //! @brief      ボーン名を取得します.
    //! 
    //! @return     ボーン名を返却します.
    //-------------------------------------------------------------------------
    virtual const std::string& GetName() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      親ボーンを取得します.
    //! 
    //! @return     親ボーンを返却します.
    //-------------------------------------------------------------------------
    virtual const IBone* GetParent() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      オフセット行列を取得します.
    //!
    //! @return     オフセット行列を返却します.
    //-------------------------------------------------------------------------
    virtual const Matrix& GetOffsetMatrix() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      子ボーンの数を取得します
    //! 
    //! @return     子ボーンの数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetChildCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      子ボーンを取得します.
    //! 
    //! @param[in]      index       子供の番号.
    //! @return     子ボーンを返却します.
    //-------------------------------------------------------------------------
    virtual const IBone* GetChild(size_t index) const = 0;
};

///////////////////////////////////////////////////////////////////////////////
// IMesh interface
///////////////////////////////////////////////////////////////////////////////
struct IMesh
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IMesh() {}

    //-------------------------------------------------------------------------
    //! @brief      メッシュ名を取得します.
    //! 
    //! @return     メッシュ名を返却します.
    //-------------------------------------------------------------------------
    virtual const std::string& GetName() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルIDを取得します.
    //! 
    //! @return     マテリアルIDを返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetMaterialId() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      位置座標バッファを取得します.
    //! 
    //! @return     位置座標バッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetPositions() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      法線ベクトルバッファを取得します.
    //! 
    //! @return     法線ベクトルバッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetNormals() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      接線ベクトルバッファを取得します.
    //! 
    //! @return     接線ベクトルバッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetTangents() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      頂点カラーバッファを取得します.
    //! 
    //! @return     頂点カラーバッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetColors() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ座標バッファを取得します.
    //! 
    //! @return     テクスチャ座標バッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetTexCoords() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンインデックスバッファを取得します.
    //! 
    //! @return     ボーンインデックスバッファを返却します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetBoneIndices() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンウェイトバッファを取得します.
    //! 
    //! @return     ボーンウェイトバッファを取得します.
    //-------------------------------------------------------------------------
    virtual const VertexBuffer& GetBoneWeights() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックスバッファを取得します.
    //! 
    //! @return     頂点インデックスバッファを返却します.
    //-------------------------------------------------------------------------
    virtual const IndexBuffer& GetVertexIndices() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      頂点数を取得します.
    //! 
    //! @return     頂点数を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetVertexCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックス数を取得します.
    //! 
    //! @return     頂点インデックス数を返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetIndexCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    virtual const BoundingSphere3& GetBoundingSphere() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      レイトレーシングジオメトリトライアングル設定を取得します.
    //! 
    //! @return     レイトレーシングジオメトリトライアングル設定を返却します.
    //-------------------------------------------------------------------------
    virtual D3D12_RAYTRACING_GEOMETRY_TRIANGLES_DESC GetRayTracingGeometryTrianglesDesc() const = 0;
};

///////////////////////////////////////////////////////////////////////////////
// IModel interface
///////////////////////////////////////////////////////////////////////////////
struct IModel
    : public IReference
    , public List<IModel>::Node
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IModel() {}

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetMaterialCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名を取得します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @return     マテリアル名を返却します.
    //-------------------------------------------------------------------------
    virtual const std::string& GetMaterialName(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @return     マテリアルを返却します.
    //-------------------------------------------------------------------------
    virtual IMaterial* GetMaterial(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを設定します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @param[in]      pMaterial   設定するマテリアル.
    //-------------------------------------------------------------------------
    virtual void SetMaterial(size_t index, IMaterial* pMaterial) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを持つかどうかチェックします.
    //! 
    //! @retval true    ボーンを持ちます.
    //! @retval false   ボーンを持ちませんん.
    //-------------------------------------------------------------------------
    virtual bool HasBone() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーン数を取得します.
    //! 
    //! @return     ボーン数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetBoneCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを取得します.
    //! 
    //! @param[in]      index       ボーン番号です.
    //! @return     ボーンを返却します.
    //-------------------------------------------------------------------------
    virtual const IBone* GetBone(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ数を取得します.
    //! 
    //! @return     メッシュ数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetMeshCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @return     メッシュを返却します.
    //-------------------------------------------------------------------------
    virtual const IMesh* GetMesh(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    virtual const BoundingSphere3& GetBoundingSphere() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを取得します.
    //! 
    //! @retval true    表示します.
    //! @retval false   表示しません.
    //-------------------------------------------------------------------------
    virtual bool IsVisible() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを設定します.
    //! 
    //! @param[in]      value       表示する場合は true を設定.
    //-------------------------------------------------------------------------
    virtual void SetVisibility(bool value) = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @retval true    メッシュを表示.
    //! @retval false   メッシュを非表示.
    //-------------------------------------------------------------------------
    virtual bool IsVisibleMesh(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを設定します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @param[in]      value       表示する場合は true を設定.
    //-------------------------------------------------------------------------
    virtual void SetMeshVisibility(size_t index, bool value) = 0;
};


///////////////////////////////////////////////////////////////////////////////
// IModelInstance interface
///////////////////////////////////////////////////////////////////////////////
struct IModelInstance
    : public IReference
    , public List<IModelInstance>::Node
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IModelInstance() {}

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetMaterialCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名を取得します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @return     マテリアル名を返却します.
    //-------------------------------------------------------------------------
    virtual const std::string& GetMaterialName(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @return     マテリアルを返却します.
    //-------------------------------------------------------------------------
    virtual IMaterial* GetMaterial(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを設定します.
    //! 
    //! @param[in]      index       マテリアル番号です.
    //! @param[in]      pMaterial   設定するマテリアル.
    //-------------------------------------------------------------------------
    virtual void SetMaterial(size_t index, IMaterial* pMaterial) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを持つかどうかチェックします.
    //! 
    //! @retval true    ボーンを持ちます.
    //! @retval false   ボーンを持ちませんん.
    //-------------------------------------------------------------------------
    virtual bool HasBone() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーン数を取得します.
    //! 
    //! @return     ボーン数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetBoneCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを取得します.
    //! 
    //! @param[in]      index       ボーン番号です.
    //! @return     ボーンを返却します.
    //-------------------------------------------------------------------------
    virtual const IBone* GetBone(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ数を取得します.
    //! 
    //! @return     メッシュ数を返却します.
    //-------------------------------------------------------------------------
    virtual size_t GetMeshCount() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @return     メッシュを返却します.
    //-------------------------------------------------------------------------
    virtual const IMesh* GetMesh(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    virtual const BoundingSphere3& GetBoundingSphere() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを取得します.
    //! 
    //! @retval true    表示します.
    //! @retval false   表示しません.
    //-------------------------------------------------------------------------
    virtual bool IsVisible() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを設定します.
    //! 
    //! @param[in]      value       表示する場合は true を設定.
    //-------------------------------------------------------------------------
    virtual void SetVisibility(bool value) = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @retval true    メッシュを表示.
    //! @retval false   メッシュを非表示.
    //-------------------------------------------------------------------------
    virtual bool IsVisibleMesh(size_t index) const = 0;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを設定します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @param[in]      value       表示する場合は true を設定.
    //-------------------------------------------------------------------------
    virtual void SetMeshVisibility(size_t index, bool value) = 0;

    //-------------------------------------------------------------------------
    //! @brief      インスタンスIDを取得します.
    //! 
    //! @return     インスタンスIDを返却します.
    //-------------------------------------------------------------------------
    virtual uint32_t GetInstanceId() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      ワールド行列を設定します.
    //! 
    //! @param[in]      value       ワールド行列.
    //-------------------------------------------------------------------------
    virtual void SetWorldMatrix(const Matrix& value) = 0;

    //-------------------------------------------------------------------------
    //! @brief      ワールド行列を取得します.
    //! 
    //! @return     ワールド行列を返却します.
    //-------------------------------------------------------------------------
    virtual const Matrix& GetWorldMatrix() const = 0;

    //-------------------------------------------------------------------------
    //! @brief      スキニング行列を設定します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @param[in]      value       設定する行列.
    //-------------------------------------------------------------------------
    virtual void SetSkinningMatrix(size_t index, const Matrix& value) = 0;

    //-------------------------------------------------------------------------
    //! @brief      スキニング行列を取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     スキニング行列を返却します.
    //-------------------------------------------------------------------------
    virtual const Matrix& GetSkinningMatrix(size_t index) const = 0;
};


///////////////////////////////////////////////////////////////////////////////
// IModelManager interface
///////////////////////////////////////////////////////////////////////////////
struct IModelManager
{
public:
    using OnModel         = void (*)(IModel*, void*);
    using OnModelInstance = void (*)(IModelInstance*, void*);

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IModelManager() {}

    //-------------------------------------------------------------------------
    //! @brief      モデルを生成します.
    //! 
    //! @param[in]      blob        バイナリです.
    //! @param[out]     ppModel     モデルの格納先です.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    virtual bool CreateModel(const std::vector<uint8_t>& blob, IModel** ppModel) = 0;

    //-------------------------------------------------------------------------
    //! @brief      モデルインスタンスを生成します.
    //! 
    //! @param[in]      pMasterModel    マスターモデルです.
    //! @param[out]     ppInstance      モデルインスタンスの格納先です.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    virtual bool CreateModelInstance(IModel* pMasterModel, IModelInstance** ppInstance) = 0;

    //-------------------------------------------------------------------------
    //! @brief      各モデルに対して処理します.
    //! 
    //! @param[in]      action      コールバック関数.
    //! @param[in]      userData    ユーザーデータです.
    //! @note       userDataは OnModel() の第2引数として渡されます.
    //-------------------------------------------------------------------------
    virtual void ForEachModel(OnModel action, void* userData) = 0;

    //-------------------------------------------------------------------------
    //! @brief      各モデルインスタンスに対して処理します.
    //! 
    //! @param[in]      action      コールバック関数.
    //! @param[in]      userData    ユーザーデータです.
    //! @note       userData は OnModelInstance() の第2引数として渡されます.
    //-------------------------------------------------------------------------
    virtual void ForEachModelInstance(OnModelInstance action, void* userData) = 0;
};

//-----------------------------------------------------------------------------
//! @brief      モデルマネージャーを初期化処理を行います.
//! 
//! @param[in]      maxInstanceCount        全インスタンス数
//! @retval true    初期化に成功.
//! @retval false   初期化に失敗.
//-----------------------------------------------------------------------------
bool InitModelManager(uint32_t maxInstanceCount);

//-----------------------------------------------------------------------------
//! @brief      モデルマネージャの終了処理を行います.
//-----------------------------------------------------------------------------
void TermModelManager();

//-----------------------------------------------------------------------------
//! @brief      モデルマネージャが初期化済みかどうかチェックします/
//! 
//! @retval true    初期化済みです.
//! @retval false   未初期化です.
//-----------------------------------------------------------------------------
bool IsInitModelManager();

//-----------------------------------------------------------------------------
//! @brief      モデルマネージャを取得します.
//! 
//! @return     モデルマネージャを返却します.
//-----------------------------------------------------------------------------
IModelManager& GetModelManager();

} // namespace asdx
