//-----------------------------------------------------------------------------
// File : asdxBloomEffect.h
// Desc : Bloom Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// BloomEffect class
///////////////////////////////////////////////////////////////////////////////
class BloomEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~BloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //-------------------------------------------------------------------------
    void Resize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力SRV.
    //-------------------------------------------------------------------------
    void Apply(
        ID3D12GraphicsCommandList* pCmd,
        uint32_t width,
        uint32_t height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      閾値を設定します.
    //! 
    //! @param[in]      value       BT.709ベースの輝度の閾値.
    //-------------------------------------------------------------------------
    void SetThreshold(float value);

    //-------------------------------------------------------------------------
    //! @brief      閾値を取得します.
    //! 
    //! @return     閾値を返却します.
    //-------------------------------------------------------------------------
    float GetThreshold() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static const uint32_t       kMaxTargetCount = 5;                    //!< ブラー用最大ターゲット数.
    RefPtr<ID3D12RootSignature> m_RootSignature;                        //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState> m_FirstPassPSO;                         //!< 初期パス用パイプラインステートオブジェクト.
    RefPtr<ID3D12PipelineState> m_DownPassPSO;                          //!< ダウンサンプル用パイプラインステートオブジェクト.
    RefPtr<ID3D12PipelineState> m_CompositePSO;                         //!< 合成用パイプランステートオブジェクト.
    RefPtr<ID3D12PipelineState> m_UpscalePSO;                           //!< アップスケール用パイプラインステートオブジェクト.
    ComputeTarget               m_BlurTarget[kMaxTargetCount];          //!< 縮小サイズターゲット.
    ComputeTarget               m_ComputeTarget;                        //!< 元解像度ターゲット.
    D3D12_RESOURCE_STATES       m_BlurStates[kMaxTargetCount] = {};     //!< 縮小用ステート.
    D3D12_RESOURCE_STATES       m_States                      = {};     //!< 元解像度用ステート.
    float                       m_Threshold                   = 1.0f;   //!< 閾値.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
