//-----------------------------------------------------------------------------
// File : asdxShaderCompiler.h
// Desc : Shader Compiler.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <fnd/asdxBlob.h>


//-----------------------------------------------------------------------------
// Linker
//-----------------------------------------------------------------------------
#ifdef ASDX_AUTO_LINK
    #ifdef ASDX_ENABLE_DXC
        #pragma comment( lib, "dxcompiler.lib" )
    #else
        #pragma comment( lib, "d3dcompiler.lib")
    #endif
#endif

struct ID3D12ShaderReflection;

namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      ファイルからシェーダコンパイルします.
//!
//! @param[in]      filename            ファイル名です.
//! @param[in]      includeDirs         インクルードディレクトリ.
//! @param[in]      entryPoint          エントリーポイント名で末.
//! @param[in]      shaderModel         シェーダモデルです.
//! @param[out]     ppResult            シェーダバイナリの格納先です.
//! @retval true    コンパイルに成功.
//! @retval false   コンパイルに失敗.
//-----------------------------------------------------------------------------
bool CompileFromFileA(
    const char*                 filename,
    std::vector<std::string>    includeDirs,
    const char*                 entryPoint,
    const char*                 shaderModel,
    IBlob**                     ppResult);


//-----------------------------------------------------------------------------
//! @brief      ファイルからシェーダコンパイルします.
//!
//! @param[in]      filename            ファイル名です.
//! @param[in]      includeDirs         インクルードディレクトリ.
//! @param[in]      entryPoint          エントリーポイント名で末.
//! @param[in]      shaderModel         シェーダモデルです.
//! @param[out]     ppResult            シェーダバイナリの格納先です.
//! @retval true    コンパイルに成功.
//! @retval false   コンパイルに失敗.
//-----------------------------------------------------------------------------
bool CompileFromFileW(
    const wchar_t*            filename,
    std::vector<std::wstring> includeDirs,
    const char*               entryPoint,
    const char*               shaderModel,
    IBlob**                   ppResult);


///////////////////////////////////////////////////////////////////////////////
// ShaderReflection class
///////////////////////////////////////////////////////////////////////////////
class ShaderReflection
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ShaderReflection();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ShaderReflection();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pData       リフレクションデータ.
    //! @param[in]      size        リフレクションデータサイズ(バイト単位).
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const void* pData, size_t size);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      シェーダリフレクションを取得します.
    //!
    //! @return     シェーダリフレクションを返却します.
    //-------------------------------------------------------------------------
    ID3D12ShaderReflection* GetPtr() const;

    //-------------------------------------------------------------------------
    //! @brief      アロー演算子です.
    //-------------------------------------------------------------------------
    ID3D12ShaderReflection* operator ->();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12ShaderReflection> m_pReflection;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace