//-----------------------------------------------------------------------------
// File : asdxKawaseBloomEffect.h
// Desc : Kawase's Bloom Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// KawaseBloomEffect class
///////////////////////////////////////////////////////////////////////////////
class KawaseBloomEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    KawaseBloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~KawaseBloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //-------------------------------------------------------------------------
    void Resize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      srvWidth    SRVの横幅.
    //! @param[in]      srvHeight   SRVの縦幅.
    //! @param[in]      handleSRV   入力SRV.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList*  pCmd,
        uint32_t                    srvWidth,
        uint32_t                    srvHeight,
        D3D12_GPU_DESCRIPTOR_HANDLE handlSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      UAVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     UAVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleUAV() const;

    //-------------------------------------------------------------------------
    //! @brief      ブラー用SRVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     ブラー用SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetBlurGpuHandleSRV(uint8_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      ブラー用UAVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     ブラー用UAVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetBlurGpuHandleUAV(uint8_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      閾値を設定します.
    //! 
    //! @param[in]      value       設定する閾値.
    //-------------------------------------------------------------------------
    void SetThreshold(float value);

    //-------------------------------------------------------------------------
    //! @brief      閾値を取得します.
    //! 
    //! @return     閾値を返却します.
    //-------------------------------------------------------------------------
    float GetThreshold() const;

    //-------------------------------------------------------------------------
    //! @brief      ブラーの強さを設定します.
    //! 
    //! @param[in]      value       設定する値.
    //-------------------------------------------------------------------------
    void SetBlurStrength(float value);

    //-------------------------------------------------------------------------
    //! @brief      ブラーの強さを取得します.
    //! 
    //! @return     ブラーの強さを返却します.
    //-------------------------------------------------------------------------
    float GetBlurStrength() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static const uint8_t            kMaxTargetCount = 10;                       //!< 最大ターゲット数.
    RefPtr<ID3D12RootSignature>     m_RootSignature;                            //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState>     m_FirstPassPSO;                             //!< 初期パス用パイプラインステート.
    RefPtr<ID3D12PipelineState>     m_DownPassPSO;                              //!< ダウンサンプル用パイプラインステート.
    RefPtr<ID3D12PipelineState>     m_CompositePSO;                             //!< 合成用パイプラインステート.
    RefPtr<ID3D12PipelineState>     m_FinalPassPSO;                             //!< アップスケール用パイプラインステート.
    ComputeTarget                   m_BlurTarget[kMaxTargetCount];              //!< ブラーターゲット.
    ComputeTarget                   m_ComputeTarget;                            //!< コンピュートターゲット.
    D3D12_RESOURCE_STATES           m_BlurTargetStates[kMaxTargetCount] = {};   //!< ブラーターゲットステート.
    D3D12_RESOURCE_STATES           m_ComputeTargetStates;                      //!< コンピュートターゲットステート.
    float                           m_Threshold     = 1.0f;                     //!< 閾値.
    float                           m_BlurStrength  = 3.0f;                     //!< ブラーの強さ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
