//----------------------------------------------------------------------------
// File : asdxModel.h
// Desc : Model System.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <unordered_map>
#include <fnd/asdxRef.h>
#include <fnd/asdxList.h>
#include <res/asdxResMesh.h>
#include <res/asdxResModel.h>
#include <gfx/asdxMesh.h>
#include <gfx/asdxMaterial.h>
#include <gfx/asdxSkeleton.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Model class
///////////////////////////////////////////////////////////////////////////////
class Model final : public IReference
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
     //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      生成処理を行います.
    //! 
    //! @param[in]      res         モデルリソース.
    //! @param[out]     ppModel     モデルの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    static bool Create(const ResModel& res, Model** ppModel);

    //-------------------------------------------------------------------------
    //! @brief      生成処理を行います.
    //! 
    //! @param[in]      binary      モデルバイナリ.
    //! @param[out]     ppModel     モデルの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    static bool Create(const ModelBinary& binary, Model** ppModel);

    //-------------------------------------------------------------------------
    //! @brief      参照カウントを上げます.
    //-------------------------------------------------------------------------
    void AddRef() override;

    //-------------------------------------------------------------------------
    //! @brief      解放処理を行います.
    //-------------------------------------------------------------------------
    void Release() override;

    //-------------------------------------------------------------------------
    //! @brief      参照カウントを取得します.
    //! 
    //! @return     参照カウントを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetRefCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ数を取得します.
    //! 
    //! @return     メッシュ数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMeshCount() const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMaterialCount() const;

    //-------------------------------------------------------------------------
    //! @brief      メッシュバッチ数を取得します.
    //! 
    //! @return     メッシュバッチ数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMeshBatchCount() const;

    //-------------------------------------------------------------------------
    //! @brief      メッシュインスタンス数を取得します.
    //! 
    //! @return     メッシュインスタンス数を返却します.
    //-------------------------------------------------------------------------
    uint64_t GetMeshInstanceCount() const;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @return     メッシュを返却します.
    //-------------------------------------------------------------------------
    const Mesh& GetMesh(size_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名ハッシュを取得します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @return     マテリアル名ハッシュを返却します.
    //-------------------------------------------------------------------------
    uint64_t GetMaterial(size_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      スケルトンを取得します.
    //! 
    //! @return     スケルトンを返却します.
    //-------------------------------------------------------------------------
    const Skeleton& GetSkeleton() const;

    //-------------------------------------------------------------------------
    //! @brief      メッシュバッチを取得します.
    //! 
    //! @param[in]      index       バッチ番号.
    //! @return     メッシュバッチを返却します.
    //-------------------------------------------------------------------------
    ResMeshBatch GetMeshBatch(size_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを検索します.
    //! 
    //! @param[in]      name        メッシュ名.
    //! @param[out]     index       メッシュ番号.
    //! @retval true    検索に成功.
    //! @retval false   検索に失敗.
    //-------------------------------------------------------------------------
    bool FindMesh(uint64_t hash, size_t& index) const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名を検索します.
    //! 
    //! @param[in]      name        マテリアル名.
    //! @retval true    検索に成功.
    //! @retval false   検索に失敗.
    //-------------------------------------------------------------------------
    bool FindMaterial(uint64_t hash, size_t& index) const;

    //-------------------------------------------------------------------------
    //! @brief      ハッシュから名前を検索します.
    //! 
    //! @param[in]      hash        ハッシュ値.
    //! @return     名前を返却します.
    //-------------------------------------------------------------------------
    StringView FindName(uint64_t hash) const;

private:
    ///////////////////////////////////////////////////////////////////////////
    // MeshBatch structure
    ///////////////////////////////////////////////////////////////////////////
    struct MeshBatch
    {
        std::vector<uint32_t>           Meshes;
        std::vector<ResMeshInstance>    Instances;
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    std::atomic<uint32_t>                   m_RefCount = {};
    std::vector<Mesh>                       m_Meshes;
    std::vector<uint64_t>                   m_Materials;
    std::vector<MeshBatch>                  m_Batches;
    Skeleton                                m_Skeleton;
    std::unordered_map<uint64_t, String>    m_HashTable;
    uint64_t                                m_MeshInstanceCount;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Model();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Model();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      res        モデルリソース.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const ResModel& res);

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      binary      モデルバイナリ.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const ModelBinary& binary);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    Model             (const Model&) = delete;
    Model& operator = (const Model&) = delete;
};

} // namespace asdx
