//-----------------------------------------------------------------------------
// File : asdxEnhancedBarrier.h
// Desc : Enhanced Barrier.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// EnhancedBarrier class
///////////////////////////////////////////////////////////////////////////////
class EnhancedBarrier
{
    //=========================================================================
    // list of friend classes and methhod.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    EnhancedBarrier() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~EnhancedBarrier() = default;

    //-------------------------------------------------------------------------
    //! @brief      リセット処理を行います.
    //-------------------------------------------------------------------------
    void Reset();

    //-------------------------------------------------------------------------
    //! @brief      グローバルバリアを設定します.
    //-------------------------------------------------------------------------
    void Global(
        D3D12_BARRIER_SYNC      syncBefore,
        D3D12_BARRIER_SYNC      syncAfter,
        D3D12_BARRIER_ACCESS    accessBefore,
        D3D12_BARRIER_ACCESS    accessAfter);

    //-------------------------------------------------------------------------
    //! @brief      テクスチャバリアを設定します.
    //-------------------------------------------------------------------------
    void Texture(
        ID3D12Resource*             pResource,
        D3D12_BARRIER_SYNC          syncBefore,
        D3D12_BARRIER_SYNC          syncAfter,
        D3D12_BARRIER_ACCESS        accessBefore,
        D3D12_BARRIER_ACCESS        accessAfter,
        D3D12_BARRIER_LAYOUT        layoutBefore,
        D3D12_BARRIER_LAYOUT        layoutAfter,
        D3D12_TEXTURE_BARRIER_FLAGS flags = D3D12_TEXTURE_BARRIER_FLAG_NONE,
        const D3D12_BARRIER_SUBRESOURCE_RANGE* pRange = nullptr);

    //-------------------------------------------------------------------------
    //! @brief      バッファバリアを設定します.
    //-------------------------------------------------------------------------
    void Buffer(
        ID3D12Resource*      pResource,
        D3D12_BARRIER_SYNC   syncBefore,
        D3D12_BARRIER_SYNC   syncAfter,
        D3D12_BARRIER_ACCESS accessBefore,
        D3D12_BARRIER_ACCESS accessAfter,
        UINT64               offset = 0,
        UINT64               size   = 0);

    //-------------------------------------------------------------------------
    //! @brief      バリアを適用します.
    //-------------------------------------------------------------------------
    void Apply(ID3D12GraphicsCommandList7* pCmd);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    UINT m_GlobalCount  = 0;
    UINT m_TextureCount = 0;
    UINT m_BufferCount  = 0;

    D3D12_GLOBAL_BARRIER    m_Global [16] = {};
    D3D12_TEXTURE_BARRIER   m_Texture[16] = {};
    D3D12_BUFFER_BARRIER    m_Buffer [16] = {};

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace
