//-----------------------------------------------------------------------------
// File : asdxFont.h
// Desc : Font Rasterizer.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once


//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <d3d12.h>
#include <fnd/asdxMath.h>
#include <res/asdxResFont.h>
#include <gfx/asdxTexture.h>
#include <gfx/asdxSampler.h>


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Decalarations.
//-----------------------------------------------------------------------------
class SpriteRenderer;


///////////////////////////////////////////////////////////////////////////////
// Font class
///////////////////////////////////////////////////////////////////////////////
class Font
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // DrawInfo structure
    ///////////////////////////////////////////////////////////////////////////
    struct DrawInfo
    {
        float   x;          //!< 開始位置X成分.
        float   y;          //!< 開始位置Y成分.
        float   w;          //!< 横幅.
        float   h;          //!< 縦幅.
        Vector2 uv0;        //!< 左上のテクスチャ座標.
        Vector2 uv1;        //!< 右下のテクスチャ座標.
        float   advance;    //!< 次の文字まで横幅.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public variables.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Font();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Font();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリストです.
    //! @param[in]      blob        バイナリラージオブジェクトです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ID3D12GraphicsCommandList* pCmd, std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを取得します.
    //! 
    //! @return     テクスチャを返却します.
    //-------------------------------------------------------------------------
    const Texture* GetTexture() const;

    //-------------------------------------------------------------------------
    //! @brief      フォントバイナリを取得します.
    //! 
    //! @return     フォントバイナリを返却します.
    //-------------------------------------------------------------------------
    const FontBinary& GetBinary() const;

    //-------------------------------------------------------------------------
    //! @brief      グリフを検索します.
    //! 
    //! @param[in]      unicode     ユニコード文字.
    //! @param[out]     info        描画情報.
    //! @retval true    検索にヒット.
    //! @retval false   見つからなかった.
    //-------------------------------------------------------------------------
    bool Find(uint32_t unicode, DrawInfo& info) const;

    //-------------------------------------------------------------------------
    //! @brief      文字列の幅を計算します.
    //! 
    //! @param[in]      text        文字列.
    //! @param[in]      scale       スケール値.
    //-------------------------------------------------------------------------
    int CalcWidth(const char* text, float scale = 1.0f) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    FontBinary      m_Binary;       //!< フォントバイナリです.
    Texture*        m_Texture;      //!< フォントテクスチャです.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// FontRenderer class
///////////////////////////////////////////////////////////////////////////////
class FontRenderer
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static FontRenderer& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理です.
    //! 
    //! @param[in]      renderer        スプライトレンダラーです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(SpriteRenderer& renderer);

    //-------------------------------------------------------------------------
    //! @brief      終了処理です.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[out]     outX            文字描画後のX成分
    //! @param[out]     outY            文字描画後のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, int* outX, int* outY, const char* text);

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, const char* text)
    { Add(renderer, font, x, y, layer, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, const char* text)
    { Add(renderer, font, x, y, 0, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[out]     outX            文字描画後のX成分
    //! @param[out]     outY            文字描画後のY成分.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, int* outX, int* outY, const char* format, ...);

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, const char* format, ...);

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, const char* format, ...);

#if _HAS_CXX20
    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[out]     outX            文字描画後のX成分
    //! @param[out]     outY            文字描画後のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, int* outX, int* outY, const char8_t* text);

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, const char8_t* text)
    { Add(renderer, font, x, y, layer, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      フォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      text            文字列.
    //-------------------------------------------------------------------------
    void Add(SpriteRenderer& renderer, const Font& font, int x, int y, const char8_t* text)
    { Add(renderer, font, x, y, 0, nullptr, nullptr, text); }

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[out]     outX            文字描画後のX成分
    //! @param[out]     outY            文字描画後のY成分.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, int* outX, int* outY, const char8_t* format, ...);

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      layer           奥行方向.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, int layer, const char8_t* format, ...);

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを指定してフォントスプライトを追加します.
    //! 
    //! @param[in]      renderer        スプライトレンダラー.
    //! @param[in]      font            フォント.
    //! @param[in]      x               描画位置のX成分.
    //! @param[in]      y               描画位置のY成分.
    //! @param[in]      format          書式指定子.
    //-------------------------------------------------------------------------
    void AddFormat(SpriteRenderer& renderer, const Font& font, int x, int y, const char8_t* format, ...);
#endif

    //-------------------------------------------------------------------------
    //! @brief      パイプラインステートを設定します.
    //! 
    //! @param[in]      renderer    スプライトレンダラーです.
    //! @param[in]      font        フォントです.
    //-------------------------------------------------------------------------
    void SetState(SpriteRenderer& renderer, const Font& font);

    //-------------------------------------------------------------------------
    //! @brief      スケールを設定します.
    //! 
    //! @param[in]      value       設定するスケール値.
    //-------------------------------------------------------------------------
    void SetScale(float value);

    //-------------------------------------------------------------------------
    //! @brief      スケール値を取得します.
    //! 
    //! @return     スケール値を返却します.
    //-------------------------------------------------------------------------
    float GetScale() const;

    //-------------------------------------------------------------------------
    //! @brief      アウター描画の有効・無効を設定します.
    //! 
    //! @param[in]      value       アウター描画を有効にする場合は true.
    //-------------------------------------------------------------------------
    void SetEnableOuter(bool value);

    //-------------------------------------------------------------------------
    //! @brief      アウター描画が有効かチェックします.
    //! 
    //! @retval true    アウター描画が有効です.
    //! @retval false   アウター描画が無効です.
    //-------------------------------------------------------------------------
    bool IsEnableOuter() const;

    //-------------------------------------------------------------------------
    //! @brief      アウターオフセットの有効・無効を設定します.
    //! 
    //! @param[in]      value       アウターオフセットを有効にする場合は true.
    //-------------------------------------------------------------------------
    void SetEnableOffset(bool value);

    //-------------------------------------------------------------------------
    //! @brief      アウターオフセットが有効かチェックします.
    //! 
    //! @retval true    アウターオフセットが有効です.
    //! @retval false   アウターオフセットが無効です.
    //-------------------------------------------------------------------------
    bool IsEnableOffset() const;

    //-------------------------------------------------------------------------
    //! @brief      アウターオフセットを設定します.
    //! 
    //! @param[in]      x       X成分のオフセット.
    //! @param[in]      y       Y成分のオフセット.
    //-------------------------------------------------------------------------
    void SetOuterOffset(float x, float y);

    //-------------------------------------------------------------------------
    //! @brief      X成分のアウターオフセットを取得します.
    //! 
    //! @return     X成分のアウターオフセットを取得します.
    //-------------------------------------------------------------------------
    float GetOuterOffsetX() const;

    //-------------------------------------------------------------------------
    //! @brief      Y成分のアウターオフセットを取得します.
    //! 
    //! @return     Y成分のアウターオフセットを取得します.
    //-------------------------------------------------------------------------
    float GetOuterOffsetY() const;

    //-------------------------------------------------------------------------
    //! @brief      アウターカラーを設定します.
    //! 
    //! @param[in]      r       R成分.
    //! @param[in]      g       G成分.
    //! @param[in]      b       B成分.
    //! @param[in]      a       A成分.
    //-------------------------------------------------------------------------
    void SetOuterColor(float r, float g, float b, float a);

    //-------------------------------------------------------------------------
    //! @brief      アウターカラーを設定します.
    //! 
    //! @param[in]      r       R成分.
    //! @param[in]      g       G成分.
    //! @param[in]      b       B成分.
    //! @param[in]      a       A成分.
    //-------------------------------------------------------------------------
    void SetOuterColor(uint8_t r, uint8_t g, uint8_t b, uint8_t a);

    //-------------------------------------------------------------------------
    //! @brief      アウターカラーを設定します.
    //! 
    //! @param[in]      color       カラー値(r:32-24, g:24-16, b:16-8, a:8-0).
    //-------------------------------------------------------------------------
    void SetOuterColor(uint32_t color);

    //-------------------------------------------------------------------------
    //! @brief      アウターカラーを取得します.
    //! 
    //! @return     アウターカラーを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetOuterColor() const;

    //-------------------------------------------------------------------------
    //! @brief      シェーダパラメータを取得します.
    //! 
    //! @return     シェーダパラメータを返却します.
    //-------------------------------------------------------------------------
    const void* GetParam() const;

    //-------------------------------------------------------------------------
    //! @brief      LinearClampサンプラーを取得します.
    //! 
    //! @return     LinearClampサンプラーを返却します.
    //-------------------------------------------------------------------------
    const Sampler& GetSampler() const;

private:
    ///////////////////////////////////////////////////////////////////////////
    // Param structure
    ///////////////////////////////////////////////////////////////////////////
    struct Param
    {
        uint32_t EnableOuter   : 1;
        uint32_t EnableOffset  : 1;
        uint32_t ReservedFlags : 30;
        float    OuterOffsetX;
        float    OuterOffsetY;
        uint32_t OuterColor;
    };
    static_assert(sizeof(Param) == sizeof(uint32_t) * 4);

    //=========================================================================
    // private variables.
    //=========================================================================
    static FontRenderer             s_Instance;         //!< シングルトンインスタンスです.
    RefPtr<ID3D12PipelineState>     m_PipelineState;    //!< パイプラインステートです.
    Sampler                         m_LinearClamp;      //!< リニアクランプ.
    float                           m_Scale = 1.0f;     //!< フォントスケールです.
    Param                           m_Param = {};

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    FontRenderer();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~FontRenderer();

    FontRenderer             (const FontRenderer&) = delete;
    FontRenderer& operator = (const FontRenderer&) = delete;
};

} // namespace asdx
