//-----------------------------------------------------------------------------
// File : asdxTextureManager.h
// Desc : Texture Manager.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <unordered_map>
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxSpinLock.h>
#include <fnd/asdxResHolder.h>


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
class  Texture;
struct ResTexture;
class  TextureManager;

//-----------------------------------------------------------------------------
// Type Alias.
//-----------------------------------------------------------------------------
using TextureHolder = ResHolder<Texture, TextureManager>;


///////////////////////////////////////////////////////////////////////////////
// TextureManager class
///////////////////////////////////////////////////////////////////////////////
class TextureManager
{
    //=========================================================================
    // list of friend classe and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static TextureManager& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init();

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを生成または取得します.
    //! 
    //! @param[in]      path        ファイルパス(フルパス).
    //! @return     テクスチャホルダーを返却します.
    //-------------------------------------------------------------------------
    TextureHolder GetOrCreate(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを削除します.
    //! 
    //! @param[in]      holder      テクスチャホルダー.
    //-------------------------------------------------------------------------
    void Remove(TextureHolder& holder);

    //-------------------------------------------------------------------------
    //! @brief      コマンドリストを入れ替えます.
    //! 
    //! @return     アップデートコマンドが登録されているコマンドリストを返却します.
    //-------------------------------------------------------------------------
    ID3D12GraphicsCommandList* Swap();

    //-------------------------------------------------------------------------
    //! @brief      更新コマンドを持つかどうかチェックします.
    //! 
    //! @retval true    更新コマンドを持ちます.
    //! @retval fasle   更新コマンドを持ちません.
    //-------------------------------------------------------------------------
    bool HasCommand() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを生成します.
    //! 
    //! @param[in]      resource        リソーステクスチャ.
    //! @param[out]     ppTexture       テクスチャの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    bool CreateTexture(ResTexture& resource, Texture** ppTexture);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static TextureManager                   s_Instance;
    SpinLock                                m_SpinLock;
    std::unordered_map<uint64_t, Texture*>  m_Textures;
    RefPtr<ID3D12GraphicsCommandList>       m_CmdList[2];
    RefPtr<ID3D12CommandAllocator>          m_CmdAllocator[2];
    uint8_t                                 m_BufferIndex = 0;
    bool                                    m_Initialized = false;
    bool                                    m_HasCommand  = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    TextureManager();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~TextureManager();

    //-------------------------------------------------------------------------
    //! @brief      デフォルトテクスチャを生成します.
    //-------------------------------------------------------------------------
    void CreateDefaultTextures();

    TextureManager              (const TextureManager&) = delete;
    TextureManager& operator =  (const TextureManager&) = delete;
};

} // namespace asdx
