//-----------------------------------------------------------------------------
// File : asdxUploadResource.h
// Desc : Upload Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <core/asdxRef.h>
#include <res/asdxResTexture.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// IUploadResource interface
///////////////////////////////////////////////////////////////////////////////
struct IUploadResource : public IReference
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IUploadResource() 
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      アップロードコマンドを発行します.
    //!
    //! @param[in]      pCmdList        コマンドリスト.
    //-------------------------------------------------------------------------
    virtual void Upload(ID3D12GraphicsCommandList* pCmdList) = 0;
};

///////////////////////////////////////////////////////////////////////////////
// IUploadTexture interface
///////////////////////////////////////////////////////////////////////////////
struct IUploadTexture : public IUploadResource
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IUploadTexture()
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      リソースを更新します.
    //-------------------------------------------------------------------------
    virtual void Update(const ResTexture& resource) = 0;
};

///////////////////////////////////////////////////////////////////////////////
// IUploadBuffer interface
///////////////////////////////////////////////////////////////////////////////
struct IUploadBuffer : public IUploadResource
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~IUploadBuffer()
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      リソースを更新します.
    //-------------------------------------------------------------------------
    virtual void Update(const void* resource) = 0;
};

//-----------------------------------------------------------------------------
//! @brief      アップロードテクスチャリソースを生成します.
//! 
//! @param[in]      pDest       転送先リソースです.
//! @param[in]      resource    テクスチャリソース.
//! @param[out]     ppResource  格納先.
//! @retval true    生成に成功.
//! @retval fasle   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateUploadTexture(
    ID3D12Resource*     pDest,
    const ResTexture&   resource,
    IUploadTexture**    ppResource);

//-----------------------------------------------------------------------------
//! @brief      アップロードバッファリソースを生成します.
//! 
//! @param[in]      pDest       転送先リソースです.
//! @param[in]      resource    リソース
//! @param[out]     ppResource  格納先
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-----------------------------------------------------------------------------
bool CreateUploadBuffer(
    ID3D12Resource* pDest,
    const void*     resource,
    IUploadBuffer** ppResource);


} // namespace asdx