//-----------------------------------------------------------------------------
// File : asdxIBLBaker.h
// Desc : IBL Baker.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <gfx/asdxTarget.h>
#include <gfx/asdxPipelineState.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// IBLBaker class
///////////////////////////////////////////////////////////////////////////////
class IBLBaker
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    IBLBaker();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~IBLBaker();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init();

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      ベイク処理を行います.
    //! 
    //! @param[in]      pCmd        コマンドリスト.
    //! @param[in]      diffuseLD   DiffuseLDスフィアマップ.
    //! @param[in]      specularLD  SpecularLDスフィアマップ.
    //! @param[in]      handleSRV   環境マップ.
    //-------------------------------------------------------------------------
    void Bake(
        ID3D12GraphicsCommandList*  pCmd,
        ComputeTarget&              diffuseLD,
        ComputeTarget&              specularLD,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12RootSignature>     m_RootSignature;
    RefPtr<ID3D12PipelineState>     m_DiffuseState;
    RefPtr<ID3D12PipelineState>     m_SpecularState;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      DiffuseLD項をベイクします.
    //! 
    //! @param[in]      pCmd        コマンドリスト
    //! @param[in]      diffuseLD   DiffuseLDスフィアマップ.
    //! @param[in]      handleSRV   環境マップ.
    //-------------------------------------------------------------------------
    void BakeDiffuse(
        ID3D12GraphicsCommandList*  pCmd,
        ComputeTarget&              diffuseLD,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

    //-------------------------------------------------------------------------
    //! @brief      SpecularLD項をベイクします.
    //! 
    //! @param[in]      pCmd        コマンドリスト
    //! @param[in]      specularLD  SpecularLDスフィアマップ.
    //! @param[in]      handleSRV   環境マップ.
    //-------------------------------------------------------------------------
    void BakeSpecular(
        ID3D12GraphicsCommandList*  pCmd,
        ComputeTarget&              specularLD,
        uint32_t                    width,
        uint32_t                    height,
        D3D12_GPU_DESCRIPTOR_HANDLE handleSRV);

};

} // namespace asdx
