//-----------------------------------------------------------------------------
// File : asdxKawaseBloomEffect.h
// Desc : Kawase's Bloom Effect.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>
#include <fnd/asdxRef.h>
#include <fnd/asdxMath.h>
#include <gfx/asdxTarget.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// KawaseBloomEffect class
///////////////////////////////////////////////////////////////////////////////
class KawaseBloomEffect
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Param structure
    ///////////////////////////////////////////////////////////////////////////
    struct Param
    {
        float   Threshold       = 1.0f;
        float   BloomStrength   = 2.0f;
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    KawaseBloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~KawaseBloomEffect();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //! @param[in]      format  フォーマット.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t w, uint32_t h, DXGI_FORMAT format);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      w       横幅.
    //! @param[in]      h       縦幅.
    //-------------------------------------------------------------------------
    void Resize(uint32_t w, uint32_t h);

    //-------------------------------------------------------------------------
    //! @brief      制御パラメータを設定します.
    //! 
    //! @param[in]      param       設定するパラメータ.
    //-------------------------------------------------------------------------
    void SetParam(const Param& param);

    //-------------------------------------------------------------------------
    //! @brief      制御パラメータを取得します.
    //! 
    //! @return     制御パラメータを返却します.
    //-------------------------------------------------------------------------
    const Param& GetParam() const;

    //-------------------------------------------------------------------------
    //! @brief      エフェクトを適用します.
    //! 
    //! @param[in]      pCmd        グラフィックスコマンドリスト.
    //! @param[in]      width       SRVの横幅.
    //! @param[in]      height      SRVの縦幅.
    //! @param[in]      handleSRV   入力SRV.
    //-------------------------------------------------------------------------
    void Dispatch(
        ID3D12GraphicsCommandList* pCmd,
        uint32_t width,
        uint32_t height,
        D3D12_GPU_DESCRIPTOR_HANDLE handlSRV);

    //-------------------------------------------------------------------------
    //! @brief      SRVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     SRVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleSRV(uint8_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      UAVハンドルを取得します.
    //! 
    //! @param[in]      index       インデックスです.
    //! @return     UAVハンドルを返却します.
    //-------------------------------------------------------------------------
    D3D12_GPU_DESCRIPTOR_HANDLE GetGpuHandleUAV(uint8_t index) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static const uint8_t            kMaxTargetCount = 10;                   //!< 最大ターゲット数.
    RefPtr<ID3D12RootSignature>     m_RootSignature;                        //!< ルートシグニチャ.
    RefPtr<ID3D12PipelineState>     m_BloomFirstPassPSO;                    //!< ブルームパイプラインステート.
    RefPtr<ID3D12PipelineState>     m_BloomDownPassPSO;                     //!< ブルームパイプラインステート.
    RefPtr<ID3D12PipelineState>     m_BloomCompositePSO;                    //!< ブルームパイプラインステート.
    ComputeTarget                   m_ComputeTarget[kMaxTargetCount];       //!< コンピュートターゲット.
    D3D12_RESOURCE_STATES           m_TargetStates[kMaxTargetCount] = {};   //!< ターゲットステート.
    Param                           m_Param;                                //!< 制御パラメータ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
