//-----------------------------------------------------------------------------
// File : asdxResHashString.h
// Desc : Hash String.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ResHashString structure
///////////////////////////////////////////////////////////////////////////////
struct ResHashString
{
    uint64_t    Hash;   //!< 名前のハッシュ値.
    StringView  View;   //!< 名前の文字列.
};

} // namespace asdx
