//-----------------------------------------------------------------------------
// File : asdxResMotion.h
// Desc : Motion Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxMath.h>


//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
namespace asdx::res { struct MotionTrack; }
namespace asdx::res { struct MotionClip; }


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MotionBinary class
///////////////////////////////////////////////////////////////////////////////
class MotionBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MotionBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MotionBinary();

    //-------------------------------------------------------------------------
    //! @brief      ロード処理を行います.
    //! 
    //! @param[in]      blob        バイナリデータ.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      クリップ数を取得します.
    //! 
    //! @return     クリップ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetClipCount() const;

    //-------------------------------------------------------------------------
    //! @brief      クリップを取得します.
    //! 
    //! @param[in]      index       クリップ番号.
    //! @return     クリップを返却します.
    //-------------------------------------------------------------------------
    const res::MotionClip* GetClip(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      ルート変換行列を取得します.
    //! 
    //! @return     ルート変換行列を返却します.
    //-------------------------------------------------------------------------
    Matrix GetRootTransform() const;

    //-------------------------------------------------------------------------
    //! @brief      クリップを検索します.
    //! 
    //! @param[in]      name        クリップ名.
    //! @return     クリップを返却します.
    //-------------------------------------------------------------------------
    const res::MotionClip* FindClip(const char* name) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// MotionTrackProxy class
///////////////////////////////////////////////////////////////////////////////
class MotionTrackProxy
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //-------------------------------------------------------------------------
    //! @brief      トラック名を取得します.
    //! 
    //! @param[in]      track       モーショントラック.
    //! @return     トラック名を返却します.
    //-------------------------------------------------------------------------
    static const char* GetName(const res::MotionTrack* track);

    //-------------------------------------------------------------------------
    //! @brief      平行移動アニメーションキーフレームを検索します.
    //! 
    //! @param[in]      track       モーショントラック
    //! @param[in]      timeSec     アニメーション時間[秒].
    //! @return     平行移動値を返却します.
    //-------------------------------------------------------------------------
    static Vector3 FindTranslationKey(const res::MotionTrack* track, float timeSec);

    //-------------------------------------------------------------------------
    //! @brief      回転アニメーションキーフレームを検索します.
    //! 
    //! @param[in]      track       モーショントラック.
    //! @param[in]      timeSec     アニメーション時間[秒].
    //! @return     回転値を返却します.
    //-------------------------------------------------------------------------
    static Quaternion FindRotationKey(const res::MotionTrack* track, float timeSec);

    //-------------------------------------------------------------------------
    //! @brief      拡縮アニメーションキーフレームを検索します.
    //! 
    //! @param[in]      track       モーショントラック.
    //! @param[in]      timeSec     アニメーション時間[秒]
    //! @return     拡縮値を返却します.
    //-------------------------------------------------------------------------
    static Vector3 FindScaleKey(const res::MotionTrack* track, float timeSec);

    //-------------------------------------------------------------------------
    //! @brief      ローカル変換行列を計算します.
    //! 
    //! @param[in]      track       モーショントラック.
    //! @param[in]      timeSec     アニメーション時間[秒]:
    //! @return     ローカル変換行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CalcLocalTransform(const res::MotionTrack* track, float timeSec);

    //-------------------------------------------------------------------------
    //! @brief      ローカル変換行列をスケール無しで計算します.
    //! 
    //! @param[in]      track       モーショントラック.
    //! @param[in]      timeSec     アニメーション時間[秒]:
    //! @return     ローカル変換行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CalcLocalTransformNoScale(const res::MotionTrack* track, float timeSec);
};

///////////////////////////////////////////////////////////////////////////////
// MotionClipProxy class
///////////////////////////////////////////////////////////////////////////////
class MotionClipProxy
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //-------------------------------------------------------------------------
    //! @brief      クリップ名を取得します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @return     クリップ名を返却します.
    //-------------------------------------------------------------------------
    static const char* GetName(const res::MotionClip* clip);

    //-------------------------------------------------------------------------
    //! @brief      アニメーション間隔を取得します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @return     アニメーション間隔を返却します.
    //-------------------------------------------------------------------------
    static float GetDuration(const res::MotionClip* clip);

    //-------------------------------------------------------------------------
    //! @brief      1秒あたりの処理時間を取得します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @return     1秒あたりの処理時間(TPS)を返却します.
    //-------------------------------------------------------------------------
    static float GetTicksPerSecond(const res::MotionClip* clip);

    //-------------------------------------------------------------------------
    //! @brief      モーショントラック数を取得します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @return     モーショントラック数を返却します.
    //-------------------------------------------------------------------------
    static uint32_t GetTrackCount(const res::MotionClip* clip);

    //-------------------------------------------------------------------------
    //! @brief      モーショントラックを取得します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @param[in]      index       トラック番号.
    //! @return     モーショントラックを返却します.
    //! @note       トラック番号はボーン番号に対応し，ボーンアニメーションデータを返却します.
    //-------------------------------------------------------------------------
    static const res::MotionTrack* GetTrack(const res::MotionClip* clip, uint32_t index);

    //-------------------------------------------------------------------------
    //! @brief      モーションを検索します.
    //! 
    //! @param[in]      clip        アニメーションクリップ.
    //! @param[in]      name        トラック名.
    //! @return     モーショントラックを返却します.
    //! @note       トラック名はボーン名に対応し，ボーンアニメーションデータを返却します.
    //-------------------------------------------------------------------------
    static const res::MotionTrack* FindTrack(const res::MotionClip* clip, const char* name);
};

} // namespace asdx
