//-----------------------------------------------------------------------------
// File : asdxResMaterial.h
// Desc : Material Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxMath.h>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ResMaterial structure
///////////////////////////////////////////////////////////////////////////////
struct ResMaterial
{
    StringView  BindName;           //!< バインド名.
    StringView  BaseColorMap;       //!< ベースカラーマップのファイルパス.
    StringView  NormalMap;          //!< 法線マップのファイルパス.
    StringView  OrmMap;             //!< オクルージョン/ラフネス/メタルネスマップのファイルパス.
    StringView  EmissiveMap;        //!< エミッシブマップのファイルパス.
    Vector3     BaseColorFactor;    //!< ベースカラーファクター.
    float       OcclusionFactor;    //!< オクルージョンファクター.
    float       RoughnessFactor;    //!< ラフネスファクター.
    float       MetalnessFactor;    //!< メタルネスファクター.
    Vector3     EmissiveFactor;     //!< エミッシブファクター.
    float       Ior;                //!< 屈折率.
    float       AlphaThreshold;     //!< アルファテスト値.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialBinary class
///////////////////////////////////////////////////////////////////////////////
class MaterialBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      メモリからロードします.
    //! 
    //! @param[in]      blob        バイナリラージオブジェクト.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetMaterialCount() const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @return     マテリアルを返却します.
    //-------------------------------------------------------------------------
    ResMaterial GetMaterial(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを検索します.
    //! 
    //! @param[in]      name        検索するマテリアル名.
    //! @param[out]     material    マテリアルの格納先.
    //! @retval true    検索にヒット.
    //! @retval false   見つかりませんでした.
    //-------------------------------------------------------------------------
    bool FindMaterial(const char* name, ResMaterial& material) const;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル番号を検索します.
    //! 
    //! @param[in]      name            検索するマテリアル名.
    //! @param[out]     materialId      マテリアル番号の格納先.
    //! @retval true    検索にヒット.
    //! @retval fasle   見つかりませんでした.
    //-------------------------------------------------------------------------
    bool FindMaterialId(const char* name, uint32_t& materialId) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
