//-----------------------------------------------------------------------------
// File : asdxResBone.h
// Desc : Bone Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <fnd/asdxMath.h>
#include <fnd/asdxArrayView.h>


namespace asdx {

//-----------------------------------------------------------------------------
// Type Alias.
//-----------------------------------------------------------------------------
using BoneId = int32_t;


///////////////////////////////////////////////////////////////////////////////
// ResBone structure
///////////////////////////////////////////////////////////////////////////////
struct ResBone
{
    uint64_t            Hash;           //!< ボーン名のハッシュ.
    BoneId              Parent;         //!< 親ボーンID. (親がいない場合は -1).
    Matrix4x3           BindPose;       //!< バインドポーズ行列.
    Matrix4x3           InvBindPose;    //!< 逆バインドポーズ行列.
    ArrayView<BoneId>   Children;       //!< 子ボーンID.
};

} // namespace asdx 
