//-----------------------------------------------------------------------------
// File : asdxResMaterial.h
// Desc : Material Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MaterialBlendState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialBlendState : uint8_t
{
    Opaque,         //!< 不透明.
    AlphaBlend,     //!< アルファブレンド.
    Additive,       //!< 加算.
    Subtract,       //!< 減算.
    Premultiplied,  //!< 事前乗算済みアルファ.
    Multiply,       //!< 乗算.
    Screen,         //!< スクリーン.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialDepthState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialDepthState : uint8_t
{
    ReadWrite,  //!< 深度テスト ON,  深度書き込み ON.
    ReadOnly,   //!< 深度テスト ON,  深度書き込み OFF.
    WriteOnly,  //!< 深度テスト OFF, 深度書き込み ON.
    None,       //!< 深度テスト OFF, 深度書き込み OFF.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialRasterizerState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialRasterizerState : uint8_t
{
    CullNone,   //!< カリングしない.
    CullBack,   //!< 背面カリング.
    CullFront,  //!< 前面カリング.
    Wireframe,  //!< ワイヤーフレーム.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialRenderState structure
///////////////////////////////////////////////////////////////////////////////
struct MaterialRenderState
{
    MaterialBlendState      Blend;          //!< ブレンドステート.
    MaterialDepthState      Depth;          //!< 深度ステート.
    MaterialRasterizerState Rasterizer;     //!< ラスタライザーステート.
    uint8_t                 UserFlags;      //!< ユーザーフラグ.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialBuffer structure
///////////////////////////////////////////////////////////////////////////////
struct MaterialBuffer
{
    StringView  Name;       //!< シェーダ上のバッファ名.
    uint32_t    Size;       //!< バッファサイズ.
    const void* pData;      //!< バッファデータ.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialTexture structure
///////////////////////////////////////////////////////////////////////////////
struct MaterialTexture
{
    StringView  Name;       //!< シェーダ上のテクスチャ名.
    StringView  Path;       //!< テクスチャファイルパス.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialBinary structure
///////////////////////////////////////////////////////////////////////////////
class MaterialBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      ロード処理を行います.
    //! 
    //! @param[in]      blob        バイナリデータ.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      バッファ数を取得します.
    //! 
    //! @return     バッファ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetBufferCount() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ数を取得します.
    //! 
    //! @return     テクスチャ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTextureCount() const;

    //-------------------------------------------------------------------------
    //! @brief      レンダーステートを取得します.
    //! 
    //! @return     レンダーステートを返却します.
    //-------------------------------------------------------------------------
    MaterialRenderState GetRenderState() const;

    //-------------------------------------------------------------------------
    //! @brief      バッファを取得します.
    //! 
    //! @param[in]      index       バッファ番号.
    //! @return     バッファを返却します.
    //-------------------------------------------------------------------------
    MaterialBuffer GetBuffer(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     テクスチャを返却します.
    //-------------------------------------------------------------------------
    MaterialTexture GetTexture(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      バッファを検索します.
    //! 
    //! @param[in]      name        バッファ名.
    //! @param[out]     index       バッファ番号.
    //! @retval true    検索にヒット.
    //! @retval false   見つからなかった.
    //-------------------------------------------------------------------------
    bool FindBuffer(const char* name, uint32_t& index) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを検索します.
    //! 
    //! @param[in]      name            テクスチャ名.
    //! @param[out]     index           テクスチャ番号.
    //! @retval true    検索にヒット.
    //! @retval false   見つからなかった.
    //-------------------------------------------------------------------------
    bool FindTexture(const char* name, uint32_t& index) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
