//-----------------------------------------------------------------------------
// File : asdxResNamePair.h
// Desc : Name Pair.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ResNamePair structure
///////////////////////////////////////////////////////////////////////////////
struct ResNamePair
{
    uint64_t    Hash;   //!< 名前のハッシュ値.
    StringView  Name;   //!< 名前の文字列.
};

} // namespace asdx
