//-----------------------------------------------------------------------------
// File : asdxResMaterial.h
// Desc : Material Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxStringView.h>
#include <fnd/asdxArrayView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MaterialBlendType enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialBlendType
{
    Opaque,         //!< 不透明.
    Masked,         //!< アルファ抜き.
    AlphaBlend,     //!< アルファブレンド.
    Additive,       //!< 加算ブレンド.
    Subtract,       //!< 減算ブレンド.
    Premultiplied,  //!< 事前乗算済みアルファ.
    Multiply,       //!< 乗算ブレンド.
    Screen          //!< スクリーン.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialCullType enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialCullType
{
    CullNone,   //!< カリングなし.
    CullBack,   //!< 背面カリング.
    CullFront,  //!< 前面カリング.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialDepthType enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialDepthType
{
    ReadWrite,  //!< 深度書き込みON,  深度テストON.
    ReadOnly,   //!< 深度書き込みOFF, 深度テストON.
    WriteOnly,  //!< 深度書き込みON,  深度テストOFF.
    DepthNone,  //!< 深度書き込みOFF, 深度テストOFF.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialDataType enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialDataType
{
    Bool,       //!< ブール型(シェーダなので4byte).
    Sint,       //!< 符号付き整数型.
    Uint,       //!< 符号なし整数型.
    Float,      //!< 浮動小数点型.
};

///////////////////////////////////////////////////////////////////////////////
// ResMaterialProperty structure
///////////////////////////////////////////////////////////////////////////////
struct ResMaterialProperty
{
    StringView          Name;       //!< プロパティ名.
    MaterialDataType    Type;       //!< データ型.
    uint32_t            Elements;   //!< 要素数.
    uint32_t            Offset;     //!< 書き込みオフセット.
    ArrayView<uint8_t>  Value;      //!< データ値.
};

///////////////////////////////////////////////////////////////////////////////
// ResMaterialTexture structure
///////////////////////////////////////////////////////////////////////////////
struct ResMaterialTexture
{
    StringView      BindName;       //!< バインド名(シェーダ上のテクスチャ名).
    StringView      Path;           //!< テクスチャファイルパス.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialBinary class
///////////////////////////////////////////////////////////////////////////////
class MaterialBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      メモリからロードします.
    //! 
    //! @param[in]      blob        バイナリラージオブジェクト.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      プロパティ数を取得します.
    //! 
    //! @return     プロパティ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetPropertyCount() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ数を取得します.
    //! 
    //! @return     テクスチャ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTextureCount() const;

    //-------------------------------------------------------------------------
    //! @brief      ブレンドタイプを取得します.
    //! 
    //! @return     ブレンドタイプを返却します.
    //-------------------------------------------------------------------------
    MaterialBlendType GetBlendType() const;

    //-------------------------------------------------------------------------
    //! @brief      カリングタイプを取得します.
    //! 
    //! @return     カリングタイプを返却します.
    //-------------------------------------------------------------------------
    MaterialCullType GetCullType() const;

    //-------------------------------------------------------------------------
    //! @brief      深度タイプを取得します.
    //! 
    //! @return     深度タイプを返却します.
    //-------------------------------------------------------------------------
    MaterialDepthType GetDepthType() const;

    //-------------------------------------------------------------------------
    //! @brief      定数バッファサイズを取得します.
    //! 
    //! @return     定数バッファサイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetBufferSize() const;

    //-------------------------------------------------------------------------
    //! @brief      プロパティを取得します.
    //! 
    //! @param[in]      index       プロパティ番号.
    //! @return     プロパティを返却します.
    //-------------------------------------------------------------------------
    ResMaterialProperty GetProperty(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     テクスチャを返却します.
    //-------------------------------------------------------------------------
    ResMaterialTexture GetTexture(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      プロパティを検索します.
    //! 
    //! @param[in]      name        プロパティ名.
    //! @param[out]     prop        プロパティの格納先.
    //! @retval true    検索に成功.
    //! @retval false   検索に失敗.
    //-------------------------------------------------------------------------
    bool FindProperty(const char* name, ResMaterialProperty& prop) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを検索します.
    //! 
    //! @param[in]      name        テクスチャ名.
    //! @param[out]     texture     テクスチャの格納先.
    //! @retval true    検索に成功.
    //! @retval false   検索に失敗.
    //-------------------------------------------------------------------------
    bool FindTexture(const char* name, ResMaterialTexture& texture) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
