//-----------------------------------------------------------------------------
// File : asdxResMaterial.h
// Desc : Material Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// MaterialBlendState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialBlendState : uint8_t
{
    Opaque,         //!< 不透明.
    AlphaBlend,     //!< アルファブレンド.
    Additive,       //!< 加算.
    Subtract,       //!< 減算.
    Premultiplied,  //!< 事前乗算済みアルファ.
    Multiply,       //!< 乗算.
    Screen,         //!< スクリーン.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialDepthState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialDepthState : uint8_t
{
    ReadWrite,  //!< 深度テスト ON,  深度書き込み ON.
    ReadOnly,   //!< 深度テスト ON,  深度書き込み OFF.
    WriteOnly,  //!< 深度テスト OFF, 深度書き込み ON.
    None,       //!< 深度テスト OFF, 深度書き込み OFF.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialRasterizerState enum
///////////////////////////////////////////////////////////////////////////////
enum MaterialRasterizerState : uint8_t
{
    CullNone,   //!< カリングしない.
    CullBack,   //!< 背面カリング.
    CullFront,  //!< 前面カリング.
    Wireframe,  //!< ワイヤーフレーム.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialTexture structure
///////////////////////////////////////////////////////////////////////////////
struct MaterialTexture
{
    StringView  Name;       //!< シェーダ上のテクスチャ名.
    StringView  Path;       //!< テクスチャファイルパス.
};

///////////////////////////////////////////////////////////////////////////////
// MaterialParameter structure
///////////////////////////////////////////////////////////////////////////////
struct MaterialParameter
{
    StringView  Name;
    float       Value;
};

///////////////////////////////////////////////////////////////////////////////
// MaterialBinary structure
///////////////////////////////////////////////////////////////////////////////
class MaterialBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MaterialBinary();

    //-------------------------------------------------------------------------
    //! @brief      ロード処理を行います.
    //! 
    //! @param[in]      blob        バイナリデータ.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      マテリアル種別を取得します.
    //! 
    //! @return     マテリアル種別を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetKind() const;

    //-------------------------------------------------------------------------
    //! @brief      ブレンドステートを取得します.
    //! 
    //! @return     ブレンドステートを返却します.
    //-------------------------------------------------------------------------
    MaterialBlendState GetBlendState() const;

    //-------------------------------------------------------------------------
    //! @brief      深度ステートを取得します.
    //! 
    //! @return     深度ステートを返却します.
    //-------------------------------------------------------------------------
    MaterialDepthState GetDepthState() const;

    //-------------------------------------------------------------------------
    //! @brief      ラスタライザーステートを取得します.
    //! 
    //! @return     ラスタライザーステートを返却します.
    //-------------------------------------------------------------------------
    MaterialRasterizerState GetRasterizerState() const;

    //-------------------------------------------------------------------------
    //! @brief      パラメータ数を取得します.
    //! 
    //! @return     パラメータ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetParameterCount() const;

    //-------------------------------------------------------------------------
    //! @brief      パラメータを取得します.
    //! 
    //! @param[in]      index       パラメータ番号.
    //! @return     パラメータを返却します.
    //-------------------------------------------------------------------------
    MaterialParameter GetParameter(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ数を取得します.
    //! 
    //! @return     テクスチャ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTextureCount() const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを取得します.
    //! 
    //! @param[in]      index       テクスチャ番号.
    //! @return     テクスチャを返却します.
    //-------------------------------------------------------------------------
    MaterialTexture GetTexture(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      パラメータを検索します.
    //! 
    //! @param[in]      name        パラメータ名.
    //! @param[out]     index       パラメータ番号.
    //! @retval true    検索成功.
    //! @retval false   検索失敗.
    //-------------------------------------------------------------------------
    bool FindParameter(const char* name, uint32_t& index) const;

    //-------------------------------------------------------------------------
    //! @brief      パラメータを検索します.
    //! 
    //! @param[in]      name        パラメータ名.
    //! @param[out]     result      パラメータ格納先.
    //! @retval true    検索成功.
    //! @retval false   検索失敗.
    //-------------------------------------------------------------------------
    bool FindParameter(const char* name, MaterialParameter& result) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを検索します.
    //! 
    //! @param[in]      name            テクスチャ名.
    //! @param[out]     index           テクスチャ番号.
    //! @retval true    検索成功.
    //! @retval false   検索失敗.
    //-------------------------------------------------------------------------
    bool FindTexture(const char* name, uint32_t& index) const;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャを検索します.
    //! 
    //! @param[in]      name            テクスチャ名.
    //! @param[out]     result          テクスチャ格納先.
    //! @retval true    検索成功.
    //! @retval false   検索失敗.
    //-------------------------------------------------------------------------
    bool FindTexture(const char* name, MaterialTexture& result) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
