//-----------------------------------------------------------------------------
// File : asdxResMapChip.h
// Desc : Map Chip Resource.
// Copyrighgt(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <vector>
#include <fnd/asdxArrayView.h>
#include <fnd/asdxMath.h>
#include <fnd/asdxStringView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ResChipFrame structure
///////////////////////////////////////////////////////////////////////////////
struct ResChipFrame
{
    uint16_t    Id;         //!< マップチップ番号.
    uint16_t    Reserved;
    float       DurationMs; //!< 継続時間(ミリ秒).
};

///////////////////////////////////////////////////////////////////////////////
// ResChipProperty structure
///////////////////////////////////////////////////////////////////////////////
struct ResChipProperty
{
    uint16_t                Id;         //!< マップチップ番号.
    bool                    Collision;  //!< コリジョン.
    ArrayView<ResChipFrame> Frames;     //!< アニメーションフレーム.
};

///////////////////////////////////////////////////////////////////////////////
// ResTileSet structure
///////////////////////////////////////////////////////////////////////////////
struct ResTileSet
{
    StringView  Name;           //!< 名前.
    uint32_t    FirstChipId;    //!< 最初のチップ番号.
    uint32_t    Columns;        //!< 列数(X方向の数).
    uint32_t    TileCount;      //!< タイル数.
    uint32_t    TileWidth;      //!< タイルの横幅.
    uint32_t    TileHeight;     //!< タイルの縦幅.
    uint32_t    TextureWidth;   //!< テクスチャの横幅.
    uint32_t    TextureHeight;  //!< テクスチャの縦幅.
    StringView  TexturePath;    //!< テクスチャファイルパス.
};

///////////////////////////////////////////////////////////////////////////////
// ResTileMapLayer structure
///////////////////////////////////////////////////////////////////////////////
struct ResTileMapLayer
{
    StringView          Name;       //!< 名前.
    uint32_t            Id;         //!< ID.
    uint32_t            Columns;    //!< 列数(X方向の数).
    uint32_t            Rows;       //!< 行数(Y方向の数).
    ArrayView<uint16_t> Data;       //!< マップチップ番号データ.
};

///////////////////////////////////////////////////////////////////////////////
// ResTileCoord structure
///////////////////////////////////////////////////////////////////////////////
struct ResTileCoord
{
    Vector2 Uv0;    //!< 左上のテクスチャ座標.
    Vector2 Uv1;    //!< 右下のテクスチャ座標.
};

///////////////////////////////////////////////////////////////////////////////
// MapChipBinary class
///////////////////////////////////////////////////////////////////////////////
class MapChipBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MapChipBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MapChipBinary();

    //-------------------------------------------------------------------------
    //! @brief      メモリからロードします.
    //! 
    //! @param[in]      blob        バイナリラージオブジェクト.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      行数を取得します.
    //! 
    //! @return     行数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetRows() const;

    //-------------------------------------------------------------------------
    //! @brief      列数を取得します.
    //! 
    //! @return     列数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetColumns() const;

    //-------------------------------------------------------------------------
    //! @brief      タイルの横幅を取得します.
    //! 
    //! @return     タイルを横幅を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTileWidth() const;

    //-------------------------------------------------------------------------
    //! @brief      タイルの縦幅を取得します.
    //! 
    //! @return     タイルの縦幅を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTileHeight() const;

    //-------------------------------------------------------------------------
    //! @brief      タイルセット数を取得します.
    //! 
    //! @return     タイルセット数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetTileSetCount() const;

    //-------------------------------------------------------------------------
    //! @brief      タイルセットを取得します.
    //! 
    //! @param[in]      tileSetIndex        タイルセット番号.
    //! @return     指定されたタイルセットを返却します.
    //-------------------------------------------------------------------------
    ResTileSet GetTileSet(uint32_t tileSetIndex) const;

    //-------------------------------------------------------------------------
    //! @brief      レイヤー数を取得します.
    //! 
    //! @return     レイヤー数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetLayerCount() const;

    //-------------------------------------------------------------------------
    //! @brief      レイヤーを取得します.
    //! 
    //! @param[in]      layerIndex      レイヤー番号.
    //! @return     指定されたレイヤーを返却します.
    //-------------------------------------------------------------------------
    ResTileMapLayer GetLayer(uint32_t layerIndex) const;

    //-------------------------------------------------------------------------
    //! @brief      指定タイルのテクスチャ座標を取得します.
    //! 
    //! @param[in]      tileSetIndex    タイルセット番号.
    //! @param[in]      tileId          タイル番号.
    //! @return     指定タイルのテクスチャ座標を返却します.
    //-------------------------------------------------------------------------
    ResTileCoord GetCoord(uint32_t tileSetIndex, uint32_t tileId) const;

    //-------------------------------------------------------------------------
    //! @brief      チッププロパティを取得します.
    //! 
    //! @param[in]      tileSetIndex    タイルセット番号.
    //! @param[in]      chipId          チップ番号.
    //! @param[out]     result          チッププロパティの格納先.
    //! @retval true    検索にヒット.
    //! @retval false   見つかりませんでした.
    //-------------------------------------------------------------------------
    bool FindChipProperty(uint32_t tileSetIndex, uint16_t chipId, ResChipProperty& result) const;

private:
    //=========================================================================
    // private varaibles.
    //=========================================================================
    std::vector<uint8_t>    m_Blob; //!< バイナリデータ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
