//-----------------------------------------------------------------------------
// File : asdxResAnimationClip.h
// Desc : Animation Clip Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <fnd/asdxMath.h>


//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
namespace asdx::res {
struct BoneAnimation;
struct AnimationClip;
} // namespace asdx::res

namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// AnimationClipBinary class
///////////////////////////////////////////////////////////////////////////////
class AnimationClipBinary
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    AnimationClipBinary();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~AnimationClipBinary();

    //-------------------------------------------------------------------------
    //! @brief      ロード処理を行います.
    //! 
    //! @param[in]      blob        バイナリデータ.
    //-------------------------------------------------------------------------
    void Load(std::vector<uint8_t>&& blob);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      クリップ数を取得します.
    //! 
    //! @return     クリップ数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetClipCount() const;

    //-------------------------------------------------------------------------
    //! @brief      クリップを取得します.
    //! 
    //! @param[in]      index       クリップ番号.
    //! @return     クリップを返却します.
    //-------------------------------------------------------------------------
    const res::AnimationClip* GetClip(uint32_t index) const;

    //-------------------------------------------------------------------------
    //! @brief      クリップを検索します.
    //! 
    //! @param[in]      name        クリップ名.
    //! @return     クリップを返却します.
    //-------------------------------------------------------------------------
    const res::AnimationClip* FindClip(const char* name) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<uint8_t>    m_Blob;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

//-----------------------------------------------------------------------------
//! @brief      ボーン名を取得します.
//! 
//! @param[in]      boneAnim        ボーンアニメーション.
//! @return     ボーン名を返却します.
//-----------------------------------------------------------------------------
const char* GetBoneName(const res::BoneAnimation* boneAnim);

//-----------------------------------------------------------------------------
//! @brief      平行移動アニメーションキーフレームを検索します.
//! 
//! @param[in]      boneAnim        ボーンアニメーション.
//! @param[in]      timeSec         アニメーション時間[秒].
//! @return     平行移動値を返却します.
//-----------------------------------------------------------------------------
Vector3 FindTranslationKey(const res::BoneAnimation* boneAnim, float timeSec);

//-----------------------------------------------------------------------------
//! @brief      回転アニメーションキーフレームを検索します.
//! 
//! @param[in]      boneAnim        ボーンアニメーション.
//! @param[in]      timeSec         アニメーション時間[秒].
//! @return     回転値を返却します.
//-----------------------------------------------------------------------------
Quaternion FindRotationKey(const res::BoneAnimation* boneAnim, float timeSec);

//-----------------------------------------------------------------------------
//! @brief      拡縮アニメーションキーフレームを検索します.
//! 
//! @param[in]      boneAnim        ボーンアニメーション.
//! @param[in]      timeSec         アニメーション時間[秒]
//! @return     拡縮値を返却します.
//-----------------------------------------------------------------------------
Vector3 FindScaleKey(const res::BoneAnimation* boneAnim, float timeSec);

//-----------------------------------------------------------------------------
//! @brief      ローカル変換行列を計算します.
//! 
//! @param[in]      boneAnim        ボーンアニメーション.
//! @param[in]      timeSec         アニメーション時間[秒]:
//! @return     ローカル変換行列を返却します.
//-----------------------------------------------------------------------------
Matrix ComputeLocalTransform(const res::BoneAnimation* boneAnim, float timeSec);

//-----------------------------------------------------------------------------
//! @brief      クリップ名を取得します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @return     クリップ名を返却します.
//-----------------------------------------------------------------------------
const char* GetClipName(const res::AnimationClip* clip);

//-----------------------------------------------------------------------------
//! @brief      アニメーション間隔を取得します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @return     アニメーション間隔を返却します.
//-----------------------------------------------------------------------------
float GetDuration(const res::AnimationClip* clip);

//-----------------------------------------------------------------------------
//! @brief      1秒あたりの処理時間を取得します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @return     1秒あたりの処理時間(TPS)を返却します.
//-----------------------------------------------------------------------------
float GetTicksPerSecond(const res::AnimationClip* clip);

//-----------------------------------------------------------------------------
//! @brief      ボーンアニメーション数を取得します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @return     ボーンアニメーション数を返却します.
//-----------------------------------------------------------------------------
uint32_t GetBoneAnimationCount(const res::AnimationClip* clip);

//-----------------------------------------------------------------------------
//! @brief      ボーンアニメーションを取得します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @param[in]      index       ボーンアニメーション番号.
//! @return     ボーンアニメーションを返却します.
//-----------------------------------------------------------------------------
const res::BoneAnimation* GetBoneAnimation(const res::AnimationClip* clip, uint32_t index);

//----------------------------------------------------------------------------
//! @brief      ボーンアニメーションを検索します.
//! 
//! @param[in]      clip        アニメーションクリップ.
//! @param[in]      name        ボーン名.
//! @return     ボーンアニメーションを返却します.
//----------------------------------------------------------------------------
const res::BoneAnimation* FindBoneAnimation(const res::AnimationClip* clip, const char* name);

} // namespace asdx
