//-----------------------------------------------------------------------------
// File : asdxSoundEngine.cpp
// Desc : Sound Engine.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <xaudio2.h>
#include <fnd/asdxLogger.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// SoundEngine class
///////////////////////////////////////////////////////////////////////////////
class SoundEngine
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static SoundEngine& Instance()
    { return s_Instance; }

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init()
    {
        UINT32 flags = 0;
    #if defined(DEBUG) || defined(_DEBUG)
        flags |= XAUDIO2_DEBUG_ENGINE;
    #endif

        auto hr = XAudio2Create(&m_pXAudio2);
        if (FAILED(hr))
        {
            ELOGA("Error : XAudio2Create() Failed. errcode = 0x%x", hr);
            return false;
        }

        hr = m_pXAudio2->CreateMasteringVoice(&m_pMasteringVoice);
        if (FAILED(hr))
        {
            ELOGA("Error : IXAudio2::CreateMasteringVoice() Failed. errcode = 0x%x", hr);
            return false;
        }

        return true;
    }

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term()
    {
        if (m_pMasteringVoice != nullptr)
        {
            m_pMasteringVoice->DestroyVoice();
            m_pMasteringVoice = nullptr;
        }

        if (m_pXAudio2 != nullptr)
        {
            m_pXAudio2->Release();
            m_pXAudio2 = nullptr;
        }
    }

    //-------------------------------------------------------------------------
    //! @brief      IXAudio2 を取得します.
    //! 
    //! @return     IXAudio2 を返却します.
    //-------------------------------------------------------------------------
    IXAudio2* GetXAudio2() const
    { return m_pXAudio2; }

    //-------------------------------------------------------------------------
    //! @brief      マスタリングボイスを取得します.
    //! 
    //! @return     マスタリングボイスを返却します.
    //-------------------------------------------------------------------------
    IXAudio2MasteringVoice* GetMasteringVoice() const
    { return m_pMasteringVoice; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static SoundEngine      s_Instance;
    IXAudio2*               m_pXAudio2        = nullptr;
    IXAudio2MasteringVoice* m_pMasteringVoice = nullptr;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};
SoundEngine SoundEngine::s_Instance = {};


//-----------------------------------------------------------------------------
//      サウンドエンジンの初期化処理.
//-----------------------------------------------------------------------------
bool InitSound()
{ return SoundEngine::Instance().Init(); }

//-----------------------------------------------------------------------------
//      サウンドエンジンの終了処理.
//-----------------------------------------------------------------------------
void TermSound()
{ SoundEngine::Instance().Term(); }

//-----------------------------------------------------------------------------
//      IXAudio2 を取得します.
//-----------------------------------------------------------------------------
IXAudio2* GetXAudio2()
{ return SoundEngine::Instance().GetXAudio2(); }

//-----------------------------------------------------------------------------
//      マスタリングボイスを取得します.
//-----------------------------------------------------------------------------
IXAudio2MasteringVoice* GetMasteringVoice()
{ return SoundEngine::Instance().GetMasteringVoice(); }

} // namespace asdx
