//-----------------------------------------------------------------------------
// File : asdxHash.h
// Desc : Hash Key Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxHash.h>
#include <string>
#include "xxHash.h"


namespace asdx {

//-----------------------------------------------------------------------------
//      バッファからハッシュ値を計算します.
//-----------------------------------------------------------------------------
uint64_t CalcHash(const void* pBuffer, size_t size)
{ return XXH3_64bits(pBuffer, size); }

//-----------------------------------------------------------------------------
//      文字列からハッシュ値を計算します.
//-----------------------------------------------------------------------------
uint64_t CalcHash(const char* strings)
{ return XXH3_64bits(strings, (strings == nullptr) ? 0 : strlen(strings)); }

//-----------------------------------------------------------------------------
//      シード値を用いてハッシュ値を計算します.
//-----------------------------------------------------------------------------
uint64_t CalcHashWithSeed(const void* pBuffer, size_t size, uint64_t prevHash)
{ return XXH3_64bits_withSeed(pBuffer, size, prevHash); }

} // namespace asdx
