//-----------------------------------------------------------------------------
// File : asdxBlackboard.h
// Desc : Black Board.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxBlackboard.h>


namespace {

//-----------------------------------------------------------------------------
// Constant Values.
//-----------------------------------------------------------------------------
static const std::vector<uint8_t> kEmptyBuffer = {};    //!< 空バッファ.
}

namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Blackboard class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
Blackboard::Blackboard()
: m_Dictionary()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
Blackboard::~Blackboard()
{ Clear(); }

//-----------------------------------------------------------------------------
//      データを設定します.
//-----------------------------------------------------------------------------
void Blackboard::Set(const char* tag, const uint8_t* pBuffer, size_t size)
{
    auto& item = m_Dictionary[tag];

    if (item.size() < size)
    { item.resize(size); }

    memcpy(item.data(), pBuffer, size);
}

//-----------------------------------------------------------------------------
//      データを設定します.
//-----------------------------------------------------------------------------
void Blackboard::Set(const char* tag, const std::vector<uint8_t>& buffer)
{ m_Dictionary[tag] = buffer; }

//-----------------------------------------------------------------------------
//      データを取得します.
//-----------------------------------------------------------------------------
const std::vector<uint8_t>& Blackboard::Get(const char* tag) const
{
    if (!Contains(tag))
        return kEmptyBuffer;

    return m_Dictionary.at(tag);
}

//-----------------------------------------------------------------------------
//      データを取得します.
//-----------------------------------------------------------------------------
bool Blackboard::Get(const char* tag, uint8_t* pBuffer, size_t size) const
{
    if (!Contains(tag))
        return false;

    auto& item = m_Dictionary.at(tag);
    if (size != item.size())
        return false;

    memcpy(pBuffer, item.data(), item.size());
    return true;
}

//-----------------------------------------------------------------------------
//      指定タグが含まれるかどうかチェックします.
//-----------------------------------------------------------------------------
bool Blackboard::Contains(const char* tag) const
{
    auto itr = m_Dictionary.find(tag);
    return itr != m_Dictionary.end();
}

//-----------------------------------------------------------------------------
//      データをすべてクリアします.
//-----------------------------------------------------------------------------
void Blackboard::Clear()
{ m_Dictionary.clear(); }

} // namespace asdx

