//-----------------------------------------------------------------------------
// File : asdxGamePad.cpp
// Desc : Game Pad Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cassert>
#include <fnd/asdxHid.h>
#include <fnd/asdxMath.h>
#include <GameInput.h>


//-----------------------------------------------------------------------------
// Using Namespace
//-----------------------------------------------------------------------------
using namespace GameInput::v4;


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
void GetPadState(int index, GameInputGamepadState& state, bool& connected);
void SetPadVibrate(int index, const GameInputRumbleParams* param);


///////////////////////////////////////////////////////////////////////////////
// GamePad class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
GamePad::GamePad()
: m_PlayerIndex(0)
{ ResetState(); }

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
GamePad::~GamePad()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      ボタンの値をリセットします.
//-----------------------------------------------------------------------------
void GamePad::ResetState()
{
    m_TriggerL = 0.0f;
    m_TriggerR = 0.0f;
    m_ThumbLX  = 0.0f;
    m_ThumbLY  = 0.0f;
    m_ThumbRX  = 0.0f;
    m_ThumbRY  = 0.0f;

    m_Buttons        = 0;
    m_PressedButtons = 0;
    m_LastButtons    = 0;
}

//-----------------------------------------------------------------------------
//      コントローラーが接続されているかチェックします.
//-----------------------------------------------------------------------------
bool GamePad::IsConnected() const
{ return m_IsConnected; }

//-----------------------------------------------------------------------------
//      コントローラーの状態を更新します.
//-----------------------------------------------------------------------------
void GamePad::UpdateState()
{
    GameInputGamepadState state = {};
    GetPadState(m_PlayerIndex, state, m_IsConnected);

    m_Buttons  = state.buttons;
    m_TriggerL = state.leftTrigger;
    m_TriggerR = state.rightTrigger;
    m_ThumbLX  = state.leftThumbstickX;
    m_ThumbLY  = state.leftThumbstickY;
    m_ThumbRX  = state.rightThumbstickX;
    m_ThumbRY  = state.rightThumbstickY;

    m_PressedButtons = ( m_LastButtons ^ m_Buttons ) & m_Buttons;
    m_LastButtons    = m_Buttons;
}

//-----------------------------------------------------------------------------
//      バイブレーションさせます.
//-----------------------------------------------------------------------------
void GamePad::Vibrate(float lhs, float rhs) const
{
    GameInputRumbleParams param = {};
    param.lowFrequency  = lhs;
    param.highFrequency = rhs;
    param.leftTrigger   = 0.0f;
    param.rightTrigger  = 0.0f;
    SetPadVibrate(m_PlayerIndex, &param);
}

//-----------------------------------------------------------------------------
//      プレイヤーインデックスを設定します.
//-----------------------------------------------------------------------------
void GamePad::SetPlayerIndex(uint32_t index)
{
    assert( index < 4 );
    m_PlayerIndex = index;
}

//-----------------------------------------------------------------------------
//      プレイヤーインデックスを取得します.
//-----------------------------------------------------------------------------
uint32_t GamePad::GetPlayerIndex() const
{ return m_PlayerIndex; }

//-----------------------------------------------------------------------------
//      ボタンが押されたかチェックします.
//-----------------------------------------------------------------------------
bool GamePad::IsDown(uint32_t buttonMask) const
{ return !!(m_PressedButtons & buttonMask); }

//-----------------------------------------------------------------------------
//      ボタンが押されているかチェックします.
//-----------------------------------------------------------------------------
bool GamePad::IsHold(uint32_t buttonMask) const
{ return !!(m_Buttons & buttonMask); }

//-----------------------------------------------------------------------------
//      正規化された左サムスティックのX成分を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetThumbLX() const
{ return m_ThumbLX; }

//-----------------------------------------------------------------------------
//      正規化された左サムスティックのY成分を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetThumbLY() const
{ return m_ThumbLY; }

//-----------------------------------------------------------------------------
//      正規化された右サムスティックのX成分を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetThumbRX() const
{ return m_ThumbRX; }

//-----------------------------------------------------------------------------
//      正規化された右サムスティックのY成分を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetThumbRY() const
{ return m_ThumbRY; }

//-----------------------------------------------------------------------------
//      左トリガーの値を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetTriggerL() const
{ return m_TriggerL; }

//-----------------------------------------------------------------------------
//      右トリガーの値を取得します.
//-----------------------------------------------------------------------------
float GamePad::GetTriggerR() const
{ return m_TriggerR; }

} // namespace asdx
