//-----------------------------------------------------------------------------
// File : asdxDirectionalLightComponent.
// Desc : Directional Light Component.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <rs/asdxDirectionalLightComponent.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// DirectionalLightComponent class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      ライトの照射方向を設定します.
//-----------------------------------------------------------------------------
void DirectionalLightComponent::SetForward(const Vector3& value)
{ m_Forward = value; }

//-----------------------------------------------------------------------------
//      ライトの照射方向を取得します.
//-----------------------------------------------------------------------------
const Vector3& DirectionalLightComponent::GetForward() const
{ return m_Forward; }

//-----------------------------------------------------------------------------
//      カラーを設定します.
//-----------------------------------------------------------------------------
void DirectionalLightComponent::SetColor(const Vector3& value)
{ m_Color = value; }

//-----------------------------------------------------------------------------
//      カラーを取得します.
//-----------------------------------------------------------------------------
const Vector3& DirectionalLightComponent::GetColor() const
{ return m_Color; }

//-----------------------------------------------------------------------------
//      ライト強度を設定します.
//-----------------------------------------------------------------------------
void DirectionalLightComponent::SetIntensity(float value)
{ m_Intensity = value; }

//-----------------------------------------------------------------------------
//      ライト強度を取得します.
//-----------------------------------------------------------------------------
float DirectionalLightComponent::GetIntensity() const
{ return m_Intensity; }

//-----------------------------------------------------------------------------
//      シャドウキャストフラグを設定します.
//-----------------------------------------------------------------------------
void DirectionalLightComponent::SetCastShadow(bool value)
{ m_CastShadow = value; }

//-----------------------------------------------------------------------------
//      シャドウキャストフラグを取得します.
//-----------------------------------------------------------------------------
bool DirectionalLightComponent::IsCastShadow() const
{ return m_CastShadow; }

} // namespace asdx
