//-----------------------------------------------------------------------------
// File : MaterialConverter.h
// Desc : Material Binary (*.mtb) Converter.
// Copyright(c) Project Asura. 
//-----------------------------------------------------------------------------
#pragma once


//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <vector>
#include "../../../include/fnd/asdxMath.h"


///////////////////////////////////////////////////////////////////////////////
// MaterialConverter class
///////////////////////////////////////////////////////////////////////////////
class MaterialConverter
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Desc structure
    ///////////////////////////////////////////////////////////////////////////
    struct Desc
    {
        std::string InputPath;          //!< 入力ファイルパス.
        std::string OutputPath;         //!< 出力ファイルパス.
        bool        TextureConvert;     //!< テクスチャコンバートも行う場合は true.
    };

    ///////////////////////////////////////////////////////////////////////////
    // AlphaMode enum
    ///////////////////////////////////////////////////////////////////////////
    enum AlphaMode : uint8_t
    {
        Opaque,
        Mask,
        Blend,
    };

    ///////////////////////////////////////////////////////////////////////////
    // CullMode enum
    ///////////////////////////////////////////////////////////////////////////
    enum CullMode : uint8_t
    {
        Back,
        Front,
        None,
    };

    ///////////////////////////////////////////////////////////////////////////
    // MaterialParam structre
    ///////////////////////////////////////////////////////////////////////////
    struct MaterialParam
    {
        asdx::Float3    BaseColor   = asdx::Float3(1.0f, 1.0f, 1.0f);
        float           Alpha       = 1.0f;
        float           Occlusion   = 1.0f;
        float           Roughness   = 1.0f;
        float           Metalness   = 1.0f;
        float           Ior         = 1.0f;
        asdx::Float3    Emissive    = asdx::Float3(0.0f, 0.0f, 0.0f);
        float           AlphaCutOff = 0.0f;
    };

    ///////////////////////////////////////////////////////////////////////////
    // Material structure
    ///////////////////////////////////////////////////////////////////////////
    struct Material
    {
        std::string                 Shader;
        uint8_t                     AlphaMode = AlphaMode::Opaque;
        uint8_t                     CullMode  = CullMode::Back;
        MaterialParam               Param     = {};
        std::vector<std::string>    Textures;
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      現在のバイナリバージョンを取得します.
    //! 
    //! @return     現在のバイナリバージョンを返却します.
    //-------------------------------------------------------------------------
    static uint32_t GetCurrentVersion();

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      desc        変換設定.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool Convert(const Desc& desc);

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      desc        変換設定.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool Convert(const Material& material, std::vector<uint8_t>& binary);

    //-------------------------------------------------------------------------
    //! @brief      逆変換処理を行います.
    //! 
    //! @param[in]      binary      入力バイナリ.
    //! @param[in]      path        JSON出力ファイルパス.
    //! @retval true    変換に成功.
    //! @retval false   変化に失敗.
    //-------------------------------------------------------------------------
    static bool ReverseConvert(const std::string& path, const std::vector<uint8_t>& binary);

    //-------------------------------------------------------------------------
    //! @brief      逆変換処理を行います.
    //! 
    //! @param[in]      binary      入力バイナリ.
    //! @param[in]      path        出力ファイルパス.
    //! @retval true    変換に成功.
    //! @retval false   変化に失敗.
    //-------------------------------------------------------------------------
    static bool ReverseConvert(const std::vector<uint8_t>& binary, Material& result);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};
