//-----------------------------------------------------------------------------
// File : ModelConverter.h
// Desc : Model Binary (*.mdb) Converter.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

// MEMO: 
// * 入力サポートフォーマットは次の通りです.
//　  usd, x, amf, 3ds, m3d, mdl, md3, ply, ase, obj, hmp, smd, mdc,
//    stl, lwo, dxf, nff, raw, sib, off, ac, bvh, irr, q3d, b3d,
//    collada, terragen, cms, unreal, lws, ogre, OpenGEX, ms3d,
//    cob, blender, q3bsp, ndo, ifc, xgl, fbx, assbin, gltf, gltf2,
//    c4d, 3mf, x3d, mmd, m3d, iqm.
//
// * 出力サポートフォーマットは次の通りです.
//    collada, x, stp, obj, stl, stlb, ply, plyb, 3ds, gltf2, glb2,
//    gltf, glb, assbin, assxml, x3d, fbx, fbxa, m3d, m3da, 3mf,
//    3mf, pbrt, assjson.


//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <vector>


///////////////////////////////////////////////////////////////////////////////
// ModelConverter class
///////////////////////////////////////////////////////////////////////////////
class ModelConverter
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Desc structure
    ///////////////////////////////////////////////////////////////////////////
    struct Desc
    {
        std::string InputPath;      //!< 入力ファイルパス.
        std::string OutputPath;     //!< 出力ファイルパス(mdbのみ).
    };

    ///////////////////////////////////////////////////////////////////////////
    // DescEx structure
    ///////////////////////////////////////////////////////////////////////////
    struct DescEx
    {
        std::string InputPath;          //!< 入力ファイルパス.
        std::string TextureOutputPath;  //!< テクスチャ出力ベースパス.
        std::string MaterialOutputPath; //!< マテリアル出力ベースパス.
        bool        ConvertTexture;     //!< テクスチャコンバートを行う場合は true.
        bool        ConvertMaterial;    //!< マテリアルコンバートを行う場合は true.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      現在のバイナリバージョンを取得します.
    //! 
    //! @return     現在のバイナリバージョンを返却します.
    //-------------------------------------------------------------------------
    static uint32_t GetCurrentVersion();

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      desc        変換設定.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool Convert(const Desc& desc);

    //-------------------------------------------------------------------------
    //! @brief      変換処理を行います.
    //! 
    //! @param[in]      desc            変換設定.
    //! @param[out]     modelBinary     モデルバイナリの格納先.
    //! @param[out]     materialBinary  マテリアルバイナリの格納先.
    //! @retval true    変換に成功.
    //! @retval fasle   変換に失敗.
    //-------------------------------------------------------------------------
    static bool ConvertEx(
        const DescEx&                       desc,
        std::vector<uint8_t>&               modelBinary,
        std::vector<std::vector<uint8_t>>&  materialBinaries);

    //-------------------------------------------------------------------------
    //! @brief      逆変換処理を行います.
    //! 
    //! @param[in]      binary      入力バイナリ.
    //! @param[in]      format      出力フォーマット.
    //! @param[in]      path        出力ファイルパス.
    //! @retval true    変換に成功.
    //! @retval false   変換に失敗.
    //-------------------------------------------------------------------------
    static bool ReverseConvert(
        const std::vector<uint8_t>& binary,
        const char*                 format,
        const std::string&          path);

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};
