//-----------------------------------------------------------------------------
// File : asdxList.h
// Desc : Double-Linked List.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// List class
///////////////////////////////////////////////////////////////////////////////
template<typename T>
class List
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Node class
    ///////////////////////////////////////////////////////////////////////////
    class Node
    {
        //=====================================================================
        // list of friend classes and methods.
        //=====================================================================
        friend class List<T>;

    public:
        //=====================================================================
        // public variables.
        //=====================================================================
        /* NOTHING */

        //=====================================================================
        // public methods.
        //=====================================================================

        //---------------------------------------------------------------------
        //! @brief      コンストラクタです.
        //---------------------------------------------------------------------
        Node()
        : m_NextListNode(nullptr)
        , m_PrevListNode(nullptr)
        { /* DO_NOTHING */ }

        //---------------------------------------------------------------------
        //! @brief      デストラクタです.
        //---------------------------------------------------------------------
        ~Node()
        {
            auto prev = m_PrevListNode;
            auto next = m_NextListNode;

            if (prev != nullptr)
            { prev->m_NextListNode = next; }

            if (next != nullptr)
            { next->m_PrevListNode = prev; }

            m_PrevListNode = nullptr;
            m_NextListNode = nullptr;
        }

        //---------------------------------------------------------------------
        //! @brief      次のノードを取得します.
        //---------------------------------------------------------------------
        T* GetNext() const
        { return m_NextListNode; }

        //---------------------------------------------------------------------
        //! @brief      前のノードを取得します.
        //---------------------------------------------------------------------
        T* GetPrev() const
        { return m_PrevListNode; }

        //---------------------------------------------------------------------
        //! @brief      次のノードを持つかチェックします.
        //---------------------------------------------------------------------
        bool HasNext() const
        { return m_NextListNode != nullptr; }

        //---------------------------------------------------------------------
        //! @brief      前のノードを持つかチェックします.
        //---------------------------------------------------------------------
        bool HasPrev() const
        { return m_PrevListNode != nullptr; }

    private:
        //=====================================================================
        // private variables.
        //=====================================================================
        T*  m_NextListNode = nullptr;       //!< 次のノード.
        T*  m_PrevListNode = nullptr;       //!< 前のノード.

        //---------------------------------------------------------------------
        //! @brief      リンクを設定します.
        //---------------------------------------------------------------------
        static void Link(T* lhs, T* rhs)
        {
            if (lhs == nullptr || rhs == nullptr)
            { return; }

            lhs->m_NextListNode = rhs;
            rhs->m_PrevListNode = lhs;
        }

        //---------------------------------------------------------------------
        //! @brief      リンクを解除します.
        //---------------------------------------------------------------------
        static void Unlink(T* node)
        {
            if (node == nullptr)
            { return; }

            auto prev = node->m_PrevListNode;
            auto next = node->m_NextListNode;

            if (prev != nullptr)
            { prev->m_NextListNode = next; }

            if (next != nullptr)
            { next->m_PrevListNode = prev; }

            node->m_PrevListNode = nullptr;
            node->m_NextListNode = nullptr;
        }
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    List()
    : m_Head(nullptr)
    , m_Tail(nullptr)
    , m_Count(0)
    { /* DO_NOTHING */ }

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~List()
    { Clear(); }

    //-------------------------------------------------------------------------
    //! @brief      リストを破棄します.
    //-------------------------------------------------------------------------
    void Clear()
    {
        auto itr = m_Head;
        while(itr != nullptr)
        {
            auto node = itr;
            Node::Unlink(node);

            if (!itr->HasNext())
            { break; }

            itr = itr->GetNext();
        }

        m_Head = nullptr;
        m_Tail = nullptr;

        m_Count = 0;
    }

    //-------------------------------------------------------------------------
    //! @brief      先頭に追加します.
    //-------------------------------------------------------------------------
    void PushFront(T* node)
    {
        if (node == nullptr)
        { return; }

        // 継承チェック.
        assert(static_cast<List<T>::Node*>(node) != nullptr);

        if (m_Head == nullptr)
        {
            m_Head = node;
            m_Tail = node;
        }
        else
        {
            Node::Link(node, m_Head);
            m_Head = node;
        }
        m_Count++;
    }

    //-------------------------------------------------------------------------
    //! @brief      末尾に追加します.
    //-------------------------------------------------------------------------
    void PushBack(T* node)
    {
        if (node == nullptr)
        { return; }

        // 継承チェック.
        assert(static_cast<List<T>::Node*>(node) != nullptr);

        if (m_Head == nullptr)
        {
            m_Head = node;
            m_Tail = node;
        }
        else
        {
            Node::Link(m_Tail, node);
            m_Tail = node;
        }
        m_Count++;
    }

    //-------------------------------------------------------------------------
    //! @brief      先頭要素を取り出します.
    //-------------------------------------------------------------------------
    T* PopFront()
    {
        if (m_Head == nullptr)
        { return nullptr; }

        auto head = m_Head;
        auto next = m_Head->GetNext();
        Node::Unlink(head);
        m_Head = next;
        m_Count--;
        return head;
    }

    //-------------------------------------------------------------------------
    //! @brief      末尾要素を取り出します.
    //-------------------------------------------------------------------------
    T* PopBack()
    {
        if (m_Tail == nullptr)
        { return nullptr; }

        auto tail = m_Tail;
        auto prev = m_Tail->GetPrev();
        Node::Unlink(tail);
        m_Tail = prev;
        m_Count--;
        return tail;
    }

    //-------------------------------------------------------------------------
    //! @brief      ノードを挿入します.
    //-------------------------------------------------------------------------
    void Insert(T* target, T* node)
    {
        if (target == nullptr || node == nullptr)
        { return; }

        Node::Link(target, node);
        m_Count++;
    }

    //-------------------------------------------------------------------------
    //! @brief      指定ノードをリストから削除します.
    //-------------------------------------------------------------------------
    void Remove(T* node)
    {
        if (node == nullptr)
        { return; }

        Node::Unlink(node);
        m_Count--;
    }

    //-------------------------------------------------------------------------
    //! @brief      指定ノードが含まれるかチェックします.
    //-------------------------------------------------------------------------
    bool Contains(const T* node) const
    {
        if (node == nullptr)
        { return false; }

        auto itr = m_Head;
        while(itr != nullptr)
        {
            if (itr == node)
            { return true; }

            if (!itr->HasNext())
            { break; }

            itr = itr->GetNext();
        }

        return false;
    }

    //-------------------------------------------------------------------------
    //! @brief      空かどうかチェックします.
    //-------------------------------------------------------------------------
    bool IsEmpty() const
    { return m_Count == 0; }

    //-------------------------------------------------------------------------
    //! @brief      先頭ノードを取得します.
    //-------------------------------------------------------------------------
    T* GetHead() const
    { return m_Head; }

    //-------------------------------------------------------------------------
    //! @brief      末尾ノードを取得します.
    //-------------------------------------------------------------------------
    T* GetTail() const
    { return m_Tail; }

    //-------------------------------------------------------------------------
    //! @brief      ノード数を取得します.
    //-------------------------------------------------------------------------
    size_t GetCount() const
    { return m_Count; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    T*      m_Head  = nullptr;
    T*      m_Tail  = nullptr;
    size_t  m_Count = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
