//-----------------------------------------------------------------------------
// File : asdxResModel.h
// Desc : Model Resource.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <vector>
#include <asdxMath.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ResBoneIndex structure
///////////////////////////////////////////////////////////////////////////////
struct ResBoneIndex
{
    uint16_t     Index0;    //!< ボーン番号0.
    uint16_t     Index1;    //!< ボーン番号1.
    uint16_t     Index2;    //!< ボーン番号2.
    uint16_t     Index3;    //!< ボーン番号3.

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ResBoneIndex() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    ResBoneIndex(uint16_t i0, uint16_t i1, uint16_t i2, uint16_t i3)
   : Index0(i0), Index1(i1), Index2(i2), Index3(i3)
    { /* DO_NOTHING */ }
};

///////////////////////////////////////////////////////////////////////////////
// ResMeshVertex structure
///////////////////////////////////////////////////////////////////////////////
struct ResMeshVertex
{
    asdx::Vector3   Position;
    uint32_t        TexCoord0;
    uint32_t        TexCoord1;
    uint32_t        TexCoord2;
    uint32_t        TexCoord3;
    uint32_t        TangentSpace;
    uint32_t        Color;
};

//////////////////////////////////////////////////////////////////////////////
// ResSkinningMeshVertex structure
///////////////////////////////////////////////////////////////////////////////
struct ResSkinningMeshVertex : public ResMeshVertex
{
    ResBoneIndex    BoneIndex;
    asdx::Vector4   BoneWeights;
};

///////////////////////////////////////////////////////////////////////////////
// ResMeshlet structure
///////////////////////////////////////////////////////////////////////////////
struct ResMeshlet
{
    uint32_t    VertexOffset;       //!< 頂点番号オフセット.
    uint32_t    VertexCount;        //!< 頂点数.
    uint32_t    PrimitiveOffset;    //!< プリミティブ.
    uint32_t    PrimitiveCount;     //!< プリミティブ数.
};

///////////////////////////////////////////////////////////////////////////////
// ResCullingInfo structure
///////////////////////////////////////////////////////////////////////////////
struct ResCullingInfo
{
    Vector4     BoundingSphere;     //!< バウンディングスフィアです.
    uint32_t    NormalCone;         //!< 圧縮済み法錐です.
};

///////////////////////////////////////////////////////////////////////////////
// ResPrimitive structure
///////////////////////////////////////////////////////////////////////////////
struct ResPrimitive
{
    uint32_t    Index0   : 10;      //!< 出力頂点番号0
    uint32_t    Index1   : 10;      //!< 出力頂点番号1
    uint32_t    Index2   : 10;      //!< 出力頂点番号2
    uint32_t    Reserved : 2;       //!< 予約領域.
};

///////////////////////////////////////////////////////////////////////////////
// ResStaticMesh structure
///////////////////////////////////////////////////////////////////////////////
struct ResStaticMesh
{
    uint32_t                    MatrerialHash;
    std::vector<ResMeshVertex>  Vertices;
    std::vector<uint32_t>       Indices;
    std::vector<ResPrimitive>   Primitives;
    std::vector<ResMeshlet>     Meshlets;
    std::vector<ResCullingInfo> CullingInfos;
};

///////////////////////////////////////////////////////////////////////////////
// ResSkinningMesh structure
///////////////////////////////////////////////////////////////////////////////
struct ResSkinningMesh
{
    uint32_t                            MatrerialHash;
    std::vector<ResSkinningMeshVertex>  Vertices;
    std::vector<uint32_t>               Indices;
    std::vector<ResPrimitive>           Primitives;
    std::vector<ResMeshlet>             Meshlets;
    std::vector<ResCullingInfo>         CullingInfos;
};

///////////////////////////////////////////////////////////////////////////////
// ResModel structure
///////////////////////////////////////////////////////////////////////////////
struct ResModel
{
    uint32_t                        ModelHash;
    std::vector<ResStaticMesh>      StaticMeshes;
    std::vector<ResSkinningMesh>    SkinningMeshes;
};

//-----------------------------------------------------------------------------
//      メッシュの破棄処理を行います.
//-----------------------------------------------------------------------------
void Dispose(ResStaticMesh& resource);

//-----------------------------------------------------------------------------
//      メッシュの破棄処理を行います.
//-----------------------------------------------------------------------------
void Dispose(ResSkinningMesh& resource);

//-----------------------------------------------------------------------------
//      モデルの破棄処理を行います.
//-----------------------------------------------------------------------------
void Dispose(ResModel& resource);

//-----------------------------------------------------------------------------
//      半精度浮動小数点形式に変換します.
//-----------------------------------------------------------------------------
uint16_t ToHalf(float value);

//-----------------------------------------------------------------------------
//      単精度浮動小数点形式に変換します.
//-----------------------------------------------------------------------------
float ToFloat(uint16_t value);

//-----------------------------------------------------------------------------
//      R8G8B8A8_UNORM形式に変換します.
//-----------------------------------------------------------------------------
uint32_t ToUnorm(const Vector4& value);

//-----------------------------------------------------------------------------
//      R8G8B8A8_UNORM形式からVector4に変換します.
//-----------------------------------------------------------------------------
Vector4 FromUnorm(uint32_t value);

//-----------------------------------------------------------------------------
//      テクスチャ座標を圧縮します.
//-----------------------------------------------------------------------------
uint32_t EncodeTexCoord(const Vector2& value);

//-----------------------------------------------------------------------------
//      圧縮されたテクスチャ座標を展開します.
//-----------------------------------------------------------------------------
Vector2 DecodeTexCoord(uint32_t encoded);

//-----------------------------------------------------------------------------
//      八面体ラップ処理を行います.
//-----------------------------------------------------------------------------
Vector2 OctWrap(const Vector2& value);

//-----------------------------------------------------------------------------
//      法線ベクトルをパッキングします.
//-----------------------------------------------------------------------------
Vector2 PackNormal(const Vector3& value);

//-----------------------------------------------------------------------------
//      法線ベクトルをアンパッキングします.
//-----------------------------------------------------------------------------
Vector3 UnpackNormal(const Vector2& value);

//-----------------------------------------------------------------------------
//      接線空間を圧縮します.
//-----------------------------------------------------------------------------
uint32_t EncodeTBN(
    const Vector3& normal,
    const Vector3& tangent,
    uint8_t binormalHandedeness);

//-----------------------------------------------------------------------------
//      圧縮された接線空間を展開します.
//-----------------------------------------------------------------------------
void DecodeTBN(
    uint32_t encoded,
    Vector3& tangent,
    Vector3& bitangent,
    Vector3& normal);

//-----------------------------------------------------------------------------
//      モデルを書き出します.
//-----------------------------------------------------------------------------
bool SaveModel(const char* path, const ResModel& model);

//-----------------------------------------------------------------------------
//      モデルを読み込みます.
//-----------------------------------------------------------------------------
bool LoadModel(const char* path, ResModel& model);

} // namespace asdx
