//----------------------------------------------------------------------------
// File : asdxMeshImpl.h
// Desc : Mesh Implementation.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <string>
#include <gfx/asdxModel.h>
#include <gfx/asdxBuffer.h>



namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
struct ResMesh;


///////////////////////////////////////////////////////////////////////////////
// Mesh class
///////////////////////////////////////////////////////////////////////////////
class Mesh : public IMesh
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Mesh();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Mesh();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      mesh        メッシュリソースです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const ResMesh& mesh);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      マテリアルIDを取得します.
    //! 
    //! @return     マテリアルIDを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetMaterialId() const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ名を取得します.
    //! 
    //! @return     メッシュ名を返却します.
    //-------------------------------------------------------------------------
    const std::string& GetName() const override;

    //-------------------------------------------------------------------------
    //! @brief      位置座標バッファを取得します.
    //! 
    //! @return     位置座標バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetPositions() const override;

    //-------------------------------------------------------------------------
    //! @brief      法線バッファを取得します.
    //! 
    //! @return     法線バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetNormals() const override;

    //-------------------------------------------------------------------------
    //! @brief      接線バッファを取得します.
    //! 
    //! @return     接線バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetTangents() const override;

    //-------------------------------------------------------------------------
    //! @brief      カラーバッファを取得します.
    //! 
    //! @return     カラーバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetColors() const override;

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ座標バッファを取得します.
    //! 
    //! @return     テクスチャ座標バッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetTexCoords() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンインデックスバッファを取得します.
    //! 
    //! @return     ボーンインデックスバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetBoneIndices() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンウェイトバッファを取得します.
    //! 
    //! @return     ボーンウェイトバッファを返却します.
    //-------------------------------------------------------------------------
    const VertexBuffer& GetBoneWeights() const override;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックスバッファを取得します.
    //! 
    //! @return     頂点インデックスバッファを返却します.
    //-------------------------------------------------------------------------
    const IndexBuffer& GetVertexIndices() const override;

    //-------------------------------------------------------------------------
    //! @brief      頂点数を取得します.
    //! 
    //! @return     頂点数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetVertexCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックス数を取得します.
    //! 
    //! @return     頂点インデックス数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetIndexCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    const BoundingSphere3& GetBoundingSphere() const override;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::string     m_Name;                 //!< メッシュ名.
    uint32_t        m_MaterialId;           //!< マテリアルID.
    VertexBuffer    m_Positions;            //!< 位置座標バッファ.
    VertexBuffer    m_Normals;              //!< 法線バッファ.
    VertexBuffer    m_Tangents;             //!< 接線バッファ.
    VertexBuffer    m_Colors;               //!< カラーバッファ.
    VertexBuffer    m_TexCoords;            //!< テクスチャ座標バッファ.
    VertexBuffer    m_BoneIndices;          //!< ボーンインデックスバッファ.
    VertexBuffer    m_BoneWeights;          //!< ボーンウェイトバッファ.
    IndexBuffer     m_VertexIndices;        //!< 頂点インデックスバッファ.
    uint32_t        m_VertexCount   = 0;    //!< 頂点数.
    uint32_t        m_IndexCount    = 0;    //!< 頂点インデックス数.
    BoundingSphere3 m_BoundingSphere;       //!< バウンディングスフィア.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
