//-----------------------------------------------------------------------------
// File : asdxAllocationHolder.cpp
// Desc : Allocation Holder.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <gfx/asdxAllocationHolder.h>
#include <D3D12MemAlloc.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// AllocationHolder class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
AllocationHolder::AllocationHolder()
: m_Allocation(nullptr)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
AllocationHolder::AllocationHolder(D3D12MA::Allocation* value)
: m_Allocation(value)
{
    if (m_Allocation != nullptr)
    { m_Allocation->AddRef(); }
}

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
AllocationHolder::~AllocationHolder()
{ Reset(); }

//-----------------------------------------------------------------------------
//      解放処理を行います.
//-----------------------------------------------------------------------------
void AllocationHolder::Reset()
{
    if (m_Allocation != nullptr)
    {
        m_Allocation->Release();
        m_Allocation = nullptr;
    }
}

//-----------------------------------------------------------------------------
//      アタッチします.
//-----------------------------------------------------------------------------
void AllocationHolder::Attach(D3D12MA::Allocation* value)
{
    if (m_Allocation != nullptr)
    { m_Allocation->Release(); }
    m_Allocation = value;
}

//-----------------------------------------------------------------------------
//      デタッチします.
//-----------------------------------------------------------------------------
D3D12MA::Allocation* AllocationHolder::Detach()
{
    auto res = m_Allocation;
    m_Allocation = nullptr;
    return res;
}

} // namespace asdx
