//-----------------------------------------------------------------------------
// File : asdxModelInstanceImpl.h
// Desc : Model Instance Implementation.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <atomic>
#include <unordered_map>
#include <fnd/asdxList.h>
#include <fnd/asdxOffsetAllocator.h>
#include "asdxModelImpl.h"


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ModelInstance class
///////////////////////////////////////////////////////////////////////////////
class ModelInstance 
: public IModelInstance
, public List<ModelInstance>::Node
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      生成処理を行います.
    //! 
    //! @param[in]      pMasterModel        マスターモデル.
    //! @param[in]      instanceId          インスタンスID.
    //! @param[out]     ppModelInstance     モデルインスタンスの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    static bool Create(Model* pMasterModel, const OffsetHandle& offsetHandle, ModelInstance** ppInstance);

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを増やします.
    //-------------------------------------------------------------------------
    void AddRef() override;

    //-------------------------------------------------------------------------
    //! @brief      解放処理を行います.
    //-------------------------------------------------------------------------
    void Release() override;

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを取得します.
    //! 
    //! @return     参照カウンタを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetRefCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMaterialCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名を取得します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @return     マテリアル名を返却します.
    //-------------------------------------------------------------------------
    const std::string& GetMaterialName(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @return     マテリアルを返却します.
    //-------------------------------------------------------------------------
    IMaterial* GetMaterial(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを設定します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @param[in]      pMaterial   設定するマテリアル.
    //-------------------------------------------------------------------------
    void SetMaterial(size_t index, IMaterial* pMaterial) override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを持つかどうかチェックします.
    //! 
    //! @retval true    ボーンを持ちます.
    //! @retval false   ボーンを持ちません.
    //-------------------------------------------------------------------------
    bool HasBone() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーン数を取得します.
    //! 
    //! @return     ボーン数を返却します.
    //-------------------------------------------------------------------------
    size_t GetBoneCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーン名を取得します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @return     ボーンを返却します.
    //-------------------------------------------------------------------------
    const std::string& GetBoneName(size_t i) const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンオフセットぎょるえつを取得します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @return     ボーンを返却します.
    //-------------------------------------------------------------------------
    const Matrix& GetBoneOffsetMatrix(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ数を取得します.
    //! 
    //! @return     メッシュ数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMeshCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @return     メッシュを返却します.
    //-------------------------------------------------------------------------
    const IMesh* GetMesh(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    const BoundingSphere3& GetBoundingSphere() const override;

    //-------------------------------------------------------------------------
    //! @brief      インスタンスIDを取得します.
    //! 
    //! @return     インスタンスIDを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetInstanceId() const override;

    //-------------------------------------------------------------------------
    //! @brief      ワールド行列を設定します.
    //! 
    //! @param[in]      value       ワールド行列設定.
    //-------------------------------------------------------------------------
    void SetWorldMatrix(const Matrix& value) override;

    //-------------------------------------------------------------------------
    //! @brief      ワールド行列を取得します.
    //! 
    //! @return     ワールド行列を返却します.
    //-------------------------------------------------------------------------
    const Matrix& GetWorldMatrix() const override;

    //-------------------------------------------------------------------------
    //! @brief      スキニング行列を設定します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @param[in]      value       スキニング行列.
    //-------------------------------------------------------------------------
    void SetSkinningMatrix(size_t index, const Matrix& value) override;

    //-------------------------------------------------------------------------
    //! @brief      スキニング行列を取得します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @return     スキニング行列を返却します.
    //-------------------------------------------------------------------------
    const Matrix& GetSkinningMatrix(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを取得します.
    //! 
    //! @retval true    表示.
    //! @retval false   非表示.
    //-------------------------------------------------------------------------
    bool IsVisible() const override;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを設定します.
    //! 
    //! @param[in]      value       表示する場合は true を設定します.
    //-------------------------------------------------------------------------
    void SetVisibility(bool value) override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @retval true    表示.
    //! @retval false   非表示.
    //-------------------------------------------------------------------------
    bool IsVisibleMesh(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを設定します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @param[in]      value       表示する場合は true を設定します.
    //-------------------------------------------------------------------------
    void SetMeshVisibility(size_t index, bool value) override;

    //-------------------------------------------------------------------------
    //! @brief      ワールド行列のダーティフラグを取得します.
    //! 
    //! @retval true    更新あり.
    //! @retval fasle   更新なし.
    //-------------------------------------------------------------------------
    bool IsDirtyWorld() const;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグのダーティフラグを取得します.
    //! 
    //! @retval true    更新あり.
    //! @retval false   更新なし.
    //-------------------------------------------------------------------------
    bool IsDirtyVisibility() const;

    //-------------------------------------------------------------------------
    //! @brief      ダーティフラグをクリアします.
    //-------------------------------------------------------------------------
    void ClearDirtyFlags();

    //-------------------------------------------------------------------------
    //! @brief      オフセットハンドルを取得します.
    //!
    //! @return     オフセットハンドルを返却します.
    //-------------------------------------------------------------------------
    OffsetHandle& GetOffsetHandle();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::atomic<uint32_t>                       m_RefCount          = {};
    Model*                                      m_pMasterModel      = nullptr;
    OffsetHandle                                m_OffsetHandle      = {};
    bool                                        m_Visible           = true;
    Matrix                                      m_World             = Matrix::CreateIdentity();
    BoundingSphere3                             m_BoundingSphere    = {};
    std::vector<Matrix>                         m_SkinningMatrices  = {};
    std::unordered_map<size_t, IMaterial*>      m_Materials         = {};
    std::unordered_map<size_t, bool>            m_MeshVisibilities  = {};
    bool                                        m_DirtyWorld        = false;
    bool                                        m_DirtyVisibility   = false;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ModelInstance();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ModelInstance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      pMasterModel        マスターモデル.
    //! @param[in]      handle              ハンドル.
    //! @retval true    初期化に成功.
    //! @retval fasle   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(Model* pMasterModel, const OffsetHandle& handle);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();
};

} // namespace asdx
