//----------------------------------------------------------------------------
// File : asdxModelImpl.h
// Desc : Model Implementation.
// Copyright(c) Project Asura. All right reserved.
//----------------------------------------------------------------------------
#pragma once

//----------------------------------------------------------------------------
// Includes
//----------------------------------------------------------------------------
#include <atomic>
#include <fnd/asdxList.h>
#include "asdxMeshImpl.h"


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations.
//-----------------------------------------------------------------------------
class ModelBinary;


///////////////////////////////////////////////////////////////////////////////
// Model class
///////////////////////////////////////////////////////////////////////////////
class Model
: public IModel
, public List<Model>::Node
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      モデルを生成します.
    //! 
    //! @param[in]      binary      モデルバイナリ.
    //! @param[out]     ppModel     モデルの格納先.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    static bool Create(const ModelBinary& binary, Model** ppModel);

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを増やします.
    //-------------------------------------------------------------------------
    void AddRef() override;

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを減らします.
    //-------------------------------------------------------------------------
    void Release() override;

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを取得します.
    //! 
    //! @return     参照カウンタを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetRefCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル数を取得します.
    //! 
    //! @return     マテリアル数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMaterialCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアル名を取得します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @return     マテリアル名を返却します.
    //-------------------------------------------------------------------------
    const std::string& GetMaterialName(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //! 
    //! @param[in]      index       マテリアル番号
    //! @return     マテリアルを返却します.
    //-------------------------------------------------------------------------
    IMaterial* GetMaterial(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを設定します.
    //! 
    //! @param[in]      index       マテリアル番号.
    //! @param[in]      pMaterial   設定するマテリアル.
    //-------------------------------------------------------------------------
    void SetMaterial(size_t index, IMaterial* pMaterial) override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンを持つかどうかチェックします.
    //! 
    //! @retval true    ボーンを持ちます.
    //! @retval false   ボーンを持ちません.
    //-------------------------------------------------------------------------
    bool HasBone() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーン数を取得します.
    //! 
    //! @return     ボーン数を返却します.
    //-------------------------------------------------------------------------
    size_t GetBoneCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーン名を取得します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @return     指定されたボーン名を返却します.
    //-------------------------------------------------------------------------
    const std::string& GetBoneName(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      ボーンオフセット行列を取得します.
    //! 
    //! @param[in]      index       ボーン番号.
    //! @return     指定されたボーンオフセット行列を返却します.
    //-------------------------------------------------------------------------
    const Matrix& GetBoneOffsetMatrix(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュ数を取得します.
    //! 
    //! @return     メッシュ数を返却します.
    //-------------------------------------------------------------------------
    size_t GetMeshCount() const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @return     指定されたメッシュを返却します.
    //-------------------------------------------------------------------------
    const IMesh* GetMesh(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを取得します.
    //! 
    //! @retval true    表示.
    //! @retval false   非表示.
    //-------------------------------------------------------------------------
    bool IsVisible() const override;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグを設定します.
    //! 
    //! @param[in]      value       表示に設定する場合は true を指定.
    //-------------------------------------------------------------------------
    void SetVisibility(bool value) override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを取得します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @retval true    表示.
    //! @retval false   非表示.
    //-------------------------------------------------------------------------
    bool IsVisibleMesh(size_t index) const override;

    //-------------------------------------------------------------------------
    //! @brief      メッシュの可視フラグを設定します.
    //! 
    //! @param[in]      index       メッシュ番号.
    //! @param[in]      value       表示に設定する場合は true を指定.
    //-------------------------------------------------------------------------
    void SetMeshVisibility(size_t index, bool value) override;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを取得します.
    //! 
    //! @return     バウンディングスフィアを返却します.
    //-------------------------------------------------------------------------
    const BoundingSphere3& GetBoundingSphere() const;

    //-------------------------------------------------------------------------
    //! @brief      可視フラグのダーティフラグを取得します.
    //! 
    //! @retval true    更新されました.
    //! @retval false   更新はありません.
    //-------------------------------------------------------------------------
    bool IsDirtyVisibility() const;

    //-------------------------------------------------------------------------
    //! @brief      ダーティフラグをクリアします.
    //-------------------------------------------------------------------------
    void ClearDirtyFlags();

private:
    ///////////////////////////////////////////////////////////////////////////
    // MaterialSlot structure
    ///////////////////////////////////////////////////////////////////////////
    struct MaterialSlot
    {
        std::string     Name;                   //!< マテリアル名です.
        IMaterial*      pMaterial = nullptr;    //!< マテリアルです.
    };

    //=========================================================================
    // private variables.
    //=========================================================================
    std::atomic<uint32_t>       m_RefCount  = {};               //!< 参照カウントです.
    std::vector<MaterialSlot>   m_MaterialSlots;                //!< マテリアルスロットです.
    std::vector<std::string>    m_BoneNames;                    //!< ボーン名です.
    std::vector<Matrix>         m_BoneOffsetMatrices;           //!< ボーンオフセット行列です.
    std::vector<Mesh>           m_Meshes;                       //!< メッシュです.
    std::vector<bool>           m_MeshVisibilities;             //!< メッシュ可視性です.
    BoundingSphere3             m_BoundingSphere;               //!< バウンディングスフィアです.
    bool                        m_Visibility        = true;     //!< モデル可視性です.
    bool                        m_DirtyVisibility   = false;    //!< 可視性ダーティフラグ.

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Model();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~Model();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      binary      モデルバイナリ.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const ModelBinary& binary);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    Model             (const Model&) = delete;
    Model& operator = (const Model&) = delete;
};

} // namespace asdx
