//-----------------------------------------------------------------------------
// File : asdxModelManagerImpl.h
// Desc : Model Manager Implementation.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "asdxModelImpl.h"
#include "asdxModelInstanceImpl.h"
#include <fnd/asdxOffsetAllocator.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ModelManager class
///////////////////////////////////////////////////////////////////////////////
class ModelManager : public IModelManager
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      シングルトンインスタンスを取得します.
    //! 
    //! @return     シングルトンインスタンスを返却します.
    //-------------------------------------------------------------------------
    static ModelManager& Instance();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      maxInstanceCount        全インスタンス数.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(uint32_t maxInstanceCount);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      モデルを生成します.
    //! 
    //! @param[in]      blob        バイナリ.
    //! @param[out]     ppModel     モデルの格納先です.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //-------------------------------------------------------------------------
    bool CreateModel(const std::vector<uint8_t>& blob, IModel** ppModel) override;

    //-------------------------------------------------------------------------
    //! @brief      モデルインスタンスを生成します.
    //! 
    //! @param[in]      pMasterModel    マスターモデル.
    //! @param[out]     ppInstance      モデルインスタンスの格納先です.
    //-------------------------------------------------------------------------
    bool CreateModelInstance(IModel* pMasterModel, IModelInstance** ppInstance) override;

    //-------------------------------------------------------------------------
    //! @brief      各モデルに対して処理します.
    //! 
    //! @param[in]      action      コールバック関数です.
    //! @param[in]      userData    ユーザーデータです.
    //-------------------------------------------------------------------------
    void ForEachModel(OnModel action, void* userData) override;

    //-------------------------------------------------------------------------
    //! @brief      各モデルインスタンスに対して処理します.
    //! 
    //! @param[in]      action      コールバック関数です.
    //! @param[in]      userData    ユーザーデータです.
    //-------------------------------------------------------------------------
    void ForEachModelInstance(OnModelInstance action, void* userData) override;

    //-------------------------------------------------------------------------
    //! @brief      モデルを管理対象から削除します.
    //! 
    //! @param[in]      pModel      削除するモデル.
    //-------------------------------------------------------------------------
    void RemoveModel(Model* pModel);

    //-------------------------------------------------------------------------
    //! @brief      モデルインスタンスを管理対象から削除します.
    //! 
    //! @param[in]      pInstance   削除するモデルインスタンス.
    //-------------------------------------------------------------------------
    void RemoveModelInstance(ModelInstance* pInstance);

    //-------------------------------------------------------------------------
    //! @brief      モデルリストを取得します.
    //! 
    //! @return     モデルリストを返却します.
    //-------------------------------------------------------------------------
    List<Model>& GetModels();

    //-------------------------------------------------------------------------
    //! @brief      モデルインスタンスリストを取得します.
    //! 
    //! @return     モデルインスタンスリストを返却します.
    //-------------------------------------------------------------------------
    List<ModelInstance>& GetModelInstances();

    //-------------------------------------------------------------------------
    //! @brief      モデルリストを取得します.
    //! 
    //! @return     モデルリストを返却します.
    //-------------------------------------------------------------------------
    const List<Model>& GetModels() const;

    //-------------------------------------------------------------------------
    //! @brief      モデルインスタンスリストを取得します.
    //! 
    //! @return     モデルインスタンスリストを返却します.
    //-------------------------------------------------------------------------
    const List<ModelInstance>& GetModelInstances() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    static ModelManager     s_Instance;
    List<Model>             m_Models;
    List<ModelInstance>     m_ModelInstances;
    OffsetAllocator         m_OffsetAllocator;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ModelManager();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ModelManager();
};

} // namespace asdx
